// Class ChaosNiagara.NiagaraDataInterfaceChaosDestruction
// Size : 0x230 (Inherited : 0x30)
struct UNiagaraDataInterfaceChaosDestruction : UNiagaraDataInterface {
	struct TSet<struct AChaosSolverActor*> ChaosSolverActorSet; // 0x30(0x50)
	enum class EDataSourceTypeEnum DataSourceType; // 0x80(0x1)
	unsigned char UnknownData_81[0x0003]; // 0x81(0x3)
	int32_t DataProcessFrequency; // 0x84(0x4)
	int32_t MaxNumberOfDataEntriesToSpawn; // 0x88(0x4)
	bool DoSpawn; // 0x8C(0x1)
	unsigned char UnknownData_8D[0x0003]; // 0x8D(0x3)
	struct FVector2D SpawnMultiplierMinMax; // 0x90(0x8)
	float SpawnChance; // 0x98(0x4)
	struct FVector2D ImpulseToSpawnMinMax; // 0x9C(0x8)
	struct FVector2D SpeedToSpawnMinMax; // 0xA4(0x8)
	struct FVector2D MassToSpawnMinMax; // 0xAC(0x8)
	struct FVector2D ExtentMinToSpawnMinMax; // 0xB4(0x8)
	struct FVector2D ExtentMaxToSpawnMinMax; // 0xBC(0x8)
	struct FVector2D VolumeToSpawnMinMax; // 0xC4(0x8)
	struct FVector2D SolverTimeToSpawnMinMax; // 0xCC(0x8)
	int32_t SurfaceTypeToSpawn; // 0xD4(0x4)
	enum class ELocationFilteringModeEnum LocationFilteringMode; // 0xD8(0x1)
	enum class ELocationXToSpawnEnum LocationXToSpawn; // 0xD9(0x1)
	unsigned char UnknownData_DA[0x0002]; // 0xDA(0x2)
	struct FVector2D LocationXToSpawnMinMax; // 0xDC(0x8)
	enum class ELocationYToSpawnEnum LocationYToSpawn; // 0xE4(0x1)
	unsigned char UnknownData_E5[0x0003]; // 0xE5(0x3)
	struct FVector2D LocationYToSpawnMinMax; // 0xE8(0x8)
	enum class ELocationZToSpawnEnum LocationZToSpawn; // 0xF0(0x1)
	unsigned char UnknownData_F1[0x0003]; // 0xF1(0x3)
	struct FVector2D LocationZToSpawnMinMax; // 0xF4(0x8)
	enum class EDataSortTypeEnum DataSortingType; // 0xFC(0x1)
	bool bGetExternalCollisionData; // 0xFD(0x1)
	bool DoSpatialHash; // 0xFE(0x1)
	unsigned char UnknownData_FF[0x0001]; // 0xFF(0x1)
	struct FVector SpatialHashVolumeMin; // 0x100(0xC)
	struct FVector SpatialHashVolumeMax; // 0x10C(0xC)
	struct FVector SpatialHashVolumeCellSize; // 0x118(0xC)
	int32_t MaxDataPerCell; // 0x124(0x4)
	bool bApplyMaterialsFilter; // 0x128(0x1)
	unsigned char UnknownData_129[0x0007]; // 0x129(0x7)
	struct TSet<struct UPhysicalMaterial*> ChaosBreakingMaterialSet; // 0x130(0x50)
	bool bGetExternalBreakingData; // 0x180(0x1)
	bool bGetExternalTrailingData; // 0x181(0x1)
	unsigned char UnknownData_182[0x0002]; // 0x182(0x2)
	struct FVector2D RandomPositionMagnitudeMinMax; // 0x184(0x8)
	float InheritedVelocityMultiplier; // 0x18C(0x4)
	enum class ERandomVelocityGenerationTypeEnum RandomVelocityGenerationType; // 0x190(0x1)
	unsigned char UnknownData_191[0x0003]; // 0x191(0x3)
	struct FVector2D RandomVelocityMagnitudeMinMax; // 0x194(0x8)
	float SpreadAngleMax; // 0x19C(0x4)
	struct FVector VelocityOffsetMin; // 0x1A0(0xC)
	struct FVector VelocityOffsetMax; // 0x1AC(0xC)
	struct FVector2D FinalVelocityMagnitudeMinMax; // 0x1B8(0x8)
	float MaxLatency; // 0x1C0(0x4)
	enum class EDebugTypeEnum DebugType; // 0x1C4(0x1)
	unsigned char UnknownData_1C5[0x0003]; // 0x1C5(0x3)
	int32_t LastSpawnedPointID; // 0x1C8(0x4)
	float LastSpawnTime; // 0x1CC(0x4)
	unsigned char UnknownData_1D0[0x0010]; // 0x1D0(0x10)
	float SolverTime; // 0x1E0(0x4)
	float TimeStampOfLastProcessedData; // 0x1E4(0x4)
	unsigned char UnknownData_1E8[0x0048]; // 0x1E8(0x48)
};

