// Class LuminRuntimeSettings.LuminRuntimeSettings
// Size : 0x148 (Inherited : 0x28)
struct ULuminRuntimeSettings : UObject {
	struct FString PackageName; // 0x28(0x10)
	struct FString ApplicationDisplayName; // 0x38(0x10)
	enum class ELuminFrameTimingHint FrameTimingHint; // 0x48(0x1)
	bool bProtectedContent; // 0x49(0x1)
	bool bManualCallToAppReady; // 0x4A(0x1)
	bool bUseMobileRendering; // 0x4B(0x1)
	bool bUseVulkan; // 0x4C(0x1)
	unsigned char UnknownData_4D[0x0003]; // 0x4D(0x3)
	struct FFilePath Certificate; // 0x50(0x10)
	struct FDirectoryPath IconModelPath; // 0x60(0x10)
	struct FDirectoryPath IconPortalPath; // 0x70(0x10)
	struct FLocalizedIconInfos LocalizedIconInfos; // 0x80(0x10)
	int32_t VersionCode; // 0x90(0x4)
	int32_t MinimumAPILevel; // 0x94(0x4)
	struct TArray<enum class ELuminPrivilege> AppPrivileges; // 0x98(0x10)
	struct TArray<struct FLuminComponentSubElement> ExtraComponentSubElements; // 0xA8(0x10)
	struct TArray<struct FLuminComponentElement> ExtraComponentElements; // 0xB8(0x10)
	struct FString SpatializationPlugin; // 0xC8(0x10)
	struct FString ReverbPlugin; // 0xD8(0x10)
	struct FString OcclusionPlugin; // 0xE8(0x10)
	int32_t SoundCueCookQualityIndex; // 0xF8(0x4)
	bool bRemoveDebugInfo; // 0xFC(0x1)
	unsigned char UnknownData_FD[0x0003]; // 0xFD(0x3)
	struct FDirectoryPath VulkanValidationLayerLibs; // 0x100(0x10)
	bool bFrameVignette; // 0x110(0x1)
	unsigned char UnknownData_111[0x0007]; // 0x111(0x7)
	struct TArray<struct FLocalizedAppName> LocalizedAppNames; // 0x118(0x10)
	unsigned char UnknownData_128[0x0020]; // 0x128(0x20)
};

