// ScriptStruct PhysicsCore.BodyInstanceCore
// Size : 0x18 (Inherited : 0x0)
struct FBodyInstanceCore {
	unsigned char UnknownData_0[0x0010]; // 0x0(0x10)
	unsigned char bSimulatePhysics : 1; // 0x10(0x1)
	unsigned char bOverrideMass : 1; // 0x10(0x1)
	unsigned char bEnableGravity : 1; // 0x10(0x1)
	unsigned char bAutoWeld : 1; // 0x10(0x1)
	unsigned char bStartAwake : 1; // 0x10(0x1)
	unsigned char bGenerateWakeEvents : 1; // 0x10(0x1)
	unsigned char bUpdateMassWhenScaleChanges : 1; // 0x10(0x1)
	unsigned char UnknownData_11[0x0007]; // 0x11(0x7)
};

