// Class Engine.MaterialExpression
// Size : 0x40 (Inherited : 0x28)
struct UMaterialExpression : UObject {
	struct UMaterial* Material; // 0x28(0x8)
	struct UMaterialFunction* Function; // 0x30(0x8)
	unsigned char bIsParameterExpression : 1; // 0x38(0x1)
	unsigned char UnknownData_38_1 : 7; // 0x38(0x1)
	unsigned char UnknownData_39[0x0007]; // 0x39(0x7)
};

// Class Engine.MaterialExpressionTextureBase
// Size : 0x50 (Inherited : 0x40)
struct UMaterialExpressionTextureBase : UMaterialExpression {
	struct UTexture* Texture; // 0x40(0x8)
	enum class EMaterialSamplerType SamplerType; // 0x48(0x1)
	unsigned char IsDefaultMeshpaintTexture : 1; // 0x49(0x1)
	unsigned char UnknownData_49_1 : 7; // 0x49(0x1)
	unsigned char UnknownData_4A[0x0006]; // 0x4A(0x6)
};

// Class Engine.MaterialExpressionTextureSample
// Size : 0xD0 (Inherited : 0x50)
struct UMaterialExpressionTextureSample : UMaterialExpressionTextureBase {
	struct FExpressionInput Coordinates; // 0x50(0xC)
	unsigned char UnknownData_5C[0x0008]; // 0x5C(0x8)
	struct FExpressionInput TextureObject; // 0x64(0xC)
	unsigned char UnknownData_70[0x0008]; // 0x70(0x8)
	struct FExpressionInput MipValue; // 0x78(0xC)
	unsigned char UnknownData_84[0x0008]; // 0x84(0x8)
	struct FExpressionInput CoordinatesDX; // 0x8C(0xC)
	unsigned char UnknownData_98[0x0008]; // 0x98(0x8)
	struct FExpressionInput CoordinatesDY; // 0xA0(0xC)
	unsigned char UnknownData_AC[0x0008]; // 0xAC(0x8)
	struct FExpressionInput AutomaticViewMipBiasValue; // 0xB4(0xC)
	unsigned char UnknownData_C0[0x0008]; // 0xC0(0x8)
	enum class ETextureMipValueMode MipValueMode; // 0xC8(0x1)
	enum class ESamplerSourceMode SamplerSource; // 0xC9(0x1)
	unsigned char AutomaticViewMipBias : 1; // 0xCA(0x1)
	unsigned char UnknownData_CA_1 : 7; // 0xCA(0x1)
	enum class None ConstCoordinate; // 0xCB(0x1)
	int32_t ConstMipValue; // 0xCC(0x4)
};

// Class Engine.MaterialExpressionTextureSampleParameter
// Size : 0xF0 (Inherited : 0xD0)
struct UMaterialExpressionTextureSampleParameter : UMaterialExpressionTextureSample {
	struct FName ParameterName; // 0xD0(0x8)
	struct FGuid ExpressionGUID; // 0xD8(0x10)
	struct FName Group; // 0xE8(0x8)
};

// Class Engine.MaterialExpressionTextureSampleParameter2D
// Size : 0xF0 (Inherited : 0xF0)
struct UMaterialExpressionTextureSampleParameter2D : UMaterialExpressionTextureSampleParameter {
};

// Class Engine.Actor
// Size : 0x220 (Inherited : 0x28)
struct AActor : UObject {
	struct FActorTickFunction PrimaryActorTick; // 0x28(0x30)
	unsigned char bNetTemporary : 1; // 0x58(0x1)
	unsigned char bNetStartup : 1; // 0x58(0x1)
	unsigned char bOnlyRelevantToOwner : 1; // 0x58(0x1)
	unsigned char bAlwaysRelevant : 1; // 0x58(0x1)
	unsigned char bReplicateMovement : 1; // 0x58(0x1)
	unsigned char bHidden : 1; // 0x58(0x1)
	unsigned char bTearOff : 1; // 0x58(0x1)
	unsigned char bExchangedRoles : 1; // 0x58(0x1)
	unsigned char bNetLoadOnClient : 1; // 0x59(0x1)
	unsigned char bNetUseOwnerRelevancy : 1; // 0x59(0x1)
	unsigned char bRelevantForNetworkReplays : 1; // 0x59(0x1)
	unsigned char bRelevantForLevelBounds : 1; // 0x59(0x1)
	unsigned char bReplayRewindable : 1; // 0x59(0x1)
	unsigned char bAllowTickBeforeBeginPlay : 1; // 0x59(0x1)
	unsigned char bAutoDestroyWhenFinished : 1; // 0x59(0x1)
	unsigned char bCanBeDamaged : 1; // 0x59(0x1)
	unsigned char bBlockInput : 1; // 0x5A(0x1)
	unsigned char bCollideWhenPlacing : 1; // 0x5A(0x1)
	unsigned char bFindCameraComponentWhenViewTarget : 1; // 0x5A(0x1)
	unsigned char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x5A(0x1)
	unsigned char bIgnoresOriginShifting : 1; // 0x5A(0x1)
	unsigned char bEnableAutoLODGeneration : 1; // 0x5A(0x1)
	unsigned char bIsEditorOnlyActor : 1; // 0x5A(0x1)
	unsigned char bActorSeamlessTraveled : 1; // 0x5A(0x1)
	unsigned char bReplicates : 1; // 0x5B(0x1)
	unsigned char bCanBeInCluster : 1; // 0x5B(0x1)
	unsigned char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x5B(0x1)
	unsigned char UnknownData_5B_3 : 5; // 0x5B(0x1)
	unsigned char UnknownData_5C_0 : 2; // 0x5C(0x1)
	unsigned char bActorEnableCollision : 1; // 0x5C(0x1)
	unsigned char bActorIsBeingDestroyed : 1; // 0x5C(0x1)
	unsigned char UnknownData_5C_4 : 4; // 0x5C(0x1)
	enum class EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x5D(0x1)
	enum class EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x5E(0x1)
	enum class ENetRole RemoteRole; // 0x5F(0x1)
	struct FRepMovement ReplicatedMovement; // 0x60(0x34)
	float InitialLifeSpan; // 0x94(0x4)
	float CustomTimeDilation; // 0x98(0x4)
	unsigned char UnknownData_9C[0x0004]; // 0x9C(0x4)
	struct FRepAttachment AttachmentReplication; // 0xA0(0x40)
	struct AActor* Owner; // 0xE0(0x8)
	struct FName NetDriverName; // 0xE8(0x8)
	enum class ENetRole Role; // 0xF0(0x1)
	enum class ENetDormancy NetDormancy; // 0xF1(0x1)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0xF2(0x1)
	enum class EAutoReceiveInput AutoReceiveInput; // 0xF3(0x1)
	int32_t InputPriority; // 0xF4(0x4)
	struct UInputComponent* InputComponent; // 0xF8(0x8)
	float NetCullDistanceSquared; // 0x100(0x4)
	int32_t NetTag; // 0x104(0x4)
	float NetUpdateFrequency; // 0x108(0x4)
	float MinNetUpdateFrequency; // 0x10C(0x4)
	float NetPriority; // 0x110(0x4)
	unsigned char UnknownData_114[0x0004]; // 0x114(0x4)
	struct APawn* Instigator; // 0x118(0x8)
	struct TArray<struct AActor*> Children; // 0x120(0x10)
	struct USceneComponent* RootComponent; // 0x130(0x8)
	struct TArray<struct AMatineeActor*> ControllingMatineeActors; // 0x138(0x10)
	unsigned char UnknownData_148[0x0008]; // 0x148(0x8)
	struct TArray<struct FName> Layers; // 0x150(0x10)
	struct FWeakObjectPtr<struct UChildActorComponent> ParentComponent; // 0x160(0x8)
	unsigned char UnknownData_168[0x0008]; // 0x168(0x8)
	struct TArray<struct FName> Tags; // 0x170(0x10)
	struct FMulticastSparseDelegate OnTakeAnyDamage; // 0x180(0x1)
	struct FMulticastSparseDelegate OnTakePointDamage; // 0x181(0x1)
	struct FMulticastSparseDelegate OnTakeRadialDamage; // 0x182(0x1)
	struct FMulticastSparseDelegate OnActorBeginOverlap; // 0x183(0x1)
	struct FMulticastSparseDelegate OnActorEndOverlap; // 0x184(0x1)
	struct FMulticastSparseDelegate OnBeginCursorOver; // 0x185(0x1)
	struct FMulticastSparseDelegate OnEndCursorOver; // 0x186(0x1)
	struct FMulticastSparseDelegate OnClicked; // 0x187(0x1)
	struct FMulticastSparseDelegate OnReleased; // 0x188(0x1)
	struct FMulticastSparseDelegate OnInputTouchBegin; // 0x189(0x1)
	struct FMulticastSparseDelegate OnInputTouchEnd; // 0x18A(0x1)
	struct FMulticastSparseDelegate OnInputTouchEnter; // 0x18B(0x1)
	struct FMulticastSparseDelegate OnInputTouchLeave; // 0x18C(0x1)
	struct FMulticastSparseDelegate OnActorHit; // 0x18D(0x1)
	struct FMulticastSparseDelegate OnDestroyed; // 0x18E(0x1)
	struct FMulticastSparseDelegate OnEndPlay; // 0x18F(0x1)
	unsigned char UnknownData_190[0x0060]; // 0x190(0x60)
	struct TArray<struct UActorComponent*> InstanceComponents; // 0x1F0(0x10)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents; // 0x200(0x10)
	unsigned char UnknownData_210[0x0010]; // 0x210(0x10)

	bool WasRecentlyRendered(float Tolerance); // Function Engine.Actor.WasRecentlyRendered // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x5, 0x7FF77681A870
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript // (Event|Public|BlueprintEvent) // Param Size : 0x0, 0x7FF77510D9D0
	void TearOff(); // Function Engine.Actor.TearOff // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF775B89840
	void SnapRootComponentTo(struct AActor* InParentActor, struct FName InSocketName); // Function Engine.Actor.SnapRootComponentTo // (Final|Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF77681A7B0
	void SetTickGroup(enum class ETickingGroup NewTickGroup); // Function Engine.Actor.SetTickGroup // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77681A6A0
	void SetTickableWhenPaused(bool bTickableWhenPaused); // Function Engine.Actor.SetTickableWhenPaused // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77681A720
	void SetReplicates(bool bInReplicates); // Function Engine.Actor.SetReplicates // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77681A610
	void SetReplicateMovement(bool bInReplicateMovement); // Function Engine.Actor.SetReplicateMovement // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77681A580
	void SetOwner(struct AActor* NewOwner); // Function Engine.Actor.SetOwner // (Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF77681A4F0
	void SetNetDormancy(enum class ENetDormancy NewDormancy); // Function Engine.Actor.SetNetDormancy // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77681A470
	void SetLifeSpan(float InLifespan); // Function Engine.Actor.SetLifeSpan // (Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77681A3F0
	void SetAutoDestroyWhenFinished(bool bVal); // Function Engine.Actor.SetAutoDestroyWhenFinished // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77681A360
	void SetActorTickInterval(float TickInterval); // Function Engine.Actor.SetActorTickInterval // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77681A2E0
	void SetActorTickEnabled(bool bEnabled); // Function Engine.Actor.SetActorTickEnabled // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77681A250
	void SetActorScale3D(struct FVector NewScale3D); // Function Engine.Actor.SetActorScale3D // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0xC, 0x7FF77681A1C0
	void SetActorRelativeScale3D(struct FVector NewRelativeScale); // Function Engine.Actor.SetActorRelativeScale3D // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0xC, 0x7FF77681A130
	void SetActorHiddenInGame(bool bNewHidden); // Function Engine.Actor.SetActorHiddenInGame // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77681A0A0
	void SetActorEnableCollision(bool bNewActorEnableCollision); // Function Engine.Actor.SetActorEnableCollision // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77681A010
	void RemoveTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.Actor.RemoveTickPrerequisiteComponent // (Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF776819F80
	void RemoveTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.Actor.RemoveTickPrerequisiteActor // (Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF776819EF0
	void ReceiveTick(float DeltaSeconds); // Function Engine.Actor.ReceiveTick // (Event|Public|BlueprintEvent) // Param Size : 0x4, 0x7FF77510D9D0
	void ReceiveRadialDamage(float DamageReceived, struct UDamageType* DamageType, struct FVector Origin, struct FHitResult HitInfo, struct AController* InstigatedBy, struct AActor* DamageCauser); // Function Engine.Actor.ReceiveRadialDamage // (BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // Param Size : 0xB8, 0x7FF77510D9D0
	void ReceivePointDamage(float Damage, struct UDamageType* DamageType, struct FVector HitLocation, struct FVector HitNormal, struct UPrimitiveComponent* HitComponent, struct FName BoneName, struct FVector ShotFromDirection, struct AController* InstigatedBy, struct AActor* DamageCauser, struct FHitResult HitInfo); // Function Engine.Actor.ReceivePointDamage // (BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // Param Size : 0xE0, 0x7FF77510D9D0
	void ReceiveHit(struct UPrimitiveComponent* MyComp, struct AActor* Other, struct UPrimitiveComponent* OtherComp, bool bSelfMoved, struct FVector HitLocation, struct FVector HitNormal, struct FVector NormalImpulse, struct FHitResult Hit); // Function Engine.Actor.ReceiveHit // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // Param Size : 0xC8, 0x7FF77510D9D0
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason); // Function Engine.Actor.ReceiveEndPlay // (Event|Protected|BlueprintEvent) // Param Size : 0x1, 0x7FF77510D9D0
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed // (Event|Public|BlueprintEvent) // Param Size : 0x0, 0x7FF77510D9D0
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // Param Size : 0x0, 0x7FF77510D9D0
	void ReceiveAnyDamage(float Damage, struct UDamageType* DamageType, struct AController* InstigatedBy, struct AActor* DamageCauser); // Function Engine.Actor.ReceiveAnyDamage // (BlueprintAuthorityOnly|Event|Public|BlueprintEvent) // Param Size : 0x20, 0x7FF77510D9D0
	void ReceiveActorOnReleased(struct FKey ButtonReleased); // Function Engine.Actor.ReceiveActorOnReleased // (Event|Public|BlueprintEvent) // Param Size : 0x18, 0x7FF77510D9D0
	void ReceiveActorOnInputTouchLeave(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchLeave // (Event|Public|BlueprintEvent) // Param Size : 0x1, 0x7FF77510D9D0
	void ReceiveActorOnInputTouchEnter(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchEnter // (Event|Public|BlueprintEvent) // Param Size : 0x1, 0x7FF77510D9D0
	void ReceiveActorOnInputTouchEnd(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchEnd // (Event|Public|BlueprintEvent) // Param Size : 0x1, 0x7FF77510D9D0
	void ReceiveActorOnInputTouchBegin(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchBegin // (Event|Public|BlueprintEvent) // Param Size : 0x1, 0x7FF77510D9D0
	void ReceiveActorOnClicked(struct FKey ButtonPressed); // Function Engine.Actor.ReceiveActorOnClicked // (Event|Public|BlueprintEvent) // Param Size : 0x18, 0x7FF77510D9D0
	void ReceiveActorEndOverlap(struct AActor* OtherActor); // Function Engine.Actor.ReceiveActorEndOverlap // (Event|Public|BlueprintEvent) // Param Size : 0x8, 0x7FF77510D9D0
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver // (Event|Public|BlueprintEvent) // Param Size : 0x0, 0x7FF77510D9D0
	void ReceiveActorBeginOverlap(struct AActor* OtherActor); // Function Engine.Actor.ReceiveActorBeginOverlap // (Event|Public|BlueprintEvent) // Param Size : 0x8, 0x7FF77510D9D0
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver // (Event|Public|BlueprintEvent) // Param Size : 0x0, 0x7FF77510D9D0
	void PrestreamTextures(float Seconds, bool bEnableStreaming, int32_t CinematicTextureGroups); // Function Engine.Actor.PrestreamTextures // (Native|Public|BlueprintCallable) // Param Size : 0xC, 0x7FF776819DE0
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement // (Native|Public) // Param Size : 0x0, 0x7FF775B89820
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement // (Native|Public) // Param Size : 0x0, 0x7FF776819DC0
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner // (Native|Protected) // Param Size : 0x0, 0x7FF775FD62D0
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator // (Native|Public) // Param Size : 0x0, 0x7FF776819DA0
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication // (Native|Public) // Param Size : 0x0, 0x7FF775B896A0
	void MakeNoise(float Loudness, struct APawn* NoiseInstigator, struct FVector NoiseLocation, float MaxRange, struct FName Tag); // Function Engine.Actor.MakeNoise // (Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x28, 0x7FF776819C10
	struct UMaterialInstanceDynamic* MakeMIDForMaterial(struct UMaterialInterface* Parent); // Function Engine.Actor.MakeMIDForMaterial // (Final|Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF776819B80
	bool K2_TeleportTo(struct FVector DestLocation, struct FRotator DestRotation); // Function Engine.Actor.K2_TeleportTo // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x19, 0x7FF776819A90
	bool K2_SetActorTransform(struct FTransform NewTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorTransform // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xBE, 0x7FF7768198A0
	bool K2_SetActorRotation(struct FRotator NewRotation, bool bTeleportPhysics); // Function Engine.Actor.K2_SetActorRotation // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0xE, 0x7FF7768197C0
	void K2_SetActorRelativeTransform(struct FTransform NewRelativeTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeTransform // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xBD, 0x7FF7768195D0
	void K2_SetActorRelativeRotation(struct FRotator NewRelativeRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeRotation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x99, 0x7FF776819420
	void K2_SetActorRelativeLocation(struct FVector NewRelativeLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x99, 0x7FF776819270
	bool K2_SetActorLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorLocationAndRotation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xA6, 0x7FF776819080
	bool K2_SetActorLocation(struct FVector NewLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x9A, 0x7FF776818ED0
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset // (Event|Public|BlueprintEvent) // Param Size : 0x0, 0x7FF77510D9D0
	void K2_OnEndViewTarget(struct APlayerController* PC); // Function Engine.Actor.K2_OnEndViewTarget // (Event|Public|BlueprintEvent) // Param Size : 0x8, 0x7FF77510D9D0
	void K2_OnBecomeViewTarget(struct APlayerController* PC); // Function Engine.Actor.K2_OnBecomeViewTarget // (Event|Public|BlueprintEvent) // Param Size : 0x8, 0x7FF77510D9D0
	struct USceneComponent* K2_GetRootComponent(); // Function Engine.Actor.K2_GetRootComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776818EB0
	struct TArray<struct UActorComponent*> K2_GetComponentsByClass(class UActorComponent* ComponentClass); // Function Engine.Actor.K2_GetComponentsByClass // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x18, 0x7FF776818DD0
	struct FRotator K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776818D10
	struct FVector K2_GetActorLocation(); // Function Engine.Actor.K2_GetActorLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776818C90
	void K2_DetachFromActor(enum class EDetachmentRule LocationRule, enum class EDetachmentRule RotationRule, enum class EDetachmentRule ScaleRule); // Function Engine.Actor.K2_DetachFromActor // (Final|Native|Public|BlueprintCallable) // Param Size : 0x3, 0x7FF776818B90
	void K2_DestroyComponent(struct UActorComponent* Component); // Function Engine.Actor.K2_DestroyComponent // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF776818B10
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776818AF0
	void K2_AttachToComponent(struct USceneComponent* Parent, struct FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachToComponent // (Final|Native|Public|BlueprintCallable) // Param Size : 0x14, 0x7FF776818930
	void K2_AttachToActor(struct AActor* ParentActor, struct FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachToActor // (Final|Native|Public|BlueprintCallable) // Param Size : 0x14, 0x7FF776818770
	void K2_AttachRootComponentToActor(struct AActor* InParentActor, struct FName InSocketName, enum class EAttachLocation AttachLocationType, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachRootComponentToActor // (Final|Native|Public|BlueprintCallable) // Param Size : 0x12, 0x7FF776818620
	void K2_AttachRootComponentTo(struct USceneComponent* InParent, struct FName InSocketName, enum class EAttachLocation AttachLocationType, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachRootComponentTo // (Final|Native|Public|BlueprintCallable) // Param Size : 0x12, 0x7FF7768184D0
	void K2_AddActorWorldTransform(struct FTransform DeltaTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldTransform // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xBD, 0x7FF7768182E0
	void K2_AddActorWorldRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldRotation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x99, 0x7FF776818130
	void K2_AddActorWorldOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldOffset // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x99, 0x7FF776817F80
	void K2_AddActorLocalTransform(struct FTransform NewTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalTransform // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xBD, 0x7FF776817D90
	void K2_AddActorLocalRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalRotation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x99, 0x7FF776817BE0
	void K2_AddActorLocalOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalOffset // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x99, 0x7FF776817A30
	bool IsOverlappingActor(struct AActor* Other); // Function Engine.Actor.IsOverlappingActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x9, 0x7FF7768179A0
	bool IsChildActor(); // Function Engine.Actor.IsChildActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776817970
	bool IsActorTickEnabled(); // Function Engine.Actor.IsActorTickEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776817940
	bool IsActorBeingDestroyed(); // Function Engine.Actor.IsActorBeingDestroyed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776817910
	bool HasAuthority(); // Function Engine.Actor.HasAuthority // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF7768178E0
	float GetVerticalDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetVerticalDistanceTo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776817840
	struct FVector GetVelocity(); // Function Engine.Actor.GetVelocity // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776817800
	struct FTransform GetTransform(); // Function Engine.Actor.GetTransform // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x30, 0x7FF7768177B0
	bool GetTickableWhenPaused(); // Function Engine.Actor.GetTickableWhenPaused // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776817780
	float GetSquaredDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetSquaredDistanceTo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF7768176E0
	enum class ENetRole GetRemoteRole(); // Function Engine.Actor.GetRemoteRole // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF774D71E60
	struct UChildActorComponent* GetParentComponent(); // Function Engine.Actor.GetParentComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF7768176B0
	struct AActor* GetParentActor(); // Function Engine.Actor.GetParentActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776817680
	struct AActor* GetOwner(); // Function Engine.Actor.GetOwner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF775EF7BE0
	void GetOverlappingComponents(struct TArray<struct UPrimitiveComponent*> OverlappingComponents); // Function Engine.Actor.GetOverlappingComponents // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF7768175D0
	void GetOverlappingActors(struct TArray<struct AActor*> OverlappingActors, class AActor* ClassFilter); // Function Engine.Actor.GetOverlappingActors // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x18, 0x7FF7768174E0
	enum class ENetRole GetLocalRole(); // Function Engine.Actor.GetLocalRole // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF7768174C0
	float GetLifeSpan(); // Function Engine.Actor.GetLifeSpan // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF776817480
	struct AController* GetInstigatorController(); // Function Engine.Actor.GetInstigatorController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776817450
	struct APawn* GetInstigator(); // Function Engine.Actor.GetInstigator // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776817420
	struct FVector GetInputVectorAxisValue(struct FKey InputAxisKey); // Function Engine.Actor.GetInputVectorAxisValue // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x24, 0x7FF776817320
	float GetInputAxisValue(struct FName InputAxisName); // Function Engine.Actor.GetInputAxisValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776817280
	float GetInputAxisKeyValue(struct FKey InputAxisKey); // Function Engine.Actor.GetInputAxisKeyValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1C, 0x7FF776817190
	float GetHorizontalDotProductTo(struct AActor* OtherActor); // Function Engine.Actor.GetHorizontalDotProductTo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF7768170F0
	float GetHorizontalDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetHorizontalDistanceTo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776817050
	float GetGameTimeSinceCreation(); // Function Engine.Actor.GetGameTimeSinceCreation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF776817020
	float GetDotProductTo(struct AActor* OtherActor); // Function Engine.Actor.GetDotProductTo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776816F80
	float GetDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetDistanceTo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776816EE0
	struct TArray<struct UActorComponent*> GetComponentsByTag(class UActorComponent* ComponentClass, struct FName Tag); // Function Engine.Actor.GetComponentsByTag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x20, 0x7FF776816DE0
	struct TArray<struct UActorComponent*> GetComponentsByInterface(class UInterface* Interface); // Function Engine.Actor.GetComponentsByInterface // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x18, 0x7FF776816D00
	struct UActorComponent* GetComponentByClass(class UActorComponent* ComponentClass); // Function Engine.Actor.GetComponentByClass // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF776816C70
	struct FName GetAttachParentSocketName(); // Function Engine.Actor.GetAttachParentSocketName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776816B30
	struct AActor* GetAttachParentActor(); // Function Engine.Actor.GetAttachParentActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776816B00
	void GetAttachedActors(struct TArray<struct AActor*> OutActors, bool bResetArray); // Function Engine.Actor.GetAttachedActors // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x11, 0x7FF776816B70
	void GetAllChildActors(struct TArray<struct AActor*> ChildActors, bool bIncludeDescendants); // Function Engine.Actor.GetAllChildActors // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x11, 0x7FF776816A00
	struct FVector GetActorUpVector(); // Function Engine.Actor.GetActorUpVector // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776816990
	float GetActorTimeDilation(); // Function Engine.Actor.GetActorTimeDilation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF776816960
	float GetActorTickInterval(); // Function Engine.Actor.GetActorTickInterval // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF776816930
	struct FVector GetActorScale3D(); // Function Engine.Actor.GetActorScale3D // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF7768168F0
	struct FVector GetActorRightVector(); // Function Engine.Actor.GetActorRightVector // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776816880
	struct FVector GetActorRelativeScale3D(); // Function Engine.Actor.GetActorRelativeScale3D // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776816840
	struct FVector GetActorForwardVector(); // Function Engine.Actor.GetActorForwardVector // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF7768167D0
	void GetActorEyesViewPoint(struct FVector OutLocation, struct FRotator OutRotation); // Function Engine.Actor.GetActorEyesViewPoint // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x18, 0x7FF7768166E0
	bool GetActorEnableCollision(); // Function Engine.Actor.GetActorEnableCollision // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF7768166B0
	void GetActorBounds(bool bOnlyCollidingComponents, struct FVector Origin, struct FVector BoxExtent, bool bIncludeFromChildActors); // Function Engine.Actor.GetActorBounds // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1D, 0x7FF776816530
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776816510
	void FlushNetDormancy(); // Function Engine.Actor.FlushNetDormancy // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF7768164F0
	void EnableInput(struct APlayerController* PlayerController); // Function Engine.Actor.EnableInput // (Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF775FD23C0
	void DisableInput(struct APlayerController* PlayerController); // Function Engine.Actor.DisableInput // (Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF775FBF3B0
	void DetachRootComponentFromParent(bool bMaintainWorldPosition); // Function Engine.Actor.DetachRootComponentFromParent // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776816460
	void AddTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.Actor.AddTickPrerequisiteComponent // (Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF7768163D0
	void AddTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.Actor.AddTickPrerequisiteActor // (Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF776816340
	struct UActorComponent* AddComponent(struct FName TemplateName, bool bManualAttachment, struct FTransform RelativeTransform, struct UObject* ComponentTemplateContext); // Function Engine.Actor.AddComponent // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x50, 0x7FF776816180
	bool ActorHasTag(struct FName Tag); // Function Engine.Actor.ActorHasTag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x9, 0x7FF7768160F0
};

// Class Engine.Pawn
// Size : 0x280 (Inherited : 0x220)
struct APawn : AActor {
	unsigned char UnknownData_220[0x0008]; // 0x220(0x8)
	unsigned char bUseControllerRotationPitch : 1; // 0x228(0x1)
	unsigned char bUseControllerRotationYaw : 1; // 0x228(0x1)
	unsigned char bUseControllerRotationRoll : 1; // 0x228(0x1)
	unsigned char bCanAffectNavigationGeneration : 1; // 0x228(0x1)
	unsigned char UnknownData_228_4 : 4; // 0x228(0x1)
	unsigned char UnknownData_229[0x0003]; // 0x229(0x3)
	float BaseEyeHeight; // 0x22C(0x4)
	enum class EAutoReceiveInput AutoPossessPlayer; // 0x230(0x1)
	enum class EAutoPossessAI AutoPossessAI; // 0x231(0x1)
	enum class None RemoteViewPitch; // 0x232(0x1)
	unsigned char UnknownData_233[0x0005]; // 0x233(0x5)
	class AController* AIControllerClass; // 0x238(0x8)
	struct APlayerState* PlayerState; // 0x240(0x8)
	unsigned char UnknownData_248[0x0008]; // 0x248(0x8)
	struct AController* LastHitBy; // 0x250(0x8)
	struct AController* Controller; // 0x258(0x8)
	unsigned char UnknownData_260[0x0004]; // 0x260(0x4)
	struct FVector ControlInputVector; // 0x264(0xC)
	struct FVector LastControlInputVector; // 0x270(0xC)
	unsigned char UnknownData_27C[0x0004]; // 0x27C(0x4)

	void SpawnDefaultController(); // Function Engine.Pawn.SpawnDefaultController // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776922340
	void SetCanAffectNavigationGeneration(bool bNewValue, bool bForceUpdate); // Function Engine.Pawn.SetCanAffectNavigationGeneration // (Final|Native|Public|BlueprintCallable) // Param Size : 0x2, 0x7FF776921C00
	void ReceiveUnpossessed(struct AController* OldController); // Function Engine.Pawn.ReceiveUnpossessed // (Event|Public|BlueprintEvent) // Param Size : 0x8, 0x7FF77510D9D0
	void ReceivePossessed(struct AController* NewController); // Function Engine.Pawn.ReceivePossessed // (Event|Public|BlueprintEvent) // Param Size : 0x8, 0x7FF77510D9D0
	void PawnMakeNoise(float Loudness, struct FVector NoiseLocation, bool bUseNoiseMakerLocation, struct AActor* NoiseMaker); // Function Engine.Pawn.PawnMakeNoise // (Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x20, 0x7FF776920F20
	void OnRep_PlayerState(); // Function Engine.Pawn.OnRep_PlayerState // (Native|Public) // Param Size : 0x0, 0x7FF774D2A800
	void OnRep_Controller(); // Function Engine.Pawn.OnRep_Controller // (Native|Public) // Param Size : 0x0, 0x7FF776920F00
	void LaunchPawn(struct FVector LaunchVelocity, bool bXYOverride, bool bZOverride); // Function Engine.Pawn.LaunchPawn // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0xE, 0x7FF776920DE0
	struct FVector K2_GetMovementInputVector(); // Function Engine.Pawn.K2_GetMovementInputVector // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776920CB0
	bool IsPlayerControlled(); // Function Engine.Pawn.IsPlayerControlled // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77687AF00
	bool IsPawnControlled(); // Function Engine.Pawn.IsPawnControlled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776920DB0
	bool IsMoveInputIgnored(); // Function Engine.Pawn.IsMoveInputIgnored // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776920D80
	bool IsLocallyControlled(); // Function Engine.Pawn.IsLocallyControlled // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776920D50
	bool IsControlled(); // Function Engine.Pawn.IsControlled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776920D20
	bool IsBotControlled(); // Function Engine.Pawn.IsBotControlled // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776920CF0
	struct FVector GetPendingMovementInputVector(); // Function Engine.Pawn.GetPendingMovementInputVector // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776920CB0
	struct FVector GetNavAgentLocation(); // Function Engine.Pawn.GetNavAgentLocation // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776920C30
	struct UPawnMovementComponent* GetMovementComponent(); // Function Engine.Pawn.GetMovementComponent // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776860130
	struct AActor* GetMovementBaseActor(struct APawn* Pawn); // Function Engine.Pawn.GetMovementBaseActor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // Param Size : 0x10, 0x7FF776920B10
	struct FVector GetLastMovementInputVector(); // Function Engine.Pawn.GetLastMovementInputVector // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776920AD0
	struct FRotator GetControlRotation(); // Function Engine.Pawn.GetControlRotation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776920A40
	struct AController* GetController(); // Function Engine.Pawn.GetController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776920A80
	struct FRotator GetBaseAimRotation(); // Function Engine.Pawn.GetBaseAimRotation // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF7769202A0
	void DetachFromControllerPendingDestroy(); // Function Engine.Pawn.DetachFromControllerPendingDestroy // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF7769200B0
	struct FVector ConsumeMovementInputVector(); // Function Engine.Pawn.ConsumeMovementInputVector // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0xC, 0x7FF77691FFA0
	void AddMovementInput(struct FVector WorldDirection, float ScaleValue, bool bForce); // Function Engine.Pawn.AddMovementInput // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x11, 0x7FF77691FD30
	void AddControllerYawInput(float Val); // Function Engine.Pawn.AddControllerYawInput // (Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77691FCB0
	void AddControllerRollInput(float Val); // Function Engine.Pawn.AddControllerRollInput // (Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77691FC30
	void AddControllerPitchInput(float Val); // Function Engine.Pawn.AddControllerPitchInput // (Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77691FBB0
};

// Class Engine.Character
// Size : 0x4C0 (Inherited : 0x280)
struct ACharacter : APawn {
	struct USkeletalMeshComponent* Mesh; // 0x280(0x8)
	struct UCharacterMovementComponent* CharacterMovement; // 0x288(0x8)
	struct UCapsuleComponent* CapsuleComponent; // 0x290(0x8)
	struct FBasedMovementInfo BasedMovement; // 0x298(0x30)
	struct FBasedMovementInfo ReplicatedBasedMovement; // 0x2C8(0x30)
	float AnimRootMotionTranslationScale; // 0x2F8(0x4)
	struct FVector BaseTranslationOffset; // 0x2FC(0xC)
	unsigned char UnknownData_308[0x0008]; // 0x308(0x8)
	struct FQuat BaseRotationOffset; // 0x310(0x10)
	float ReplicatedServerLastTransformUpdateTimeStamp; // 0x320(0x4)
	float ReplayLastTransformUpdateTimeStamp; // 0x324(0x4)
	enum class None ReplicatedMovementMode; // 0x328(0x1)
	bool bInBaseReplication; // 0x329(0x1)
	unsigned char UnknownData_32A[0x0002]; // 0x32A(0x2)
	float CrouchedEyeHeight; // 0x32C(0x4)
	unsigned char bIsCrouched : 1; // 0x330(0x1)
	unsigned char bProxyIsJumpForceApplied : 1; // 0x330(0x1)
	unsigned char bPressedJump : 1; // 0x330(0x1)
	unsigned char bClientUpdating : 1; // 0x330(0x1)
	unsigned char bClientWasFalling : 1; // 0x330(0x1)
	unsigned char bClientResimulateRootMotion : 1; // 0x330(0x1)
	unsigned char bClientResimulateRootMotionSources : 1; // 0x330(0x1)
	unsigned char bSimGravityDisabled : 1; // 0x330(0x1)
	unsigned char bClientCheckEncroachmentOnNetUpdate : 1; // 0x331(0x1)
	unsigned char bServerMoveIgnoreRootMotion : 1; // 0x331(0x1)
	unsigned char bWasJumping : 1; // 0x331(0x1)
	unsigned char UnknownData_331_3 : 5; // 0x331(0x1)
	unsigned char UnknownData_332[0x0002]; // 0x332(0x2)
	float JumpKeyHoldTime; // 0x334(0x4)
	float JumpForceTimeRemaining; // 0x338(0x4)
	float ProxyJumpForceStartedTime; // 0x33C(0x4)
	float JumpMaxHoldTime; // 0x340(0x4)
	int32_t JumpMaxCount; // 0x344(0x4)
	int32_t JumpCurrentCount; // 0x348(0x4)
	unsigned char UnknownData_34C[0x0004]; // 0x34C(0x4)
	struct FMulticastInlineDelegate OnReachedJumpApex; // 0x350(0x10)
	unsigned char UnknownData_360[0x0010]; // 0x360(0x10)
	struct FMulticastInlineDelegate MovementModeChangedDelegate; // 0x370(0x10)
	struct FMulticastInlineDelegate OnCharacterMovementUpdated; // 0x380(0x10)
	struct FRootMotionSourceGroup SavedRootMotion; // 0x390(0x38)
	unsigned char UnknownData_3C8[0x0008]; // 0x3C8(0x8)
	struct FRootMotionMovementParams ClientRootMotionParams; // 0x3D0(0x40)
	struct TArray<struct FSimulatedRootMotionReplicatedMove> RootMotionRepMoves; // 0x410(0x10)
	struct FRepRootMotionMontage RepRootMotion; // 0x420(0x98)
	unsigned char UnknownData_4B8[0x0008]; // 0x4B8(0x8)

	void UnCrouch(bool bClientSimulation); // Function Engine.Character.UnCrouch // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF7768529E0
	void StopJumping(); // Function Engine.Character.StopJumping // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF7768529C0
	void StopAnimMontage(struct UAnimMontage* AnimMontage); // Function Engine.Character.StopAnimMontage // (Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF776852930
	void ServerMoveOld(float OldTimeStamp, struct FVector_NetQuantize10 OldAccel, enum class None OldMoveFlags); // Function Engine.Character.ServerMoveOld // (Net|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x11, 0x7FF776852490
	void ServerMoveNoBase(float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, enum class None CompressedMoveFlags, enum class None ClientRoll, uint32_t View, enum class None ClientMovementMode); // Function Engine.Character.ServerMoveNoBase // (Net|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x25, 0x7FF776852210
	void ServerMoveDualNoBase(float TimeStamp0, struct FVector_NetQuantize10 InAccel0, enum class None PendingFlags, uint32_t View0, float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, enum class None NewFlags, enum class None ClientRoll, uint32_t View, enum class None ClientMovementMode); // Function Engine.Character.ServerMoveDualNoBase // (Net|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x3D, 0x7FF776851E50
	void ServerMoveDualHybridRootMotion(float TimeStamp0, struct FVector_NetQuantize10 InAccel0, enum class None PendingFlags, uint32_t View0, float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, enum class None NewFlags, enum class None ClientRoll, uint32_t View, struct UPrimitiveComponent* ClientMovementBase, struct FName ClientBaseBoneName, enum class None ClientMovementMode); // Function Engine.Character.ServerMoveDualHybridRootMotion // (Net|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x51, 0x7FF776851A00
	void ServerMoveDual(float TimeStamp0, struct FVector_NetQuantize10 InAccel0, enum class None PendingFlags, uint32_t View0, float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, enum class None NewFlags, enum class None ClientRoll, uint32_t View, struct UPrimitiveComponent* ClientMovementBase, struct FName ClientBaseBoneName, enum class None ClientMovementMode); // Function Engine.Character.ServerMoveDual // (Net|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x51, 0x7FF7768515B0
	void ServerMove(float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, enum class None CompressedMoveFlags, enum class None ClientRoll, uint32_t View, struct UPrimitiveComponent* ClientMovementBase, struct FName ClientBaseBoneName, enum class None ClientMovementMode); // Function Engine.Character.ServerMove // (Net|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x39, 0x7FF7768512A0
	void RootMotionDebugClientPrintOnScreen(struct FString inString); // Function Engine.Character.RootMotionDebugClientPrintOnScreen // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x10, 0x7FF776851200
	float PlayAnimMontage(struct UAnimMontage* AnimMontage, float InPlayRate, struct FName StartSectionName); // Function Engine.Character.PlayAnimMontage // (Native|Public|BlueprintCallable) // Param Size : 0x18, 0x7FF776851070
	void OnWalkingOffLedge(struct FVector PreviousFloorImpactNormal, struct FVector PreviousFloorContactNormal, struct FVector PreviousLocation, float TimeDelta); // Function Engine.Character.OnWalkingOffLedge // (Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // Param Size : 0x28, 0x7FF776850EB0
	void OnRep_RootMotion(); // Function Engine.Character.OnRep_RootMotion // (Final|Native|Public) // Param Size : 0x0, 0x7FF776850E90
	void OnRep_ReplicatedBasedMovement(); // Function Engine.Character.OnRep_ReplicatedBasedMovement // (Native|Public) // Param Size : 0x0, 0x7FF776850E70
	void OnRep_ReplayLastTransformUpdateTimeStamp(); // Function Engine.Character.OnRep_ReplayLastTransformUpdateTimeStamp // (Final|Native|Public) // Param Size : 0x0, 0x7FF776850E50
	void OnRep_IsCrouched(); // Function Engine.Character.OnRep_IsCrouched // (Native|Public) // Param Size : 0x0, 0x7FF776850E30
	void OnLaunched(struct FVector LaunchVelocity, bool bXYOverride, bool bZOverride); // Function Engine.Character.OnLaunched // (Event|Public|HasDefaults|BlueprintEvent) // Param Size : 0xE, 0x7FF77510D9D0
	void OnLanded(struct FHitResult Hit); // Function Engine.Character.OnLanded // (Event|Public|HasOutParms|BlueprintEvent) // Param Size : 0x88, 0x7FF77510D9D0
	void OnJumped(); // Function Engine.Character.OnJumped // (Native|Event|Public|BlueprintEvent) // Param Size : 0x0, 0x7FF776850E10
	void LaunchCharacter(struct FVector LaunchVelocity, bool bXYOverride, bool bZOverride); // Function Engine.Character.LaunchCharacter // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0xE, 0x7FF776850CF0
	void K2_UpdateCustomMovement(float DeltaTime); // Function Engine.Character.K2_UpdateCustomMovement // (Event|Public|BlueprintEvent) // Param Size : 0x4, 0x7FF77510D9D0
	void K2_OnStartCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function Engine.Character.K2_OnStartCrouch // (Event|Public|BlueprintEvent) // Param Size : 0x8, 0x7FF77510D9D0
	void K2_OnMovementModeChanged(enum class EMovementMode PrevMovementMode, enum class EMovementMode NewMovementMode, enum class None PrevCustomMode, enum class None NewCustomMode); // Function Engine.Character.K2_OnMovementModeChanged // (Event|Public|BlueprintEvent) // Param Size : 0x4, 0x7FF77510D9D0
	void K2_OnEndCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function Engine.Character.K2_OnEndCrouch // (Event|Public|BlueprintEvent) // Param Size : 0x8, 0x7FF77510D9D0
	void Jump(); // Function Engine.Character.Jump // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF77684F630
	bool IsPlayingRootMotion(); // Function Engine.Character.IsPlayingRootMotion // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77684F600
	bool IsPlayingNetworkedRootMotionMontage(); // Function Engine.Character.IsPlayingNetworkedRootMotionMontage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77684F5D0
	bool IsJumpProvidingForce(); // Function Engine.Character.IsJumpProvidingForce // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77684F5A0
	bool HasAnyRootMotion(); // Function Engine.Character.HasAnyRootMotion // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77684F570
	struct UAnimMontage* GetCurrentMontage(); // Function Engine.Character.GetCurrentMontage // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF77684EEE0
	struct FVector GetBaseTranslationOffset(); // Function Engine.Character.GetBaseTranslationOffset // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF77684EEB0
	struct FRotator GetBaseRotationOffsetRotator(); // Function Engine.Character.GetBaseRotationOffsetRotator // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF77684EE60
	float GetAnimRootMotionTranslationScale(); // Function Engine.Character.GetAnimRootMotionTranslationScale // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF77684ED90
	void Crouch(bool bClientSimulation); // Function Engine.Character.Crouch // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77684ED00
	void ClientVeryShortAdjustPosition(float Timestamp, struct FVector NewLoc, struct UPrimitiveComponent* NewBase, struct FName NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, enum class None ServerMovementMode); // Function Engine.Character.ClientVeryShortAdjustPosition // (Net|Native|Event|Public|HasDefaults|NetClient) // Param Size : 0x23, 0x7FF77684E9B0
	void ClientCheatWalk(); // Function Engine.Character.ClientCheatWalk // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x0, 0x7FF77684E990
	void ClientCheatGhost(); // Function Engine.Character.ClientCheatGhost // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x0, 0x7FF77684E970
	void ClientCheatFly(); // Function Engine.Character.ClientCheatFly // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x0, 0x7FF77684E950
	void ClientAdjustRootMotionSourcePosition(float Timestamp, struct FRootMotionSourceGroup ServerRootMotion, bool bHasAnimRootMotion, float ServerMontageTrackPosition, struct FVector ServerLoc, struct FVector_NetQuantizeNormal ServerRotation, float ServerVelZ, struct UPrimitiveComponent* ServerBase, struct FName ServerBoneName, bool bHasBase, bool bBaseRelativePosition, enum class None ServerMovementMode); // Function Engine.Character.ClientAdjustRootMotionSourcePosition // (Net|Native|Event|Public|HasDefaults|NetClient) // Param Size : 0x7B, 0x7FF77684E4B0
	void ClientAdjustRootMotionPosition(float Timestamp, float ServerMontageTrackPosition, struct FVector ServerLoc, struct FVector_NetQuantizeNormal ServerRotation, float ServerVelZ, struct UPrimitiveComponent* ServerBase, struct FName ServerBoneName, bool bHasBase, bool bBaseRelativePosition, enum class None ServerMovementMode); // Function Engine.Character.ClientAdjustRootMotionPosition // (Net|Native|Event|Public|HasDefaults|NetClient) // Param Size : 0x3B, 0x7FF77684E1C0
	void ClientAdjustPosition(float Timestamp, struct FVector NewLoc, struct FVector NewVel, struct UPrimitiveComponent* NewBase, struct FName NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, enum class None ServerMovementMode); // Function Engine.Character.ClientAdjustPosition // (Net|Native|Event|Public|HasDefaults|NetClient) // Param Size : 0x33, 0x7FF77684DF50
	void ClientAckGoodMove(float Timestamp); // Function Engine.Character.ClientAckGoodMove // (Net|Native|Event|Public|NetClient) // Param Size : 0x4, 0x7FF77684DED0
	bool CanJumpInternal(); // Function Engine.Character.CanJumpInternal // (Native|Event|Protected|BlueprintEvent|Const) // Param Size : 0x1, 0x7FF77684DEA0
	bool CanJump(); // Function Engine.Character.CanJump // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77684DE70
	bool CanCrouch(); // Function Engine.Character.CanCrouch // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77684DE40
	void CacheInitialMeshOffset(struct FVector MeshRelativeLocation, struct FRotator MeshRelativeRotation); // Function Engine.Character.CacheInitialMeshOffset // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x18, 0x7FF77684DD60
};

// Class Engine.ActorComponent
// Size : 0xB0 (Inherited : 0x28)
struct UActorComponent : UObject {
	unsigned char UnknownData_28[0x0008]; // 0x28(0x8)
	struct FActorComponentTickFunction PrimaryComponentTick; // 0x30(0x30)
	struct TArray<struct FName> ComponentTags; // 0x60(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x70(0x10)
	unsigned char UnknownData_80[0x0004]; // 0x80(0x4)
	int32_t UCSSerializationIndex; // 0x84(0x4)
	unsigned char UnknownData_88_0 : 3; // 0x88(0x1)
	unsigned char bNetAddressable : 1; // 0x88(0x1)
	unsigned char bReplicates : 1; // 0x88(0x1)
	unsigned char UnknownData_88_5 : 3; // 0x88(0x1)
	unsigned char UnknownData_89_0 : 7; // 0x89(0x1)
	unsigned char bAutoActivate : 1; // 0x89(0x1)
	unsigned char bIsActive : 1; // 0x8A(0x1)
	unsigned char bEditableWhenInherited : 1; // 0x8A(0x1)
	unsigned char UnknownData_8A_2 : 1; // 0x8A(0x1)
	unsigned char bCanEverAffectNavigation : 1; // 0x8A(0x1)
	unsigned char UnknownData_8A_4 : 1; // 0x8A(0x1)
	unsigned char bIsEditorOnly : 1; // 0x8A(0x1)
	unsigned char UnknownData_8A_6 : 2; // 0x8A(0x1)
	unsigned char UnknownData_8B[0x0001]; // 0x8B(0x1)
	enum class EComponentCreationMethod CreationMethod; // 0x8C(0x1)
	struct FMulticastSparseDelegate OnComponentActivated; // 0x8D(0x1)
	struct FMulticastSparseDelegate OnComponentDeactivated; // 0x8E(0x1)
	unsigned char UnknownData_8F[0x0001]; // 0x8F(0x1)
	struct TArray<struct FSimpleMemberReference> UCSModifiedProperties; // 0x90(0x10)
	unsigned char UnknownData_A0[0x0010]; // 0xA0(0x10)

	void ToggleActive(); // Function Engine.ActorComponent.ToggleActive // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF775FD62D0
	void SetTickGroup(enum class ETickingGroup NewTickGroup); // Function Engine.ActorComponent.SetTickGroup // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77681E1B0
	void SetTickableWhenPaused(bool bTickableWhenPaused); // Function Engine.ActorComponent.SetTickableWhenPaused // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77681E230
	void SetIsReplicated(bool ShouldReplicate); // Function Engine.ActorComponent.SetIsReplicated // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77681E120
	void SetComponentTickInterval(float TickInterval); // Function Engine.ActorComponent.SetComponentTickInterval // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77681E0A0
	void SetComponentTickEnabled(bool bEnabled); // Function Engine.ActorComponent.SetComponentTickEnabled // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77681E010
	void SetAutoActivate(bool bNewAutoActivate); // Function Engine.ActorComponent.SetAutoActivate // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77681A580
	void SetActive(bool bNewActive, bool bReset); // Function Engine.ActorComponent.SetActive // (Native|Public|BlueprintCallable) // Param Size : 0x2, 0x7FF77681DF40
	void RemoveTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.ActorComponent.RemoveTickPrerequisiteComponent // (Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF77681DEB0
	void RemoveTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.ActorComponent.RemoveTickPrerequisiteActor // (Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF77681DE20
	void ReceiveTick(float DeltaSeconds); // Function Engine.ActorComponent.ReceiveTick // (Event|Public|BlueprintEvent) // Param Size : 0x4, 0x7FF77510D9D0
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason); // Function Engine.ActorComponent.ReceiveEndPlay // (Event|Public|BlueprintEvent) // Param Size : 0x1, 0x7FF77510D9D0
	void ReceiveBeginPlay(); // Function Engine.ActorComponent.ReceiveBeginPlay // (Event|Public|BlueprintEvent) // Param Size : 0x0, 0x7FF77510D9D0
	void OnRep_IsActive(); // Function Engine.ActorComponent.OnRep_IsActive // (Native|Public) // Param Size : 0x0, 0x7FF775B89820
	void K2_DestroyComponent(struct UObject* Object); // Function Engine.ActorComponent.K2_DestroyComponent // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF77681DD20
	bool IsComponentTickEnabled(); // Function Engine.ActorComponent.IsComponentTickEnabled // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77681DCF0
	bool IsBeingDestroyed(); // Function Engine.ActorComponent.IsBeingDestroyed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77681DCC0
	bool IsActive(); // Function Engine.ActorComponent.IsActive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77681DC90
	struct AActor* GetOwner(); // Function Engine.ActorComponent.GetOwner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF77681DC70
	float GetComponentTickInterval(); // Function Engine.ActorComponent.GetComponentTickInterval // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF77681DC40
	void Deactivate(); // Function Engine.ActorComponent.Deactivate // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF775B89800
	bool ComponentHasTag(struct FName Tag); // Function Engine.ActorComponent.ComponentHasTag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x9, 0x7FF77681DA30
	void AddTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.ActorComponent.AddTickPrerequisiteComponent // (Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF77681D8E0
	void AddTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.ActorComponent.AddTickPrerequisiteActor // (Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF77681D850
	void Activate(bool bReset); // Function Engine.ActorComponent.Activate // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF775FD6570
};

// Class Engine.SceneComponent
// Size : 0x1F0 (Inherited : 0xB0)
struct USceneComponent : UActorComponent {
	unsigned char UnknownData_B0[0x0008]; // 0xB0(0x8)
	struct FWeakObjectPtr<struct APhysicsVolume> PhysicsVolume; // 0xB8(0x8)
	struct USceneComponent* AttachParent; // 0xC0(0x8)
	struct FName AttachSocketName; // 0xC8(0x8)
	struct TArray<struct USceneComponent*> AttachChildren; // 0xD0(0x10)
	struct TArray<struct USceneComponent*> ClientAttachedChildren; // 0xE0(0x10)
	unsigned char UnknownData_F0[0x002C]; // 0xF0(0x2C)
	struct FVector RelativeLocation; // 0x11C(0xC)
	struct FRotator RelativeRotation; // 0x128(0xC)
	struct FVector RelativeScale3D; // 0x134(0xC)
	struct FVector ComponentVelocity; // 0x140(0xC)
	unsigned char bComponentToWorldUpdated : 1; // 0x14C(0x1)
	unsigned char UnknownData_14C_1 : 1; // 0x14C(0x1)
	unsigned char bAbsoluteLocation : 1; // 0x14C(0x1)
	unsigned char bAbsoluteRotation : 1; // 0x14C(0x1)
	unsigned char bAbsoluteScale : 1; // 0x14C(0x1)
	unsigned char bVisible : 1; // 0x14C(0x1)
	unsigned char bShouldBeAttached : 1; // 0x14C(0x1)
	unsigned char bShouldSnapLocationWhenAttached : 1; // 0x14C(0x1)
	unsigned char bShouldSnapRotationWhenAttached : 1; // 0x14D(0x1)
	unsigned char bShouldUpdatePhysicsVolume : 1; // 0x14D(0x1)
	unsigned char bHiddenInGame : 1; // 0x14D(0x1)
	unsigned char bBoundsChangeTriggersStreamingDataRebuild : 1; // 0x14D(0x1)
	unsigned char bUseAttachParentBound : 1; // 0x14D(0x1)
	unsigned char UnknownData_14D_5 : 3; // 0x14D(0x1)
	unsigned char UnknownData_14E[0x0001]; // 0x14E(0x1)
	enum class EComponentMobility Mobility; // 0x14F(0x1)
	enum class EDetailMode DetailMode; // 0x150(0x1)
	struct FMulticastSparseDelegate PhysicsVolumeChangedDelegate; // 0x151(0x1)
	unsigned char UnknownData_152[0x009E]; // 0x152(0x9E)

	void ToggleVisibility(bool bPropagateToChildren); // Function Engine.SceneComponent.ToggleVisibility // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77694EAA0
	bool SnapTo(struct USceneComponent* InParent, struct FName InSocketName); // Function Engine.SceneComponent.SnapTo // (Final|Native|Public|BlueprintCallable) // Param Size : 0x11, 0x7FF77694E9E0
	void SetWorldScale3D(struct FVector NewScale); // Function Engine.SceneComponent.SetWorldScale3D // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0xC, 0x7FF77694E800
	void SetVisibility(bool bNewVisibility, bool bPropagateToChildren); // Function Engine.SceneComponent.SetVisibility // (Final|Native|Public|BlueprintCallable) // Param Size : 0x2, 0x7FF77694E730
	void SetShouldUpdatePhysicsVolume(bool bInShouldUpdatePhysicsVolume); // Function Engine.SceneComponent.SetShouldUpdatePhysicsVolume // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77694E6A0
	void SetRelativeScale3D(struct FVector NewScale3D); // Function Engine.SceneComponent.SetRelativeScale3D // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0xC, 0x7FF77694E610
	void SetMobility(enum class EComponentMobility NewMobility); // Function Engine.SceneComponent.SetMobility // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77694E590
	void SetHiddenInGame(bool NewHidden, bool bPropagateToChildren); // Function Engine.SceneComponent.SetHiddenInGame // (Final|Native|Public|BlueprintCallable) // Param Size : 0x2, 0x7FF77694E4C0
	void SetAbsolute(bool bNewAbsoluteLocation, bool bNewAbsoluteRotation, bool bNewAbsoluteScale); // Function Engine.SceneComponent.SetAbsolute // (Final|Native|Public|BlueprintCallable) // Param Size : 0x3, 0x7FF77694E320
	void ResetRelativeTransform(); // Function Engine.SceneComponent.ResetRelativeTransform // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF77694E300
	void OnRep_Visibility(bool OldValue); // Function Engine.SceneComponent.OnRep_Visibility // (Final|Native|Private) // Param Size : 0x1, 0x7FF77694E120
	void OnRep_Transform(); // Function Engine.SceneComponent.OnRep_Transform // (Final|Native|Private) // Param Size : 0x0, 0x7FF77694E100
	void OnRep_AttachSocketName(); // Function Engine.SceneComponent.OnRep_AttachSocketName // (Final|Native|Private) // Param Size : 0x0, 0x7FF77694E0E0
	void OnRep_AttachParent(); // Function Engine.SceneComponent.OnRep_AttachParent // (Final|Native|Private) // Param Size : 0x0, 0x7FF77694E0E0
	void OnRep_AttachChildren(); // Function Engine.SceneComponent.OnRep_AttachChildren // (Final|Native|Private) // Param Size : 0x0, 0x7FF77694E0C0
	void K2_SetWorldTransform(struct FTransform NewTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldTransform // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xBD, 0x7FF77694DED0
	void K2_SetWorldRotation(struct FRotator NewRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldRotation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x99, 0x7FF77694DD20
	void K2_SetWorldLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldLocationAndRotation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xA5, 0x7FF77694DB40
	void K2_SetWorldLocation(struct FVector NewLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x99, 0x7FF77694D990
	void K2_SetRelativeTransform(struct FTransform NewTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeTransform // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xBD, 0x7FF77694D7A0
	void K2_SetRelativeRotation(struct FRotator NewRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeRotation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x99, 0x7FF77694D5F0
	void K2_SetRelativeLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeLocationAndRotation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xA5, 0x7FF77694D410
	void K2_SetRelativeLocation(struct FVector NewLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x99, 0x7FF77694D260
	struct FTransform K2_GetComponentToWorld(); // Function Engine.SceneComponent.K2_GetComponentToWorld // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x30, 0x7FF77694D200
	struct FVector K2_GetComponentScale(); // Function Engine.SceneComponent.K2_GetComponentScale // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF77694D1C0
	struct FRotator K2_GetComponentRotation(); // Function Engine.SceneComponent.K2_GetComponentRotation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF77694D180
	struct FVector K2_GetComponentLocation(); // Function Engine.SceneComponent.K2_GetComponentLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF77694D140
	void K2_DetachFromComponent(enum class EDetachmentRule LocationRule, enum class EDetachmentRule RotationRule, enum class EDetachmentRule ScaleRule, bool bCallModify); // Function Engine.SceneComponent.K2_DetachFromComponent // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77694CFF0
	bool K2_AttachToComponent(struct USceneComponent* Parent, struct FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // Function Engine.SceneComponent.K2_AttachToComponent // (Final|Native|Public|BlueprintCallable) // Param Size : 0x15, 0x7FF77694CE40
	bool K2_AttachTo(struct USceneComponent* InParent, struct FName InSocketName, enum class EAttachLocation AttachType, bool bWeldSimulatedBodies); // Function Engine.SceneComponent.K2_AttachTo // (Final|Native|Public|BlueprintCallable) // Param Size : 0x13, 0x7FF77694CCF0
	void K2_AddWorldTransform(struct FTransform DeltaTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldTransform // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xBD, 0x7FF77694CB00
	void K2_AddWorldRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldRotation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x99, 0x7FF77694C950
	void K2_AddWorldOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldOffset // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x99, 0x7FF77694C7A0
	void K2_AddRelativeRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddRelativeRotation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x99, 0x7FF77694C5F0
	void K2_AddRelativeLocation(struct FVector DeltaLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddRelativeLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x99, 0x7FF77694C440
	void K2_AddLocalTransform(struct FTransform DeltaTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalTransform // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xBD, 0x7FF77694C250
	void K2_AddLocalRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalRotation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x99, 0x7FF77694C0A0
	void K2_AddLocalOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalOffset // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x99, 0x7FF77694BEF0
	bool IsVisible(); // Function Engine.SceneComponent.IsVisible // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77694BEC0
	bool IsSimulatingPhysics(struct FName BoneName); // Function Engine.SceneComponent.IsSimulatingPhysics // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x9, 0x7FF77694BE20
	bool IsAnySimulatingPhysics(); // Function Engine.SceneComponent.IsAnySimulatingPhysics // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77694BDF0
	struct FVector GetUpVector(); // Function Engine.SceneComponent.GetUpVector // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF77694BC60
	struct FTransform GetSocketTransform(struct FName InSocketName, enum class ERelativeTransformSpace TransformSpace); // Function Engine.SceneComponent.GetSocketTransform // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x40, 0x7FF77694BB60
	struct FRotator GetSocketRotation(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketRotation // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF77694BAB0
	struct FQuat GetSocketQuaternion(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketQuaternion // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x20, 0x7FF77694BA10
	struct FVector GetSocketLocation(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketLocation // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF77694B960
	bool GetShouldUpdatePhysicsVolume(); // Function Engine.SceneComponent.GetShouldUpdatePhysicsVolume // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77694B930
	struct FVector GetRightVector(); // Function Engine.SceneComponent.GetRightVector // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF77694B8F0
	struct FTransform GetRelativeTransform(); // Function Engine.SceneComponent.GetRelativeTransform // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x30, 0x7FF77694B890
	struct APhysicsVolume* GetPhysicsVolume(); // Function Engine.SceneComponent.GetPhysicsVolume // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF77694B860
	void GetParentComponents(struct TArray<struct USceneComponent*> Parents); // Function Engine.SceneComponent.GetParentComponents // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF77694B7B0
	int32_t GetNumChildrenComponents(); // Function Engine.SceneComponent.GetNumChildrenComponents // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF77694B780
	struct FVector GetForwardVector(); // Function Engine.SceneComponent.GetForwardVector // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776928460
	struct FVector GetComponentVelocity(); // Function Engine.SceneComponent.GetComponentVelocity // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF77694B740
	void GetChildrenComponents(bool bIncludeAllDescendants, struct TArray<struct USceneComponent*> Children); // Function Engine.SceneComponent.GetChildrenComponents // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x18, 0x7FF77694B640
	struct USceneComponent* GetChildComponent(int32_t ChildIndex); // Function Engine.SceneComponent.GetChildComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF77694B5B0
	struct FName GetAttachSocketName(); // Function Engine.SceneComponent.GetAttachSocketName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF7761254D0
	struct USceneComponent* GetAttachParent(); // Function Engine.SceneComponent.GetAttachParent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF77694B590
	struct TArray<struct FName> GetAllSocketNames(); // Function Engine.SceneComponent.GetAllSocketNames // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF77694B510
	bool DoesSocketExist(struct FName InSocketName); // Function Engine.SceneComponent.DoesSocketExist // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x9, 0x7FF77694B470
	void DetachFromParent(bool bMaintainWorldPosition, bool bCallModify); // Function Engine.SceneComponent.DetachFromParent // (Native|Public|BlueprintCallable) // Param Size : 0x2, 0x7FF77694B3A0
};

// Class Engine.PrimitiveComponent
// Size : 0x410 (Inherited : 0x1F0)
struct UPrimitiveComponent : USceneComponent {
	unsigned char UnknownData_1F0[0x0008]; // 0x1F0(0x8)
	float MinDrawDistance; // 0x1F8(0x4)
	float LDMaxDrawDistance; // 0x1FC(0x4)
	float CachedMaxDrawDistance; // 0x200(0x4)
	enum class ESceneDepthPriorityGroup DepthPriorityGroup; // 0x204(0x1)
	enum class ESceneDepthPriorityGroup ViewOwnerDepthPriorityGroup; // 0x205(0x1)
	enum class EIndirectLightingCacheQuality IndirectLightingCacheQuality; // 0x206(0x1)
	enum class ELightmapType LightmapType; // 0x207(0x1)
	unsigned char bUseMaxLODAsImposter : 1; // 0x208(0x1)
	unsigned char bBatchImpostersAsInstances : 1; // 0x208(0x1)
	unsigned char bNeverDistanceCull : 1; // 0x208(0x1)
	unsigned char UnknownData_208_3 : 4; // 0x208(0x1)
	unsigned char bAlwaysCreatePhysicsState : 1; // 0x208(0x1)
	unsigned char bGenerateOverlapEvents : 1; // 0x209(0x1)
	unsigned char bMultiBodyOverlap : 1; // 0x209(0x1)
	unsigned char bTraceComplexOnMove : 1; // 0x209(0x1)
	unsigned char bReturnMaterialOnMove : 1; // 0x209(0x1)
	unsigned char bUseViewOwnerDepthPriorityGroup : 1; // 0x209(0x1)
	unsigned char bAllowCullDistanceVolume : 1; // 0x209(0x1)
	unsigned char bHasMotionBlurVelocityMeshes : 1; // 0x209(0x1)
	unsigned char bVisibleInReflectionCaptures : 1; // 0x209(0x1)
	unsigned char bVisibleInRayTracing : 1; // 0x20A(0x1)
	unsigned char bRenderInMainPass : 1; // 0x20A(0x1)
	unsigned char bRenderInDepthPass : 1; // 0x20A(0x1)
	unsigned char bReceivesDecals : 1; // 0x20A(0x1)
	unsigned char bOwnerNoSee : 1; // 0x20A(0x1)
	unsigned char bOnlyOwnerSee : 1; // 0x20A(0x1)
	unsigned char bTreatAsBackgroundForOcclusion : 1; // 0x20A(0x1)
	unsigned char bUseAsOccluder : 1; // 0x20A(0x1)
	unsigned char bSelectable : 1; // 0x20B(0x1)
	unsigned char bForceMipStreaming : 1; // 0x20B(0x1)
	unsigned char bHasPerInstanceHitProxies : 1; // 0x20B(0x1)
	unsigned char CastShadow : 1; // 0x20B(0x1)
	unsigned char bAffectDynamicIndirectLighting : 1; // 0x20B(0x1)
	unsigned char bAffectDistanceFieldLighting : 1; // 0x20B(0x1)
	unsigned char bCastDynamicShadow : 1; // 0x20B(0x1)
	unsigned char bCastStaticShadow : 1; // 0x20B(0x1)
	unsigned char bCastVolumetricTranslucentShadow : 1; // 0x20C(0x1)
	unsigned char bSelfShadowOnly : 1; // 0x20C(0x1)
	unsigned char bCastFarShadow : 1; // 0x20C(0x1)
	unsigned char bCastInsetShadow : 1; // 0x20C(0x1)
	unsigned char bCastCinematicShadow : 1; // 0x20C(0x1)
	unsigned char bCastHiddenShadow : 1; // 0x20C(0x1)
	unsigned char bCastShadowAsTwoSided : 1; // 0x20C(0x1)
	unsigned char bLightAsIfStatic : 1; // 0x20C(0x1)
	unsigned char bLightAttachmentsAsGroup : 1; // 0x20D(0x1)
	unsigned char bExcludeFromLightAttachmentGroup : 1; // 0x20D(0x1)
	unsigned char bReceiveMobileCSMShadows : 1; // 0x20D(0x1)
	unsigned char bSingleSampleShadowFromStationaryLights : 1; // 0x20D(0x1)
	unsigned char bIgnoreRadialImpulse : 1; // 0x20D(0x1)
	unsigned char bIgnoreRadialForce : 1; // 0x20D(0x1)
	unsigned char bApplyImpulseOnDamage : 1; // 0x20D(0x1)
	unsigned char bReplicatePhysicsToAutonomousProxy : 1; // 0x20D(0x1)
	unsigned char bFillCollisionUnderneathForNavmesh : 1; // 0x20E(0x1)
	unsigned char AlwaysLoadOnClient : 1; // 0x20E(0x1)
	unsigned char AlwaysLoadOnServer : 1; // 0x20E(0x1)
	unsigned char bUseEditorCompositing : 1; // 0x20E(0x1)
	unsigned char bRenderCustomDepth : 1; // 0x20E(0x1)
	unsigned char UnknownData_20E_5 : 3; // 0x20E(0x1)
	enum class EHasCustomNavigableGeometry bHasCustomNavigableGeometry; // 0x20F(0x1)
	unsigned char UnknownData_210[0x0001]; // 0x210(0x1)
	enum class ECanBeCharacterBase CanCharacterStepUpOn; // 0x211(0x1)
	struct FLightingChannels LightingChannels; // 0x212(0x1)
	enum class ERendererStencilMask CustomDepthStencilWriteMask; // 0x213(0x1)
	int32_t CustomDepthStencilValue; // 0x214(0x4)
	struct FCustomPrimitiveData CustomPrimitiveData; // 0x218(0x10)
	struct FCustomPrimitiveData CustomPrimitiveDataInternal; // 0x228(0x10)
	int32_t TranslucencySortPriority; // 0x238(0x4)
	int32_t VisibilityId; // 0x23C(0x4)
	struct TArray<struct URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x240(0x10)
	int8_t VirtualTextureLodBias; // 0x250(0x1)
	int8_t VirtualTextureCullMips; // 0x251(0x1)
	int8_t VirtualTextureMinCoverage; // 0x252(0x1)
	enum class ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x253(0x1)
	unsigned char UnknownData_254[0x0004]; // 0x254(0x4)
	float LpvBiasMultiplier; // 0x258(0x4)
	unsigned char UnknownData_25C[0x0008]; // 0x25C(0x8)
	float BoundsScale; // 0x264(0x4)
	unsigned char UnknownData_268[0x0010]; // 0x268(0x10)
	struct TArray<struct AActor*> MoveIgnoreActors; // 0x278(0x10)
	struct TArray<struct UPrimitiveComponent*> MoveIgnoreComponents; // 0x288(0x10)
	unsigned char UnknownData_298[0x0010]; // 0x298(0x10)
	struct FBodyInstance BodyInstance; // 0x2A8(0x130)
	struct FMulticastSparseDelegate OnComponentHit; // 0x3D8(0x1)
	struct FMulticastSparseDelegate OnComponentBeginOverlap; // 0x3D9(0x1)
	struct FMulticastSparseDelegate OnComponentEndOverlap; // 0x3DA(0x1)
	struct FMulticastSparseDelegate OnComponentWake; // 0x3DB(0x1)
	struct FMulticastSparseDelegate OnComponentSleep; // 0x3DC(0x1)
	unsigned char UnknownData_3DD[0x0001]; // 0x3DD(0x1)
	struct FMulticastSparseDelegate OnBeginCursorOver; // 0x3DE(0x1)
	struct FMulticastSparseDelegate OnEndCursorOver; // 0x3DF(0x1)
	struct FMulticastSparseDelegate OnClicked; // 0x3E0(0x1)
	struct FMulticastSparseDelegate OnReleased; // 0x3E1(0x1)
	struct FMulticastSparseDelegate OnInputTouchBegin; // 0x3E2(0x1)
	struct FMulticastSparseDelegate OnInputTouchEnd; // 0x3E3(0x1)
	struct FMulticastSparseDelegate OnInputTouchEnter; // 0x3E4(0x1)
	struct FMulticastSparseDelegate OnInputTouchLeave; // 0x3E5(0x1)
	unsigned char UnknownData_3E6[0x001A]; // 0x3E6(0x1A)
	struct UPrimitiveComponent* LODParentPrimitive; // 0x400(0x8)
	unsigned char UnknownData_408[0x0008]; // 0x408(0x8)

	bool WasRecentlyRendered(float Tolerance); // Function Engine.PrimitiveComponent.WasRecentlyRendered // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x5, 0x7FF776941570
	void WakeRigidBody(struct FName BoneName); // Function Engine.PrimitiveComponent.WakeRigidBody // (Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF7769414E0
	void WakeAllRigidBodies(); // Function Engine.PrimitiveComponent.WakeAllRigidBodies // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776850E70
	void SetWalkableSlopeOverride(struct FWalkableSlopeOverride NewOverride); // Function Engine.PrimitiveComponent.SetWalkableSlopeOverride // (Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x10, 0x7FF776941430
	void SetUseCCD(bool InUseCCD, struct FName BoneName); // Function Engine.PrimitiveComponent.SetUseCCD // (Native|Public|BlueprintCallable) // Param Size : 0xC, 0x7FF776941360
	void SetTranslucentSortPriority(int32_t NewTranslucentSortPriority); // Function Engine.PrimitiveComponent.SetTranslucentSortPriority // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF7769412E0
	void SetSingleSampleShadowFromStationaryLights(bool bNewSingleSampleShadowFromStationaryLights); // Function Engine.PrimitiveComponent.SetSingleSampleShadowFromStationaryLights // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF7769410D0
	void SetSimulatePhysics(bool bSimulate); // Function Engine.PrimitiveComponent.SetSimulatePhysics // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776941040
	void SetRenderInMainPass(bool bValue); // Function Engine.PrimitiveComponent.SetRenderInMainPass // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776940FB0
	void SetRenderCustomDepth(bool bValue); // Function Engine.PrimitiveComponent.SetRenderCustomDepth // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776940F20
	void SetReceivesDecals(bool bNewReceivesDecals); // Function Engine.PrimitiveComponent.SetReceivesDecals // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776940E90
	void SetPhysMaterialOverride(struct UPhysicalMaterial* NewPhysMaterial); // Function Engine.PrimitiveComponent.SetPhysMaterialOverride // (Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF7769407D0
	void SetPhysicsMaxAngularVelocityInRadians(float NewMaxAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocityInRadians // (Final|Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF776940D00
	void SetPhysicsMaxAngularVelocityInDegrees(float NewMaxAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocityInDegrees // (Final|Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF776940BF0
	void SetPhysicsMaxAngularVelocity(float NewMaxAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocity // (Final|Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF776940BF0
	void SetPhysicsLinearVelocity(struct FVector NewVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsLinearVelocity // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x18, 0x7FF776940AD0
	void SetPhysicsAngularVelocityInRadians(struct FVector NewAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocityInRadians // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x18, 0x7FF7769409B0
	void SetPhysicsAngularVelocityInDegrees(struct FVector NewAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocityInDegrees // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x18, 0x7FF776940860
	void SetPhysicsAngularVelocity(struct FVector NewAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocity // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x18, 0x7FF776940860
	void SetOwnerNoSee(bool bNewOwnerNoSee); // Function Engine.PrimitiveComponent.SetOwnerNoSee // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776940740
	void SetOnlyOwnerSee(bool bNewOnlyOwnerSee); // Function Engine.PrimitiveComponent.SetOnlyOwnerSee // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF7769406B0
	void SetNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision); // Function Engine.PrimitiveComponent.SetNotifyRigidBodyCollision // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776940620
	void SetMaterialByName(struct FName MaterialSlotName, struct UMaterialInterface* Material); // Function Engine.PrimitiveComponent.SetMaterialByName // (Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF7769404D0
	void SetMaterial(int32_t ElementIndex, struct UMaterialInterface* Material); // Function Engine.PrimitiveComponent.SetMaterial // (Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF776940400
	void SetMassScale(struct FName BoneName, float InMassScale); // Function Engine.PrimitiveComponent.SetMassScale // (Native|Public|BlueprintCallable) // Param Size : 0xC, 0x7FF776940330
	void SetMassOverrideInKg(struct FName BoneName, float MassInKg, bool bOverrideMass); // Function Engine.PrimitiveComponent.SetMassOverrideInKg // (Native|Public|BlueprintCallable) // Param Size : 0xD, 0x7FF776940230
	void SetLinearDamping(float InDamping); // Function Engine.PrimitiveComponent.SetLinearDamping // (Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF7769401B0
	void SetLightingChannels(bool bChannel0, bool bChannel1, bool bChannel2); // Function Engine.PrimitiveComponent.SetLightingChannels // (Final|Native|Public|BlueprintCallable) // Param Size : 0x3, 0x7FF776940090
	void SetLightAttachmentsAsGroup(bool bInLightAttachmentsAsGroup); // Function Engine.PrimitiveComponent.SetLightAttachmentsAsGroup // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77693FF00
	void SetGenerateOverlapEvents(bool bInGenerateOverlapEvents); // Function Engine.PrimitiveComponent.SetGenerateOverlapEvents // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77693FE70
	void SetExcludeFromLightAttachmentGroup(bool bInExcludeFromLightAttachmentGroup); // Function Engine.PrimitiveComponent.SetExcludeFromLightAttachmentGroup // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77693FDE0
	void SetEnableGravity(bool bGravityEnabled); // Function Engine.PrimitiveComponent.SetEnableGravity // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776931DB0
	void SetCustomPrimitiveDataVector4(int32_t DataIndex, struct FVector4 Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector4 // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x20, 0x7FF77693FD10
	void SetCustomPrimitiveDataVector3(int32_t DataIndex, struct FVector Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector3 // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x10, 0x7FF77693FC40
	void SetCustomPrimitiveDataVector2(int32_t DataIndex, struct FVector2D Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector2 // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0xC, 0x7FF77693FB80
	void SetCustomPrimitiveDataFloat(int32_t DataIndex, float Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataFloat // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF77693FAB0
	void SetCustomDepthStencilWriteMask(enum class ERendererStencilMask WriteMaskBit); // Function Engine.PrimitiveComponent.SetCustomDepthStencilWriteMask // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77693FA30
	void SetCustomDepthStencilValue(int32_t Value); // Function Engine.PrimitiveComponent.SetCustomDepthStencilValue // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77693F9B0
	void SetCullDistance(float NewCullDistance); // Function Engine.PrimitiveComponent.SetCullDistance // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77693F930
	void SetConstraintMode(enum class EDOFMode ConstraintMode); // Function Engine.PrimitiveComponent.SetConstraintMode // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77693F8B0
	void SetCollisionResponseToChannel(enum class ECollisionChannel Channel, enum class ECollisionResponse NewResponse); // Function Engine.PrimitiveComponent.SetCollisionResponseToChannel // (Native|Public|BlueprintCallable) // Param Size : 0x2, 0x7FF77693F7F0
	void SetCollisionResponseToAllChannels(enum class ECollisionResponse NewResponse); // Function Engine.PrimitiveComponent.SetCollisionResponseToAllChannels // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77693F770
	void SetCollisionProfileName(struct FName InCollisionProfileName, bool bUpdateOverlaps); // Function Engine.PrimitiveComponent.SetCollisionProfileName // (Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF77693F6A0
	void SetCollisionObjectType(enum class ECollisionChannel Channel); // Function Engine.PrimitiveComponent.SetCollisionObjectType // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77693F620
	void SetCollisionEnabled(enum class ECollisionEnabled NewType); // Function Engine.PrimitiveComponent.SetCollisionEnabled // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77693F5A0
	void SetCenterOfMass(struct FVector CenterOfMassOffset, struct FName BoneName); // Function Engine.PrimitiveComponent.SetCenterOfMass // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x14, 0x7FF77693F4D0
	void SetCastShadow(bool NewCastShadow); // Function Engine.PrimitiveComponent.SetCastShadow // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77693F440
	void SetCastInsetShadow(bool bInCastInsetShadow); // Function Engine.PrimitiveComponent.SetCastInsetShadow // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77693F3B0
	void SetBoundsScale(float NewBoundsScale); // Function Engine.PrimitiveComponent.SetBoundsScale // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77693F330
	void SetAngularDamping(float InDamping); // Function Engine.PrimitiveComponent.SetAngularDamping // (Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77693ED40
	void SetAllUseCCD(bool InUseCCD); // Function Engine.PrimitiveComponent.SetAllUseCCD // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776934850
	void SetAllPhysicsLinearVelocity(struct FVector NewVel, bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetAllPhysicsLinearVelocity // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0xD, 0x7FF77693EC60
	void SetAllPhysicsAngularVelocityInRadians(struct FVector NewAngVel, bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetAllPhysicsAngularVelocityInRadians // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xD, 0x7FF77693EB80
	void SetAllPhysicsAngularVelocityInDegrees(struct FVector NewAngVel, bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetAllPhysicsAngularVelocityInDegrees // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xD, 0x7FF77693EA60
	void SetAllMassScale(float InMassScale); // Function Engine.PrimitiveComponent.SetAllMassScale // (Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77693E9E0
	struct FVector ScaleByMomentOfInertia(struct FVector InputVector, struct FName BoneName); // Function Engine.PrimitiveComponent.ScaleByMomentOfInertia // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x20, 0x7FF77693E8E0
	void PutRigidBodyToSleep(struct FName BoneName); // Function Engine.PrimitiveComponent.PutRigidBodyToSleep // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF77693E7E0
	bool K2_SphereTraceComponent(struct FVector TraceStart, struct FVector TraceEnd, float SphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector HitLocation, struct FVector HitNormal, struct FName BoneName, struct FHitResult OutHit); // Function Engine.PrimitiveComponent.K2_SphereTraceComponent // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xC9, 0x7FF77693E470
	bool K2_SphereOverlapComponent(struct FVector InSphereCentre, float InSphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector HitLocation, struct FVector HitNormal, struct FName BoneName, struct FHitResult OutHit); // Function Engine.PrimitiveComponent.K2_SphereOverlapComponent // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xBD, 0x7FF77693E140
	bool K2_LineTraceComponent(struct FVector TraceStart, struct FVector TraceEnd, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector HitLocation, struct FVector HitNormal, struct FName BoneName, struct FHitResult OutHit); // Function Engine.PrimitiveComponent.K2_LineTraceComponent // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xC5, 0x7FF77693DE10
	bool K2_IsQueryCollisionEnabled(); // Function Engine.PrimitiveComponent.K2_IsQueryCollisionEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77693DDD0
	bool K2_IsPhysicsCollisionEnabled(); // Function Engine.PrimitiveComponent.K2_IsPhysicsCollisionEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77693DD90
	bool K2_IsCollisionEnabled(); // Function Engine.PrimitiveComponent.K2_IsCollisionEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77693DD50
	bool K2_BoxOverlapComponent(struct FVector InBoxCentre, struct FBox InBox, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector HitLocation, struct FVector HitNormal, struct FName BoneName, struct FHitResult OutHit); // Function Engine.PrimitiveComponent.K2_BoxOverlapComponent // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xD5, 0x7FF77693DA10
	bool IsOverlappingComponent(struct UPrimitiveComponent* OtherComp); // Function Engine.PrimitiveComponent.IsOverlappingComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x9, 0x7FF77693D980
	bool IsOverlappingActor(struct AActor* Other); // Function Engine.PrimitiveComponent.IsOverlappingActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x9, 0x7FF77693D8F0
	bool IsGravityEnabled(); // Function Engine.PrimitiveComponent.IsGravityEnabled // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77693D8C0
	bool IsAnyRigidBodyAwake(); // Function Engine.PrimitiveComponent.IsAnyRigidBodyAwake // (Native|Public|BlueprintCallable|BlueprintPure) // Param Size : 0x1, 0x7FF77693D890
	void IgnoreComponentWhenMoving(struct UPrimitiveComponent* Component, bool bShouldIgnore); // Function Engine.PrimitiveComponent.IgnoreComponentWhenMoving // (Final|Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF77693D660
	void IgnoreActorWhenMoving(struct AActor* Actor, bool bShouldIgnore); // Function Engine.PrimitiveComponent.IgnoreActorWhenMoving // (Final|Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF77693D590
	struct FWalkableSlopeOverride GetWalkableSlopeOverride(); // Function Engine.PrimitiveComponent.GetWalkableSlopeOverride // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF77693D560
	struct FVector GetPhysicsLinearVelocityAtPoint(struct FVector Point, struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocityAtPoint // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x20, 0x7FF77693D3F0
	struct FVector GetPhysicsLinearVelocity(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocity // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x14, 0x7FF77693D350
	struct FVector GetPhysicsAngularVelocityInRadians(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocityInRadians // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF77693D2B0
	struct FVector GetPhysicsAngularVelocityInDegrees(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocityInDegrees // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF77693D1E0
	struct FVector GetPhysicsAngularVelocity(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocity // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF77693D1E0
	void GetOverlappingComponents(struct TArray<struct UPrimitiveComponent*> OutOverlappingComponents); // Function Engine.PrimitiveComponent.GetOverlappingComponents // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF77693D130
	void GetOverlappingActors(struct TArray<struct AActor*> OverlappingActors, class AActor* ClassFilter); // Function Engine.PrimitiveComponent.GetOverlappingActors // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x18, 0x7FF77693D040
	int32_t GetNumMaterials(); // Function Engine.PrimitiveComponent.GetNumMaterials // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF776879EC0
	struct UMaterialInterface* GetMaterialFromCollisionFaceIndex(int32_t FaceIndex, int32_t SectionIndex); // Function Engine.PrimitiveComponent.GetMaterialFromCollisionFaceIndex // (Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF77693CF60
	struct UMaterialInterface* GetMaterial(int32_t ElementIndex); // Function Engine.PrimitiveComponent.GetMaterial // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF77693CEC0
	float GetMassScale(struct FName BoneName); // Function Engine.PrimitiveComponent.GetMassScale // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF77693CE20
	float GetMass(); // Function Engine.PrimitiveComponent.GetMass // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF77693CDE0
	float GetLinearDamping(); // Function Engine.PrimitiveComponent.GetLinearDamping // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF77693CDA0
	struct FVector GetInertiaTensor(struct FName BoneName); // Function Engine.PrimitiveComponent.GetInertiaTensor // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF77693CCF0
	bool GetGenerateOverlapEvents(); // Function Engine.PrimitiveComponent.GetGenerateOverlapEvents // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77693CCC0
	enum class ECollisionResponse GetCollisionResponseToChannel(enum class ECollisionChannel Channel); // Function Engine.PrimitiveComponent.GetCollisionResponseToChannel // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x2, 0x7FF77693CC30
	struct FName GetCollisionProfileName(); // Function Engine.PrimitiveComponent.GetCollisionProfileName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF77693CBF0
	enum class ECollisionChannel GetCollisionObjectType(); // Function Engine.PrimitiveComponent.GetCollisionObjectType // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77693CBC0
	enum class ECollisionEnabled GetCollisionEnabled(); // Function Engine.PrimitiveComponent.GetCollisionEnabled // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77693CB90
	float GetClosestPointOnCollision(struct FVector Point, struct FVector OutPointOnBody, struct FName BoneName); // Function Engine.PrimitiveComponent.GetClosestPointOnCollision // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x24, 0x7FF77693CA50
	struct FVector GetCenterOfMass(struct FName BoneName); // Function Engine.PrimitiveComponent.GetCenterOfMass // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF77693C9B0
	float GetAngularDamping(); // Function Engine.PrimitiveComponent.GetAngularDamping // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF77693C600
	struct UMaterialInstanceDynamic* CreateDynamicMaterialInstance(int32_t ElementIndex, struct UMaterialInterface* SourceMaterial, struct FName OptionalName); // Function Engine.PrimitiveComponent.CreateDynamicMaterialInstance // (Native|Public|BlueprintCallable) // Param Size : 0x20, 0x7FF77693C4F0
	struct UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamicFromMaterial(int32_t ElementIndex, struct UMaterialInterface* Parent); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamicFromMaterial // (Native|Public|BlueprintCallable) // Param Size : 0x18, 0x7FF77693C420
	struct UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamic(int32_t ElementIndex); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamic // (Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF77693C380
	struct TArray<struct UPrimitiveComponent*> CopyArrayOfMoveIgnoreComponents(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreComponents // (Final|Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF77693C280
	struct TArray<struct AActor*> CopyArrayOfMoveIgnoreActors(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreActors // (Final|Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF77693C200
	void ClearMoveIgnoreComponents(); // Function Engine.PrimitiveComponent.ClearMoveIgnoreComponents // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF77693C1B0
	void ClearMoveIgnoreActors(); // Function Engine.PrimitiveComponent.ClearMoveIgnoreActors // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF77693C190
	bool CanCharacterStepUp(struct APawn* Pawn); // Function Engine.PrimitiveComponent.CanCharacterStepUp // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x9, 0x7FF77693C0F0
	void AddTorqueInRadians(struct FVector Torque, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddTorqueInRadians // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x15, 0x7FF77693BE80
	void AddTorqueInDegrees(struct FVector Torque, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddTorqueInDegrees // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x15, 0x7FF77693BFA0
	void AddTorque(struct FVector Torque, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddTorque // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x15, 0x7FF77693BE80
	void AddRadialImpulse(struct FVector Origin, float Radius, float Strength, enum class ERadialImpulseFalloff Falloff, bool bVelChange); // Function Engine.PrimitiveComponent.AddRadialImpulse // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x16, 0x7FF77693BCC0
	void AddRadialForce(struct FVector Origin, float Radius, float Strength, enum class ERadialImpulseFalloff Falloff, bool bAccelChange); // Function Engine.PrimitiveComponent.AddRadialForce // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x16, 0x7FF77693BB00
	void AddImpulseAtLocation(struct FVector Impulse, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddImpulseAtLocation // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x20, 0x7FF77693B7F0
	void AddImpulse(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddImpulse // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x15, 0x7FF77693B6D0
	void AddForceAtLocationLocal(struct FVector Force, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddForceAtLocationLocal // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x20, 0x7FF77693B5A0
	void AddForceAtLocation(struct FVector Force, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddForceAtLocation // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x20, 0x7FF77693B470
	void AddForce(struct FVector Force, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddForce // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x15, 0x7FF77693B350
	void AddAngularImpulseInRadians(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddAngularImpulseInRadians // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x15, 0x7FF77693B230
	void AddAngularImpulseInDegrees(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddAngularImpulseInDegrees // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x15, 0x7FF77693B0E0
	void AddAngularImpulse(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddAngularImpulse // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x15, 0x7FF77693AFC0
};

// Class Engine.MeshComponent
// Size : 0x430 (Inherited : 0x410)
struct UMeshComponent : UPrimitiveComponent {
	struct TArray<struct UMaterialInterface*> OverrideMaterials; // 0x408(0x10)
	unsigned char UnknownData_420[0x0008]; // 0x420(0x8)
	unsigned char bEnableMaterialParameterCaching : 1; // 0x428(0x1)
	unsigned char UnknownData_428_1 : 7; // 0x428(0x1)
	unsigned char UnknownData_429[0x0007]; // 0x429(0x7)

	void SetVectorParameterValueOnMaterials(struct FName ParameterName, struct FVector ParameterValue); // Function Engine.MeshComponent.SetVectorParameterValueOnMaterials // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x14, 0x7FF77690AED0
	void SetScalarParameterValueOnMaterials(struct FName ParameterName, float ParameterValue); // Function Engine.MeshComponent.SetScalarParameterValueOnMaterials // (Final|Native|Public|BlueprintCallable) // Param Size : 0xC, 0x7FF77690AE00
	void PrestreamTextures(float Seconds, bool bPrioritizeCharacterTextures, int32_t CinematicTextureGroups); // Function Engine.MeshComponent.PrestreamTextures // (Native|Public|BlueprintCallable) // Param Size : 0xC, 0x7FF77690AB70
	bool IsMaterialSlotNameValid(struct FName MaterialSlotName); // Function Engine.MeshComponent.IsMaterialSlotNameValid // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x9, 0x7FF77690AAD0
	struct TArray<struct FName> GetMaterialSlotNames(); // Function Engine.MeshComponent.GetMaterialSlotNames // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF77690A9D0
	struct TArray<struct UMaterialInterface*> GetMaterials(); // Function Engine.MeshComponent.GetMaterials // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF77690AA50
	int32_t GetMaterialIndex(struct FName MaterialSlotName); // Function Engine.MeshComponent.GetMaterialIndex // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF77690A930
};

// Class Engine.BlueprintFunctionLibrary
// Size : 0x28 (Inherited : 0x28)
struct UBlueprintFunctionLibrary : UObject {
};

// Class Engine.DataAsset
// Size : 0x30 (Inherited : 0x28)
struct UDataAsset : UObject {
	class UDataAsset* NativeClass; // 0x28(0x8)
};

// Class Engine.SplineComponent
// Size : 0x500 (Inherited : 0x410)
struct USplineComponent : UPrimitiveComponent {
	struct FSplineCurves SplineCurves; // 0x408(0x68)
	struct FInterpCurveVector SplineInfo; // 0x470(0x18)
	struct FInterpCurveQuat SplineRotInfo; // 0x488(0x18)
	struct FInterpCurveVector SplineScaleInfo; // 0x4A0(0x18)
	struct FInterpCurveFloat SplineReparamTable; // 0x4B8(0x18)
	bool bAllowSplineEditingPerInstance; // 0x4D0(0x1)
	int32_t ReparamStepsPerSegment; // 0x4D4(0x4)
	float Duration; // 0x4D8(0x4)
	bool bStationaryEndpoints; // 0x4DC(0x1)
	bool bSplineHasBeenEdited; // 0x4DD(0x1)
	bool bModifiedByConstructionScript; // 0x4DE(0x1)
	bool bInputSplinePointsToConstructionScript; // 0x4DF(0x1)
	bool bDrawDebug; // 0x4E0(0x1)
	bool bClosedLoop; // 0x4E1(0x1)
	bool bLoopPositionOverride; // 0x4E2(0x1)
	float LoopPosition; // 0x4E4(0x4)
	struct FVector DefaultUpVector; // 0x4E8(0xC)
	unsigned char UnknownData_4F8[0x0008]; // 0x4F8(0x8)

	void UpdateSpline(); // Function Engine.SplineComponent.UpdateSpline // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF77696CE70
	void SetWorldLocationAtSplinePoint(int32_t PointIndex, struct FVector InLocation); // Function Engine.SplineComponent.SetWorldLocationAtSplinePoint // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x10, 0x7FF77696C9E0
	void SetUpVectorAtSplinePoint(int32_t PointIndex, struct FVector InUpVector, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetUpVectorAtSplinePoint // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x12, 0x7FF77696C880
	void SetUnselectedSplineSegmentColor(struct FLinearColor SegmentColor); // Function Engine.SplineComponent.SetUnselectedSplineSegmentColor // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x10, 0x7FF77696BFA0
	void SetTangentsAtSplinePoint(int32_t PointIndex, struct FVector InArriveTangent, struct FVector InLeaveTangent, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetTangentsAtSplinePoint // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x1E, 0x7FF77696C6C0
	void SetTangentAtSplinePoint(int32_t PointIndex, struct FVector InTangent, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetTangentAtSplinePoint // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x12, 0x7FF77696C560
	void SetSplineWorldPoints(struct TArray<struct FVector> Points); // Function Engine.SplineComponent.SetSplineWorldPoints // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x10, 0x7FF77696C3E0
	void SetSplinePointType(int32_t PointIndex, enum class ESplinePointType Type, bool bUpdateSpline); // Function Engine.SplineComponent.SetSplinePointType // (Final|Native|Public|BlueprintCallable) // Param Size : 0x6, 0x7FF77696C1B0
	void SetSplinePoints(struct TArray<struct FVector> Points, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetSplinePoints // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x12, 0x7FF77696C2B0
	void SetSplineLocalPoints(struct TArray<struct FVector> Points); // Function Engine.SplineComponent.SetSplineLocalPoints // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x10, 0x7FF77696C100
	void SetSelectedSplineSegmentColor(struct FLinearColor SegmentColor); // Function Engine.SplineComponent.SetSelectedSplineSegmentColor // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x10, 0x7FF77696BFA0
	void SetLocationAtSplinePoint(int32_t PointIndex, struct FVector InLocation, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetLocationAtSplinePoint // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x12, 0x7FF77696BE40
	void SetDrawDebug(bool bShow); // Function Engine.SplineComponent.SetDrawDebug // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77696BDB0
	void SetDefaultUpVector(struct FVector UpVector, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.SetDefaultUpVector // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xD, 0x7FF77696BCD0
	void SetClosedLoopAtPosition(bool bInClosedLoop, float Key, bool bUpdateSpline); // Function Engine.SplineComponent.SetClosedLoopAtPosition // (Final|Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF77696BBC0
	void SetClosedLoop(bool bInClosedLoop, bool bUpdateSpline); // Function Engine.SplineComponent.SetClosedLoop // (Final|Native|Public|BlueprintCallable) // Param Size : 0x2, 0x7FF77696BAF0
	void RemoveSplinePoint(int32_t Index, bool bUpdateSpline); // Function Engine.SplineComponent.RemoveSplinePoint // (Final|Native|Public|BlueprintCallable) // Param Size : 0x5, 0x7FF77696BA30
	bool IsClosedLoop(); // Function Engine.SplineComponent.IsClosedLoop // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77696BA00
	struct FVector GetWorldTangentAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldTangentAtDistanceAlongSpline // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF77696B950
	struct FRotator GetWorldRotationAtTime(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetWorldRotationAtTime // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF77696B860
	struct FRotator GetWorldRotationAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldRotationAtDistanceAlongSpline // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF77696B7B0
	struct FVector GetWorldLocationAtTime(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetWorldLocationAtTime // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF77696B6C0
	struct FVector GetWorldLocationAtSplinePoint(int32_t PointIndex); // Function Engine.SplineComponent.GetWorldLocationAtSplinePoint // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF77696B610
	struct FVector GetWorldLocationAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldLocationAtDistanceAlongSpline // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF77696B560
	struct FVector GetWorldDirectionAtTime(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetWorldDirectionAtTime // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF77696B470
	struct FVector GetWorldDirectionAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldDirectionAtDistanceAlongSpline // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF77696B3C0
	struct FVector GetVectorPropertyAtSplinePoint(int32_t Index, struct FName PropertyName); // Function Engine.SplineComponent.GetVectorPropertyAtSplinePoint // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x18, 0x7FF77696B2F0
	struct FVector GetVectorPropertyAtSplineInputKey(float InKey, struct FName PropertyName); // Function Engine.SplineComponent.GetVectorPropertyAtSplineInputKey // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x18, 0x7FF77696B210
	struct FVector GetUpVectorAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetUpVectorAtTime // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF77696B0F0
	struct FVector GetUpVectorAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetUpVectorAtSplinePoint // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF77696B020
	struct FVector GetUpVectorAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetUpVectorAtSplineInputKey // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF77696AF40
	struct FVector GetUpVectorAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetUpVectorAtDistanceAlongSpline // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF77696AE60
	struct FTransform GetTransformAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity, bool bUseScale); // Function Engine.SplineComponent.GetTransformAtTime // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x40, 0x7FF77696ACD0
	struct FTransform GetTransformAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseScale); // Function Engine.SplineComponent.GetTransformAtSplinePoint // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x40, 0x7FF77696AB90
	struct FTransform GetTransformAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseScale); // Function Engine.SplineComponent.GetTransformAtSplineInputKey // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x40, 0x7FF77696AA40
	struct FTransform GetTransformAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseScale); // Function Engine.SplineComponent.GetTransformAtDistanceAlongSpline // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x40, 0x7FF77696A8F0
	struct FVector GetTangentAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetTangentAtTime // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF77696A7D0
	struct FVector GetTangentAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetTangentAtSplinePoint // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF776968FB0
	struct FVector GetTangentAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetTangentAtSplineInputKey // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF77696A6F0
	struct FVector GetTangentAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetTangentAtDistanceAlongSpline // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF77696A610
	enum class ESplinePointType GetSplinePointType(int32_t PointIndex); // Function Engine.SplineComponent.GetSplinePointType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x5, 0x7FF77696A580
	float GetSplineLength(); // Function Engine.SplineComponent.GetSplineLength // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF77696A550
	struct FVector GetScaleAtTime(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetScaleAtTime // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF77696A3E0
	struct FVector GetScaleAtSplinePoint(int32_t PointIndex); // Function Engine.SplineComponent.GetScaleAtSplinePoint // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF77696A340
	struct FVector GetScaleAtSplineInputKey(float InKey); // Function Engine.SplineComponent.GetScaleAtSplineInputKey // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF77696A2A0
	struct FVector GetScaleAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetScaleAtDistanceAlongSpline // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF77696A200
	struct FRotator GetRotationAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetRotationAtTime // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF77696A0E0
	struct FRotator GetRotationAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRotationAtSplinePoint // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF77696A010
	struct FRotator GetRotationAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRotationAtSplineInputKey // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF776969F30
	struct FRotator GetRotationAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRotationAtDistanceAlongSpline // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF776969E50
	float GetRollAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetRollAtTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776969D40
	float GetRollAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRollAtSplinePoint // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776969C80
	float GetRollAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRollAtSplineInputKey // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776969BB0
	float GetRollAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRollAtDistanceAlongSpline // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776969AE0
	struct FVector GetRightVectorAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetRightVectorAtTime // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF7769699C0
	struct FVector GetRightVectorAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRightVectorAtSplinePoint // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF7769698F0
	struct FVector GetRightVectorAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRightVectorAtSplineInputKey // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF776969810
	struct FVector GetRightVectorAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRightVectorAtDistanceAlongSpline // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF776969730
	int32_t GetNumberOfSplineSegments(); // Function Engine.SplineComponent.GetNumberOfSplineSegments // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF776969700
	int32_t GetNumberOfSplinePoints(); // Function Engine.SplineComponent.GetNumberOfSplinePoints // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF7769696D0
	struct FVector GetLocationAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetLocationAtTime // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF7769695B0
	struct FVector GetLocationAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetLocationAtSplinePoint // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF7769694E0
	struct FVector GetLocationAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetLocationAtSplineInputKey // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF776969400
	struct FVector GetLocationAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetLocationAtDistanceAlongSpline // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF776969320
	void GetLocationAndTangentAtSplinePoint(int32_t PointIndex, struct FVector Location, struct FVector Tangent, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetLocationAndTangentAtSplinePoint // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1D, 0x7FF7769691B0
	void GetLocalLocationAndTangentAtSplinePoint(int32_t PointIndex, struct FVector LocalLocation, struct FVector LocalTangent); // Function Engine.SplineComponent.GetLocalLocationAndTangentAtSplinePoint // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1C, 0x7FF776969080
	struct FVector GetLeaveTangentAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetLeaveTangentAtSplinePoint // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF776968FB0
	float GetInputKeyAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetInputKeyAtDistanceAlongSpline // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776968F20
	float GetFloatPropertyAtSplinePoint(int32_t Index, struct FName PropertyName); // Function Engine.SplineComponent.GetFloatPropertyAtSplinePoint // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF776968E60
	float GetFloatPropertyAtSplineInputKey(float InKey, struct FName PropertyName); // Function Engine.SplineComponent.GetFloatPropertyAtSplineInputKey // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF776968D90
	float GetDistanceAlongSplineAtSplinePoint(int32_t PointIndex); // Function Engine.SplineComponent.GetDistanceAlongSplineAtSplinePoint // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776968D00
	struct FVector GetDirectionAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetDirectionAtTime // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF776968BE0
	struct FVector GetDirectionAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetDirectionAtSplinePoint // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF776968B10
	struct FVector GetDirectionAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetDirectionAtSplineInputKey // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF776968A30
	struct FVector GetDirectionAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetDirectionAtDistanceAlongSpline // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF776968950
	struct FVector GetDefaultUpVector(enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetDefaultUpVector // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF7769688B0
	struct FVector GetArriveTangentAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetArriveTangentAtSplinePoint // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF7769687E0
	struct FVector FindUpVectorClosestToWorldLocation(struct FVector WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindUpVectorClosestToWorldLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1C, 0x7FF7769686F0
	struct FTransform FindTransformClosestToWorldLocation(struct FVector WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseScale); // Function Engine.SplineComponent.FindTransformClosestToWorldLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x40, 0x7FF7769685A0
	struct FVector FindTangentClosestToWorldLocation(struct FVector WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindTangentClosestToWorldLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1C, 0x7FF7769684B0
	struct FVector FindScaleClosestToWorldLocation(struct FVector WorldLocation); // Function Engine.SplineComponent.FindScaleClosestToWorldLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x18, 0x7FF776968400
	struct FRotator FindRotationClosestToWorldLocation(struct FVector WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindRotationClosestToWorldLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1C, 0x7FF776968310
	float FindRollClosestToWorldLocation(struct FVector WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindRollClosestToWorldLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF776968230
	struct FVector FindRightVectorClosestToWorldLocation(struct FVector WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindRightVectorClosestToWorldLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1C, 0x7FF776968140
	struct FVector FindLocationClosestToWorldLocation(struct FVector WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindLocationClosestToWorldLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1C, 0x7FF776968050
	float FindInputKeyClosestToWorldLocation(struct FVector WorldLocation); // Function Engine.SplineComponent.FindInputKeyClosestToWorldLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF776967FB0
	struct FVector FindDirectionClosestToWorldLocation(struct FVector WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindDirectionClosestToWorldLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1C, 0x7FF776967EC0
	void ClearSplinePoints(bool bUpdateSpline); // Function Engine.SplineComponent.ClearSplinePoints // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776967E30
	void AddSplineWorldPoint(struct FVector Position); // Function Engine.SplineComponent.AddSplineWorldPoint // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xC, 0x7FF776967D90
	void AddSplinePointAtIndex(struct FVector Position, int32_t Index, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.AddSplinePointAtIndex // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x12, 0x7FF776967C30
	void AddSplinePoint(struct FVector Position, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.AddSplinePoint // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xE, 0x7FF776967B20
	void AddSplineLocalPoint(struct FVector Position); // Function Engine.SplineComponent.AddSplineLocalPoint // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xC, 0x7FF776967A90
	void AddPoints(struct TArray<struct FSplinePoint> Points, bool bUpdateSpline); // Function Engine.SplineComponent.AddPoints // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x11, 0x7FF776967990
	void AddPoint(struct FSplinePoint Point, bool bUpdateSpline); // Function Engine.SplineComponent.AddPoint // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x45, 0x7FF776967880
};

// Class Engine.SkinnedMeshComponent
// Size : 0x640 (Inherited : 0x430)
struct USkinnedMeshComponent : UMeshComponent {
	struct USkeletalMesh* SkeletalMesh; // 0x430(0x8)
	struct FWeakObjectPtr<struct USkinnedMeshComponent> MasterPoseComponent; // 0x438(0x8)
	struct TArray<enum class ESkinCacheUsage> SkinCacheUsage; // 0x440(0x10)
	unsigned char UnknownData_450[0x00F8]; // 0x450(0xF8)
	struct UPhysicsAsset* PhysicsAssetOverride; // 0x548(0x8)
	int32_t ForcedLodModel; // 0x550(0x4)
	int32_t MinLodModel; // 0x554(0x4)
	unsigned char UnknownData_558[0x0008]; // 0x558(0x8)
	float StreamingDistanceMultiplier; // 0x560(0x4)
	unsigned char UnknownData_564[0x000C]; // 0x564(0xC)
	struct TArray<struct FSkelMeshComponentLODInfo> LODInfo; // 0x570(0x10)
	unsigned char UnknownData_580[0x0024]; // 0x580(0x24)
	enum class EVisibilityBasedAnimTickOption VisibilityBasedAnimTickOption; // 0x5A4(0x1)
	unsigned char UnknownData_5A5[0x0001]; // 0x5A5(0x1)
	unsigned char UnknownData_5A6_0 : 2; // 0x5A6(0x1)
	unsigned char bOverrideMinLOD : 1; // 0x5A6(0x1)
	unsigned char bUseBoundsFromMasterPoseComponent : 1; // 0x5A6(0x1)
	unsigned char bForceWireframe : 1; // 0x5A6(0x1)
	unsigned char bDisplayBones : 1; // 0x5A6(0x1)
	unsigned char bDisableMorphTarget : 1; // 0x5A6(0x1)
	unsigned char bHideSkin : 1; // 0x5A6(0x1)
	unsigned char bPerBoneMotionBlur : 1; // 0x5A7(0x1)
	unsigned char bComponentUseFixedSkelBounds : 1; // 0x5A7(0x1)
	unsigned char bConsiderAllBodiesForBounds : 1; // 0x5A7(0x1)
	unsigned char bSyncAttachParentLOD : 1; // 0x5A7(0x1)
	unsigned char bCanHighlightSelectedSections : 1; // 0x5A7(0x1)
	unsigned char bRecentlyRendered : 1; // 0x5A7(0x1)
	unsigned char bCastCapsuleDirectShadow : 1; // 0x5A7(0x1)
	unsigned char bCastCapsuleIndirectShadow : 1; // 0x5A7(0x1)
	unsigned char bCPUSkinning : 1; // 0x5A8(0x1)
	unsigned char bEnableUpdateRateOptimizations : 1; // 0x5A8(0x1)
	unsigned char bDisplayDebugUpdateRateOptimizations : 1; // 0x5A8(0x1)
	unsigned char bRenderStatic : 1; // 0x5A8(0x1)
	unsigned char bIgnoreMasterPoseComponentLOD : 1; // 0x5A8(0x1)
	unsigned char UnknownData_5A8_5 : 2; // 0x5A8(0x1)
	unsigned char bCachedLocalBoundsUpToDate : 1; // 0x5A8(0x1)
	unsigned char UnknownData_5A9_0 : 1; // 0x5A9(0x1)
	unsigned char bForceMeshObjectUpdate : 1; // 0x5A9(0x1)
	unsigned char UnknownData_5A9_2 : 6; // 0x5A9(0x1)
	unsigned char UnknownData_5AA[0x0002]; // 0x5AA(0x2)
	float CapsuleIndirectShadowMinVisibility; // 0x5AC(0x4)
	unsigned char UnknownData_5B0[0x0010]; // 0x5B0(0x10)
	struct FBoxSphereBounds CachedWorldSpaceBounds; // 0x5C0(0x1C)
	unsigned char UnknownData_5DC[0x0004]; // 0x5DC(0x4)
	struct FMatrix CachedWorldToLocalTransform; // 0x5E0(0x40)
	unsigned char UnknownData_620[0x0020]; // 0x620(0x20)

	void UnloadSkinWeightProfile(struct FName InProfileName); // Function Engine.SkinnedMeshComponent.UnloadSkinWeightProfile // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF77695C760
	void UnHideBoneByName(struct FName BoneName); // Function Engine.SkinnedMeshComponent.UnHideBoneByName // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF77695C6E0
	void TransformToBoneSpace(struct FName BoneName, struct FVector InPosition, struct FRotator InRotation, struct FVector OutPosition, struct FRotator OutRotation); // Function Engine.SkinnedMeshComponent.TransformToBoneSpace // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x38, 0x7FF77695C520
	void TransformFromBoneSpace(struct FName BoneName, struct FVector InPosition, struct FRotator InRotation, struct FVector OutPosition, struct FRotator OutRotation); // Function Engine.SkinnedMeshComponent.TransformFromBoneSpace // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x38, 0x7FF77695C360
	void ShowMaterialSection(int32_t MaterialID, int32_t SectionIndex, bool bShow, int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ShowMaterialSection // (Final|Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF77695C220
	void ShowAllMaterialSections(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ShowAllMaterialSections // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77695C1A0
	void SetVertexColorOverride_LinearColor(int32_t LODIndex, struct TArray<struct FLinearColor> VertexColors); // Function Engine.SkinnedMeshComponent.SetVertexColorOverride_LinearColor // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x18, 0x7FF77695C0C0
	bool SetSkinWeightProfile(struct FName InProfileName); // Function Engine.SkinnedMeshComponent.SetSkinWeightProfile // (Final|Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF77695C030
	void SetSkinWeightOverride(int32_t LODIndex, struct TArray<struct FSkelMeshSkinWeightInfo> SkinWeights); // Function Engine.SkinnedMeshComponent.SetSkinWeightOverride // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x18, 0x7FF77695BF50
	void SetSkeletalMesh(struct USkeletalMesh* NewMesh, bool bReinitPose); // Function Engine.SkinnedMeshComponent.SetSkeletalMesh // (Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF77695BE80
	void SetRenderStatic(bool bNewValue); // Function Engine.SkinnedMeshComponent.SetRenderStatic // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77695BDF0
	void SetPhysicsAsset(struct UPhysicsAsset* NewPhysicsAsset, bool bForceReInit); // Function Engine.SkinnedMeshComponent.SetPhysicsAsset // (Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF77695BD20
	void SetMinLOD(int32_t InNewMinLOD); // Function Engine.SkinnedMeshComponent.SetMinLOD // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77695BCA0
	void SetMasterPoseComponent(struct USkinnedMeshComponent* NewMasterBoneComponent, bool bForceUpdate); // Function Engine.SkinnedMeshComponent.SetMasterPoseComponent // (Final|Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF77695BBD0
	void SetForcedLOD(int32_t InNewForcedLOD); // Function Engine.SkinnedMeshComponent.SetForcedLOD // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77695BB50
	void SetCastCapsuleIndirectShadow(bool bNewValue); // Function Engine.SkinnedMeshComponent.SetCastCapsuleIndirectShadow // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77695BAC0
	void SetCastCapsuleDirectShadow(bool bNewValue); // Function Engine.SkinnedMeshComponent.SetCastCapsuleDirectShadow // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77695BA30
	void SetCapsuleIndirectShadowMinVisibility(float NewValue); // Function Engine.SkinnedMeshComponent.SetCapsuleIndirectShadowMinVisibility // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77695B9B0
	bool IsUsingSkinWeightProfile(); // Function Engine.SkinnedMeshComponent.IsUsingSkinWeightProfile // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77695B980
	bool IsMaterialSectionShown(int32_t MaterialID, int32_t LODIndex); // Function Engine.SkinnedMeshComponent.IsMaterialSectionShown // (Final|Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF77695B8C0
	bool IsBoneHiddenByName(struct FName BoneName); // Function Engine.SkinnedMeshComponent.IsBoneHiddenByName // (Final|Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF77695B830
	void HideBoneByName(struct FName BoneName, enum class EPhysBodyOp PhysBodyOption); // Function Engine.SkinnedMeshComponent.HideBoneByName // (Final|Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF77695B650
	bool GetTwistAndSwingAngleOfDeltaRotationFromRefPose(struct FName BoneName, float OutTwistAngle, float OutSwingAngle); // Function Engine.SkinnedMeshComponent.GetTwistAndSwingAngleOfDeltaRotationFromRefPose // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x11, 0x7FF77695B530
	struct FName GetSocketBoneName(struct FName InSocketName); // Function Engine.SkinnedMeshComponent.GetSocketBoneName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF77695B400
	struct FVector GetRefPosePosition(int32_t BoneIndex); // Function Engine.SkinnedMeshComponent.GetRefPosePosition // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x10, 0x7FF77695B360
	struct FName GetParentBone(struct FName BoneName); // Function Engine.SkinnedMeshComponent.GetParentBone // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF77695B2D0
	int32_t GetNumLODs(); // Function Engine.SkinnedMeshComponent.GetNumLODs // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF77695B2A0
	int32_t GetNumBones(); // Function Engine.SkinnedMeshComponent.GetNumBones // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF77695B270
	int32_t GetForcedLOD(); // Function Engine.SkinnedMeshComponent.GetForcedLOD // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF77695B240
	struct FTransform GetDeltaTransformFromRefPose(struct FName BoneName, struct FName BaseName); // Function Engine.SkinnedMeshComponent.GetDeltaTransformFromRefPose // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x40, 0x7FF77695B140
	struct FName GetCurrentSkinWeightProfileName(); // Function Engine.SkinnedMeshComponent.GetCurrentSkinWeightProfileName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF77695B120
	struct FName GetBoneName(int32_t BoneIndex); // Function Engine.SkinnedMeshComponent.GetBoneName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF77695B090
	int32_t GetBoneIndex(struct FName BoneName); // Function Engine.SkinnedMeshComponent.GetBoneIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF77695B000
	struct FName FindClosestBone_K2(struct FVector TestLocation, struct FVector BoneLocation, float IgnoreScale, bool bRequirePhysicsAsset); // Function Engine.SkinnedMeshComponent.FindClosestBone_K2 // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x28, 0x7FF77695AE70
	void ClearVertexColorOverride(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ClearVertexColorOverride // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77695ADF0
	void ClearSkinWeightProfile(); // Function Engine.SkinnedMeshComponent.ClearSkinWeightProfile // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF77695ADD0
	void ClearSkinWeightOverride(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ClearSkinWeightOverride // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77695AD50
	bool BoneIsChildOf(struct FName BoneName, struct FName ParentBoneName); // Function Engine.SkinnedMeshComponent.BoneIsChildOf // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x11, 0x7FF77695AC90
};

// Class Engine.SkeletalMeshComponent
// Size : 0xAD0 (Inherited : 0x640)
struct USkeletalMeshComponent : USkinnedMeshComponent {
	class UObject* AnimBlueprintGeneratedClass; // 0x640(0x8)
	class UAnimInstance* AnimClass; // 0x648(0x8)
	struct UAnimInstance* AnimScriptInstance; // 0x650(0x8)
	struct UAnimInstance* PostProcessAnimInstance; // 0x658(0x8)
	struct FSingleAnimationPlayData AnimationData; // 0x660(0x18)
	unsigned char UnknownData_678[0x0010]; // 0x678(0x10)
	struct FVector RootBoneTranslation; // 0x688(0xC)
	struct FVector LineCheckBoundsScale; // 0x694(0xC)
	unsigned char UnknownData_6A0[0x0020]; // 0x6A0(0x20)
	struct TArray<struct UAnimInstance*> LinkedInstances; // 0x6C0(0x10)
	struct TArray<struct FTransform> CachedBoneSpaceTransforms; // 0x6D0(0x10)
	struct TArray<struct FTransform> CachedComponentSpaceTransforms; // 0x6E0(0x10)
	unsigned char UnknownData_6F0[0x0020]; // 0x6F0(0x20)
	float GlobalAnimRateScale; // 0x710(0x4)
	enum class EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0x714(0x1)
	enum class EPhysicsTransformUpdateMode PhysicsTransformUpdateMode; // 0x715(0x1)
	unsigned char UnknownData_716[0x0001]; // 0x716(0x1)
	enum class EAnimationMode AnimationMode; // 0x717(0x1)
	unsigned char UnknownData_718[0x0001]; // 0x718(0x1)
	unsigned char bDisablePostProcessBlueprint : 1; // 0x719(0x1)
	unsigned char UnknownData_719_1 : 1; // 0x719(0x1)
	unsigned char bUpdateOverlapsOnAnimationFinalize : 1; // 0x719(0x1)
	unsigned char UnknownData_719_3 : 1; // 0x719(0x1)
	unsigned char bHasValidBodies : 1; // 0x719(0x1)
	unsigned char UnknownData_719_5 : 1; // 0x719(0x1)
	unsigned char bBlendPhysics : 1; // 0x719(0x1)
	unsigned char bEnablePhysicsOnDedicatedServer : 1; // 0x719(0x1)
	unsigned char bUpdateJointsFromAnimation : 1; // 0x71A(0x1)
	unsigned char bDisableClothSimulation : 1; // 0x71A(0x1)
	unsigned char bDisableRigidBodyAnimNode : 1; // 0x71A(0x1)
	unsigned char bAllowAnimCurveEvaluation : 1; // 0x71A(0x1)
	unsigned char bDisableAnimCurves : 1; // 0x71A(0x1)
	unsigned char UnknownData_71A_5 : 3; // 0x71A(0x1)
	unsigned char bCollideWithEnvironment : 1; // 0x71B(0x1)
	unsigned char bCollideWithAttachedChildren : 1; // 0x71B(0x1)
	unsigned char bLocalSpaceSimulation : 1; // 0x71B(0x1)
	unsigned char bResetAfterTeleport : 1; // 0x71B(0x1)
	unsigned char UnknownData_71B_4 : 1; // 0x71B(0x1)
	unsigned char bDeferKinematicBoneUpdate : 1; // 0x71B(0x1)
	unsigned char bNoSkeletonUpdate : 1; // 0x71B(0x1)
	unsigned char bPauseAnims : 1; // 0x71B(0x1)
	unsigned char bUseRefPoseOnInitAnim : 1; // 0x71C(0x1)
	unsigned char bEnablePerPolyCollision : 1; // 0x71C(0x1)
	unsigned char bForceRefpose : 1; // 0x71C(0x1)
	unsigned char bOnlyAllowAutonomousTickPose : 1; // 0x71C(0x1)
	unsigned char bIsAutonomousTickPose : 1; // 0x71C(0x1)
	unsigned char bOldForceRefPose : 1; // 0x71C(0x1)
	unsigned char bShowPrePhysBones : 1; // 0x71C(0x1)
	unsigned char bRequiredBonesUpToDate : 1; // 0x71C(0x1)
	unsigned char bAnimTreeInitialised : 1; // 0x71D(0x1)
	unsigned char bIncludeComponentLocationIntoBounds : 1; // 0x71D(0x1)
	unsigned char bEnableLineCheckWithBounds : 1; // 0x71D(0x1)
	unsigned char bUseBendingElements : 1; // 0x71D(0x1)
	unsigned char bUseTetrahedralConstraints : 1; // 0x71D(0x1)
	unsigned char bUseThinShellVolumeConstraints : 1; // 0x71D(0x1)
	unsigned char bUseSelfCollisions : 1; // 0x71D(0x1)
	unsigned char bUseContinuousCollisionDetection : 1; // 0x71D(0x1)
	unsigned char bPropagateCurvesToSlaves : 1; // 0x71E(0x1)
	unsigned char bSkipKinematicUpdateWhenInterpolating : 1; // 0x71E(0x1)
	unsigned char bSkipBoundsUpdateWhenInterpolating : 1; // 0x71E(0x1)
	unsigned char UnknownData_71E_3 : 1; // 0x71E(0x1)
	unsigned char bNeedsQueuedAnimEventsDispatched : 1; // 0x71E(0x1)
	unsigned char UnknownData_71E_5 : 3; // 0x71E(0x1)
	unsigned char UnknownData_71F[0x0001]; // 0x71F(0x1)
	uint16 CachedAnimCurveUidVersion; // 0x720(0x2)
	enum class EClothMassMode MassMode; // 0x722(0x1)
	unsigned char UnknownData_723[0x0001]; // 0x723(0x1)
	float UniformMass; // 0x724(0x4)
	float TotalMass; // 0x728(0x4)
	float Density; // 0x72C(0x4)
	float MinPerParticleMass; // 0x730(0x4)
	float ClothBlendWeight; // 0x734(0x4)
	float EdgeStiffness; // 0x738(0x4)
	float BendingStiffness; // 0x73C(0x4)
	float AreaStiffness; // 0x740(0x4)
	float VolumeStiffness; // 0x744(0x4)
	float StrainLimitingStiffness; // 0x748(0x4)
	float ShapeTargetStiffness; // 0x74C(0x4)
	struct TArray<struct FName> DisallowedAnimCurves; // 0x750(0x10)
	struct UBodySetup* BodySetup; // 0x760(0x8)
	unsigned char UnknownData_768[0x0008]; // 0x768(0x8)
	struct FMulticastInlineDelegate OnConstraintBroken; // 0x770(0x10)
	class UClothingSimulationFactory* ClothingSimulationFactory; // 0x780(0x8)
	unsigned char UnknownData_788[0x00D0]; // 0x788(0xD0)
	float TeleportDistanceThreshold; // 0x858(0x4)
	float TeleportRotationThreshold; // 0x85C(0x4)
	unsigned char UnknownData_860[0x0008]; // 0x860(0x8)
	uint32_t LastPoseTickFrame; // 0x868(0x4)
	unsigned char UnknownData_86C[0x0054]; // 0x86C(0x54)
	struct UClothingSimulationInteractor* ClothingInteractor; // 0x8C0(0x8)
	unsigned char UnknownData_8C8[0x00C8]; // 0x8C8(0xC8)
	struct FMulticastInlineDelegate OnAnimInitialized; // 0x990(0x10)
	unsigned char UnknownData_9A0[0x0130]; // 0x9A0(0x130)

	void UnlinkAnimClassLayers(class UAnimInstance* InClass); // Function Engine.SkeletalMeshComponent.UnlinkAnimClassLayers // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF7769574B0
	void UnbindClothFromMasterPoseComponent(bool bRestoreSimulationSpace); // Function Engine.SkeletalMeshComponent.UnbindClothFromMasterPoseComponent // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776957420
	void ToggleDisablePostProcessBlueprint(); // Function Engine.SkeletalMeshComponent.ToggleDisablePostProcessBlueprint // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776957400
	void TermBodiesBelow(struct FName ParentBoneName); // Function Engine.SkeletalMeshComponent.TermBodiesBelow // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF776957380
	void SuspendClothingSimulation(); // Function Engine.SkeletalMeshComponent.SuspendClothingSimulation // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776957360
	void Stop(); // Function Engine.SkeletalMeshComponent.Stop // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776957340
	void SnapshotPose(struct FPoseSnapshot Snapshot); // Function Engine.SkeletalMeshComponent.SnapshotPose // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x38, 0x7FF776957270
	void SetUpdateAnimationInEditor(bool NewUpdateState); // Function Engine.SkeletalMeshComponent.SetUpdateAnimationInEditor // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF7769571E0
	void SetTeleportRotationThreshold(float Threshold); // Function Engine.SkeletalMeshComponent.SetTeleportRotationThreshold // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF776957160
	void SetTeleportDistanceThreshold(float Threshold); // Function Engine.SkeletalMeshComponent.SetTeleportDistanceThreshold // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF7769570E0
	void SetPosition(float InPos, bool bFireNotifies); // Function Engine.SkeletalMeshComponent.SetPosition // (Final|Native|Public|BlueprintCallable) // Param Size : 0x5, 0x7FF776957010
	void SetPlayRate(float Rate); // Function Engine.SkeletalMeshComponent.SetPlayRate // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF776956F90
	void SetPhysicsBlendWeight(float PhysicsBlendWeight); // Function Engine.SkeletalMeshComponent.SetPhysicsBlendWeight // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF776956F10
	void SetNotifyRigidBodyCollisionBelow(bool bNewNotifyRigidBodyCollision, struct FName BoneName, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetNotifyRigidBodyCollisionBelow // (Native|Public|BlueprintCallable) // Param Size : 0xD, 0x7FF776956E00
	void SetMorphTarget(struct FName MorphTargetName, float Value, bool bRemoveZeroWeight); // Function Engine.SkeletalMeshComponent.SetMorphTarget // (Final|Native|Public|BlueprintCallable) // Param Size : 0xD, 0x7FF776956CF0
	void SetEnablePhysicsBlending(bool bNewBlendPhysics); // Function Engine.SkeletalMeshComponent.SetEnablePhysicsBlending // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776956C60
	void SetEnableGravityOnAllBodiesBelow(bool bEnableGravity, struct FName BoneName, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetEnableGravityOnAllBodiesBelow // (Final|Native|Public|BlueprintCallable) // Param Size : 0xD, 0x7FF776956B50
	void SetEnableBodyGravity(bool bEnableGravity, struct FName BoneName); // Function Engine.SkeletalMeshComponent.SetEnableBodyGravity // (Final|Native|Public|BlueprintCallable) // Param Size : 0xC, 0x7FF776956A90
	void SetDisablePostProcessBlueprint(bool bInDisablePostProcess); // Function Engine.SkeletalMeshComponent.SetDisablePostProcessBlueprint // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776956A00
	void SetDisableAnimCurves(bool bInDisableAnimCurves); // Function Engine.SkeletalMeshComponent.SetDisableAnimCurves // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776956970
	void SetConstraintProfileForAll(struct FName ProfileName, bool bDefaultIfNotFound); // Function Engine.SkeletalMeshComponent.SetConstraintProfileForAll // (Final|Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF7769568A0
	void SetConstraintProfile(struct FName JointName, struct FName ProfileName, bool bDefaultIfNotFound); // Function Engine.SkeletalMeshComponent.SetConstraintProfile // (Final|Native|Public|BlueprintCallable) // Param Size : 0x11, 0x7FF776956790
	void SetClothMaxDistanceScale(float Scale); // Function Engine.SkeletalMeshComponent.SetClothMaxDistanceScale // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF776956710
	void SetBodyNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision, struct FName BoneName); // Function Engine.SkeletalMeshComponent.SetBodyNotifyRigidBodyCollision // (Native|Public|BlueprintCallable) // Param Size : 0xC, 0x7FF776956640
	void SetAnimClass(class UObject* NewClass); // Function Engine.SkeletalMeshComponent.SetAnimClass // (Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF7769564B0
	void SetAnimationMode(enum class EAnimationMode InAnimationMode); // Function Engine.SkeletalMeshComponent.SetAnimationMode // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF7769565C0
	void SetAnimation(struct UAnimationAsset* NewAnimToPlay); // Function Engine.SkeletalMeshComponent.SetAnimation // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF776956540
	void SetAngularLimits(struct FName InBoneName, float Swing1LimitAngle, float TwistLimitAngle, float Swing2LimitAngle); // Function Engine.SkeletalMeshComponent.SetAngularLimits // (Final|Native|Public|BlueprintCallable) // Param Size : 0x14, 0x7FF776956360
	void SetAllowRigidBodyAnimNode(bool bInAllow, bool bReinitAnim); // Function Engine.SkeletalMeshComponent.SetAllowRigidBodyAnimNode // (Final|Native|Public|BlueprintCallable) // Param Size : 0x2, 0x7FF776956190
	void SetAllowedAnimCurvesEvaluation(struct TArray<struct FName> List, bool bAllow); // Function Engine.SkeletalMeshComponent.SetAllowedAnimCurvesEvaluation // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x11, 0x7FF776956260
	void SetAllowAnimCurveEvaluation(bool bInAllow); // Function Engine.SkeletalMeshComponent.SetAllowAnimCurveEvaluation // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776956100
	void SetAllMotorsAngularVelocityDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllMotorsAngularVelocityDrive // (Final|Native|Public|BlueprintCallable) // Param Size : 0x3, 0x7FF776955FE0
	void SetAllMotorsAngularPositionDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllMotorsAngularPositionDrive // (Final|Native|Public|BlueprintCallable) // Param Size : 0x3, 0x7FF776955EC0
	void SetAllMotorsAngularDriveParams(float InSpring, float InDamping, float InForceLimit, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllMotorsAngularDriveParams // (Final|Native|Public|BlueprintCallable) // Param Size : 0xD, 0x7FF776955D60
	void SetAllBodiesSimulatePhysics(bool bNewSimulate); // Function Engine.SkeletalMeshComponent.SetAllBodiesSimulatePhysics // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776955CD0
	void SetAllBodiesPhysicsBlendWeight(float PhysicsBlendWeight, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllBodiesPhysicsBlendWeight // (Final|Native|Public|BlueprintCallable) // Param Size : 0x5, 0x7FF776955C00
	void SetAllBodiesBelowSimulatePhysics(struct FName InBoneName, bool bNewSimulate, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetAllBodiesBelowSimulatePhysics // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0xA, 0x7FF776955AE0
	void SetAllBodiesBelowPhysicsBlendWeight(struct FName InBoneName, float PhysicsBlendWeight, bool bSkipCustomPhysicsType, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetAllBodiesBelowPhysicsBlendWeight // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0xE, 0x7FF776955970
	void ResumeClothingSimulation(); // Function Engine.SkeletalMeshComponent.ResumeClothingSimulation // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776955950
	void ResetClothTeleportMode(); // Function Engine.SkeletalMeshComponent.ResetClothTeleportMode // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776955930
	void ResetAnimInstanceDynamics(enum class ETeleportType InTeleportType); // Function Engine.SkeletalMeshComponent.ResetAnimInstanceDynamics // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF7769558B0
	void ResetAllowedAnimCurveEvaluation(); // Function Engine.SkeletalMeshComponent.ResetAllowedAnimCurveEvaluation // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776955890
	void ResetAllBodiesSimulatePhysics(); // Function Engine.SkeletalMeshComponent.ResetAllBodiesSimulatePhysics // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776955870
	void PlayAnimation(struct UAnimationAsset* NewAnimToPlay, bool bLooping); // Function Engine.SkeletalMeshComponent.PlayAnimation // (Final|Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF7769557A0
	void Play(bool bLooping); // Function Engine.SkeletalMeshComponent.Play // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776955710
	void OverrideAnimationData(struct UAnimationAsset* InAnimToPlay, bool bIsLooping, bool bIsPlaying, float Position, float PlayRate); // Function Engine.SkeletalMeshComponent.OverrideAnimationData // (Final|Native|Public|BlueprintCallable) // Param Size : 0x14, 0x7FF776955570
	void LinkAnimGraphByTag(struct FName InTag, class UAnimInstance* InClass); // Function Engine.SkeletalMeshComponent.LinkAnimGraphByTag // (Final|Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF7769554B0
	void LinkAnimClassLayers(class UAnimInstance* InClass); // Function Engine.SkeletalMeshComponent.LinkAnimClassLayers // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF776955430
	bool K2_GetClosestPointOnPhysicsAsset(struct FVector WorldPosition, struct FVector ClosestWorldPosition, struct FVector Normal, struct FName BoneName, float Distance); // Function Engine.SkeletalMeshComponent.K2_GetClosestPointOnPhysicsAsset // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x31, 0x7FF776955230
	bool IsPlaying(); // Function Engine.SkeletalMeshComponent.IsPlaying // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776955200
	bool IsClothingSimulationSuspended(); // Function Engine.SkeletalMeshComponent.IsClothingSimulationSuspended // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF7769551D0
	bool IsBodyGravityEnabled(struct FName BoneName); // Function Engine.SkeletalMeshComponent.IsBodyGravityEnabled // (Final|Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF776955140
	bool HasValidAnimationInstance(); // Function Engine.SkeletalMeshComponent.HasValidAnimationInstance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776955110
	float GetTeleportRotationThreshold(); // Function Engine.SkeletalMeshComponent.GetTeleportRotationThreshold // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF7769550E0
	float GetTeleportDistanceThreshold(); // Function Engine.SkeletalMeshComponent.GetTeleportDistanceThreshold // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF7769550E0
	struct FVector GetSkeletalCenterOfMass(); // Function Engine.SkeletalMeshComponent.GetSkeletalCenterOfMass // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF7769550A0
	struct UAnimInstance* GetPostProcessInstance(); // Function Engine.SkeletalMeshComponent.GetPostProcessInstance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776955070
	float GetPosition(); // Function Engine.SkeletalMeshComponent.GetPosition // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF776955040
	float GetPlayRate(); // Function Engine.SkeletalMeshComponent.GetPlayRate // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF776955010
	float GetMorphTarget(struct FName MorphTargetName); // Function Engine.SkeletalMeshComponent.GetMorphTarget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776954F70
	struct UAnimInstance* GetLinkedAnimLayerInstanceByGroup(struct FName InGroup); // Function Engine.SkeletalMeshComponent.GetLinkedAnimLayerInstanceByGroup // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF776954EE0
	struct UAnimInstance* GetLinkedAnimLayerInstanceByClass(class UAnimInstance* InClass); // Function Engine.SkeletalMeshComponent.GetLinkedAnimLayerInstanceByClass // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF776954E50
	void GetLinkedAnimGraphInstancesByTag(struct FName InTag, struct TArray<struct UAnimInstance*> OutLinkedInstances); // Function Engine.SkeletalMeshComponent.GetLinkedAnimGraphInstancesByTag // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x18, 0x7FF776954D60
	struct UAnimInstance* GetLinkedAnimGraphInstanceByTag(struct FName InTag); // Function Engine.SkeletalMeshComponent.GetLinkedAnimGraphInstanceByTag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF776954CD0
	bool GetDisablePostProcessBlueprint(); // Function Engine.SkeletalMeshComponent.GetDisablePostProcessBlueprint // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776954CA0
	bool GetDisableAnimCurves(); // Function Engine.SkeletalMeshComponent.GetDisableAnimCurves // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776954C70
	void GetCurrentJointAngles(struct FName InBoneName, float Swing1Angle, float TwistAngle, float Swing2Angle); // Function Engine.SkeletalMeshComponent.GetCurrentJointAngles // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x14, 0x7FF776954AF0
	float GetClothMaxDistanceScale(); // Function Engine.SkeletalMeshComponent.GetClothMaxDistanceScale // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF776954A90
	struct UClothingSimulationInteractor* GetClothingSimulationInteractor(); // Function Engine.SkeletalMeshComponent.GetClothingSimulationInteractor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776954AC0
	float GetBoneMass(struct FName BoneName, bool bScaleMass); // Function Engine.SkeletalMeshComponent.GetBoneMass // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF7769549C0
	struct UAnimInstance* GetAnimInstance(); // Function Engine.SkeletalMeshComponent.GetAnimInstance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776954960
	class UObject* GetAnimClass(); // Function Engine.SkeletalMeshComponent.GetAnimClass // (Final|Native|Public) // Param Size : 0x8, 0x7FF776954930
	enum class EAnimationMode GetAnimationMode(); // Function Engine.SkeletalMeshComponent.GetAnimationMode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776954990
	bool GetAllowRigidBodyAnimNode(); // Function Engine.SkeletalMeshComponent.GetAllowRigidBodyAnimNode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF7769548D0
	bool GetAllowedAnimCurveEvaluate(); // Function Engine.SkeletalMeshComponent.GetAllowedAnimCurveEvaluate // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776954900
	void ForceClothNextUpdateTeleportAndReset(); // Function Engine.SkeletalMeshComponent.ForceClothNextUpdateTeleportAndReset // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF7769548B0
	void ForceClothNextUpdateTeleport(); // Function Engine.SkeletalMeshComponent.ForceClothNextUpdateTeleport // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776954890
	struct FName FindConstraintBoneName(int32_t ConstraintIndex); // Function Engine.SkeletalMeshComponent.FindConstraintBoneName // (Final|Native|Public|BlueprintCallable) // Param Size : 0xC, 0x7FF776954800
	void ClearMorphTargets(); // Function Engine.SkeletalMeshComponent.ClearMorphTargets // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF7769547E0
	void BreakConstraint(struct FVector Impulse, struct FVector HitLocation, struct FName InBoneName); // Function Engine.SkeletalMeshComponent.BreakConstraint // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x20, 0x7FF7769546B0
	void BindClothToMasterPoseComponent(); // Function Engine.SkeletalMeshComponent.BindClothToMasterPoseComponent // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776954690
	void AllowAnimCurveEvaluation(struct FName NameOfCurve, bool bAllow); // Function Engine.SkeletalMeshComponent.AllowAnimCurveEvaluation // (Final|Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF7769545C0
	void AddImpulseToAllBodiesBelow(struct FVector Impulse, struct FName BoneName, bool bVelChange, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.AddImpulseToAllBodiesBelow // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x16, 0x7FF776954450
	void AddForceToAllBodiesBelow(struct FVector Force, struct FName BoneName, bool bAccelChange, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.AddForceToAllBodiesBelow // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x16, 0x7FF7769542E0
	void AccumulateAllBodiesBelowPhysicsBlendWeight(struct FName InBoneName, float AddPhysicsBlendWeight, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.AccumulateAllBodiesBelowPhysicsBlendWeight // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0xD, 0x7FF7769541C0
};

// Class Engine.AnimInstance
// Size : 0x270 (Inherited : 0x28)
struct UAnimInstance : UObject {
	struct USkeleton* CurrentSkeleton; // 0x28(0x8)
	enum class ERootMotionMode RootMotionMode; // 0x30(0x1)
	unsigned char bUseMultiThreadedAnimationUpdate : 1; // 0x31(0x1)
	unsigned char bUsingCopyPoseFromMesh : 1; // 0x31(0x1)
	unsigned char UnknownData_31_2 : 2; // 0x31(0x1)
	unsigned char bReceiveNotifiesFromLinkedInstances : 1; // 0x31(0x1)
	unsigned char bPropagateNotifiesToLinkedInstances : 1; // 0x31(0x1)
	unsigned char bQueueMontageEvents : 1; // 0x31(0x1)
	unsigned char UnknownData_32[0x0006]; // 0x32(0x6)
	struct FMulticastInlineDelegate OnMontageBlendingOut; // 0x38(0x10)
	struct FMulticastInlineDelegate OnMontageStarted; // 0x48(0x10)
	struct FMulticastInlineDelegate OnMontageEnded; // 0x58(0x10)
	struct FMulticastInlineDelegate OnAllMontageInstancesEnded; // 0x68(0x10)
	unsigned char UnknownData_78[0x0088]; // 0x78(0x88)
	struct FAnimNotifyQueue NotifyQueue; // 0x100(0x70)
	struct TArray<struct FAnimNotifyEvent> ActiveAnimNotifyState; // 0x170(0x10)
	unsigned char UnknownData_180[0x00F0]; // 0x180(0xF0)

	void UnlockAIResources(bool bUnlockMovement, bool UnlockAILogic); // Function Engine.AnimInstance.UnlockAIResources // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // Param Size : 0x2, 0x7FF776824820
	void UnlinkAnimClassLayers(class UAnimInstance* InClass); // Function Engine.AnimInstance.UnlinkAnimClassLayers // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF776825E30
	struct APawn* TryGetPawnOwner(); // Function Engine.AnimInstance.TryGetPawnOwner // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776825E00
	void StopSlotAnimation(float InBlendOutTime, struct FName SlotNodeName); // Function Engine.AnimInstance.StopSlotAnimation // (Final|Native|Public|BlueprintCallable) // Param Size : 0xC, 0x7FF776825D30
	void SnapshotPose(struct FPoseSnapshot Snapshot); // Function Engine.AnimInstance.SnapshotPose // (Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x38, 0x7FF776825C60
	void SetRootMotionMode(enum class ERootMotionMode Value); // Function Engine.AnimInstance.SetRootMotionMode // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77681A6A0
	void SetReceiveNotifiesFromLinkedInstances(bool bSet); // Function Engine.AnimInstance.SetReceiveNotifiesFromLinkedInstances // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776825BD0
	void SetPropagateNotifiesToLinkedInstances(bool bSet); // Function Engine.AnimInstance.SetPropagateNotifiesToLinkedInstances // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776825B40
	void SetMorphTarget(struct FName MorphTargetName, float Value); // Function Engine.AnimInstance.SetMorphTarget // (Final|Native|Public|BlueprintCallable) // Param Size : 0xC, 0x7FF776825A70
	void SavePoseSnapshot(struct FName SnapshotName); // Function Engine.AnimInstance.SavePoseSnapshot // (Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF7768259E0
	void ResetDynamics(enum class ETeleportType InTeleportType); // Function Engine.AnimInstance.ResetDynamics // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776825960
	struct UAnimMontage* PlaySlotAnimationAsDynamicMontage(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32_t LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage // (Final|Native|Public|BlueprintCallable) // Param Size : 0x30, 0x7FF776825720
	float PlaySlotAnimation(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32_t LoopCount); // Function Engine.AnimInstance.PlaySlotAnimation // (Final|Native|Public|BlueprintCallable) // Param Size : 0x24, 0x7FF776825560
	void Montage_StopGroupByName(float InBlendOutTime, struct FName GroupName); // Function Engine.AnimInstance.Montage_StopGroupByName // (Final|Native|Public|BlueprintCallable) // Param Size : 0xC, 0x7FF776825490
	void Montage_Stop(float InBlendOutTime, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Stop // (Final|Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF7768253C0
	void Montage_SetPosition(struct UAnimMontage* Montage, float NewPosition); // Function Engine.AnimInstance.Montage_SetPosition // (Final|Native|Public|BlueprintCallable) // Param Size : 0xC, 0x7FF7768252F0
	void Montage_SetPlayRate(struct UAnimMontage* Montage, float NewPlayRate); // Function Engine.AnimInstance.Montage_SetPlayRate // (Final|Native|Public|BlueprintCallable) // Param Size : 0xC, 0x7FF776825220
	void Montage_SetNextSection(struct FName SectionNameToChange, struct FName NextSection, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_SetNextSection // (Final|Native|Public|BlueprintCallable) // Param Size : 0x18, 0x7FF776825120
	void Montage_Resume(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Resume // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF7768250A0
	float Montage_Play(struct UAnimMontage* MontageToPlay, float InPlayRate, enum class EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages); // Function Engine.AnimInstance.Montage_Play // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1C, 0x7FF776824F10
	void Montage_Pause(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Pause // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF776824E90
	void Montage_JumpToSectionsEnd(struct FName SectionName, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_JumpToSectionsEnd // (Final|Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF776824DD0
	void Montage_JumpToSection(struct FName SectionName, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_JumpToSection // (Final|Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF776824D10
	bool Montage_IsPlaying(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_IsPlaying // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x9, 0x7FF776824C80
	bool Montage_IsActive(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_IsActive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x9, 0x7FF776824BF0
	float Montage_GetPosition(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetPosition // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776824B50
	float Montage_GetPlayRate(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetPlayRate // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776824AB0
	bool Montage_GetIsStopped(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetIsStopped // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x9, 0x7FF776824A20
	struct FName Montage_GetCurrentSection(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetCurrentSection // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF776824990
	float Montage_GetBlendTime(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetBlendTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF7768248F0
	void LockAIResources(bool bLockMovement, bool LockAILogic); // Function Engine.AnimInstance.LockAIResources // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // Param Size : 0x2, 0x7FF776824820
	void LinkAnimGraphByTag(struct FName InTag, class UAnimInstance* InClass); // Function Engine.AnimInstance.LinkAnimGraphByTag // (Final|Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF776824760
	void LinkAnimClassLayers(class UAnimInstance* InClass); // Function Engine.AnimInstance.LinkAnimClassLayers // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF7768246E0
	bool IsSyncGroupBetweenMarkers(struct FName InSyncGroupName, struct FName PreviousMarker, struct FName NextMarker, bool bRespectMarkerOrder); // Function Engine.AnimInstance.IsSyncGroupBetweenMarkers // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1A, 0x7FF776824590
	bool IsPlayingSlotAnimation(struct UAnimSequenceBase* Asset, struct FName SlotNodeName); // Function Engine.AnimInstance.IsPlayingSlotAnimation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x11, 0x7FF7768244D0
	bool IsAnyMontagePlaying(); // Function Engine.AnimInstance.IsAnyMontagePlaying // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF7768244A0
	bool HasMarkerBeenHitThisFrame(struct FName SyncGroup, struct FName MarkerName); // Function Engine.AnimInstance.HasMarkerBeenHitThisFrame // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x11, 0x7FF7768243E0
	bool GetTimeToClosestMarker(struct FName SyncGroup, struct FName MarkerName, float OutMarkerTime); // Function Engine.AnimInstance.GetTimeToClosestMarker // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x15, 0x7FF7768242D0
	struct FMarkerSyncAnimPosition GetSyncGroupPosition(struct FName InSyncGroupName); // Function Engine.AnimInstance.GetSyncGroupPosition // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1C, 0x7FF776824230
	float GetRelevantAnimTimeRemainingFraction(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeRemainingFraction // (Final|Native|Public|BlueprintCallable|BlueprintPure) // Param Size : 0xC, 0x7FF776824170
	float GetRelevantAnimTimeRemaining(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeRemaining // (Final|Native|Public|BlueprintCallable|BlueprintPure) // Param Size : 0xC, 0x7FF7768240B0
	float GetRelevantAnimTimeFraction(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeFraction // (Final|Native|Public|BlueprintCallable|BlueprintPure) // Param Size : 0xC, 0x7FF776823FF0
	float GetRelevantAnimTime(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTime // (Final|Native|Public|BlueprintCallable|BlueprintPure) // Param Size : 0xC, 0x7FF776823F30
	float GetRelevantAnimLength(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimLength // (Final|Native|Public|BlueprintCallable|BlueprintPure) // Param Size : 0xC, 0x7FF776823E70
	bool GetReceiveNotifiesFromLinkedInstances(); // Function Engine.AnimInstance.GetReceiveNotifiesFromLinkedInstances // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776823E40
	bool GetPropagateNotifiesToLinkedInstances(); // Function Engine.AnimInstance.GetPropagateNotifiesToLinkedInstances // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776823E10
	struct USkeletalMeshComponent* GetOwningComponent(); // Function Engine.AnimInstance.GetOwningComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776823DE0
	struct AActor* GetOwningActor(); // Function Engine.AnimInstance.GetOwningActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776823DB0
	struct UAnimInstance* GetLinkedAnimLayerInstanceByGroup(struct FName InGroup); // Function Engine.AnimInstance.GetLinkedAnimLayerInstanceByGroup // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF776823D20
	struct UAnimInstance* GetLinkedAnimLayerInstanceByClass(class UAnimInstance* InClass); // Function Engine.AnimInstance.GetLinkedAnimLayerInstanceByClass // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF776823C90
	void GetLinkedAnimGraphInstancesByTag(struct FName InTag, struct TArray<struct UAnimInstance*> OutLinkedInstances); // Function Engine.AnimInstance.GetLinkedAnimGraphInstancesByTag // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x18, 0x7FF776823BA0
	struct UAnimInstance* GetLinkedAnimGraphInstanceByTag(struct FName InTag); // Function Engine.AnimInstance.GetLinkedAnimGraphInstanceByTag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF776823B10
	float GetInstanceTransitionTimeElapsedFraction(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionTimeElapsedFraction // (Final|Native|Public|BlueprintCallable|BlueprintPure) // Param Size : 0xC, 0x7FF776823A50
	float GetInstanceTransitionTimeElapsed(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionTimeElapsed // (Final|Native|Public|BlueprintCallable|BlueprintPure) // Param Size : 0xC, 0x7FF776823990
	float GetInstanceTransitionCrossfadeDuration(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionCrossfadeDuration // (Final|Native|Public|BlueprintCallable|BlueprintPure) // Param Size : 0xC, 0x7FF7768238D0
	float GetInstanceStateWeight(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetInstanceStateWeight // (Final|Native|Public|BlueprintCallable|BlueprintPure) // Param Size : 0xC, 0x7FF776823810
	float GetInstanceMachineWeight(int32_t MachineIndex); // Function Engine.AnimInstance.GetInstanceMachineWeight // (Final|Native|Public|BlueprintCallable|BlueprintPure) // Param Size : 0x8, 0x7FF776823780
	float GetInstanceCurrentStateElapsedTime(int32_t MachineIndex); // Function Engine.AnimInstance.GetInstanceCurrentStateElapsedTime // (Final|Native|Public|BlueprintCallable|BlueprintPure) // Param Size : 0x8, 0x7FF7768236F0
	float GetInstanceAssetPlayerTimeFromEndFraction(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFromEndFraction // (Final|Native|Public|BlueprintCallable|BlueprintPure) // Param Size : 0x8, 0x7FF776823660
	float GetInstanceAssetPlayerTimeFromEnd(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFromEnd // (Final|Native|Public|BlueprintCallable|BlueprintPure) // Param Size : 0x8, 0x7FF7768235D0
	float GetInstanceAssetPlayerTimeFraction(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFraction // (Final|Native|Public|BlueprintCallable|BlueprintPure) // Param Size : 0x8, 0x7FF776823540
	float GetInstanceAssetPlayerTime(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTime // (Final|Native|Public|BlueprintCallable|BlueprintPure) // Param Size : 0x8, 0x7FF7768234B0
	float GetInstanceAssetPlayerLength(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerLength // (Final|Native|Public|BlueprintCallable|BlueprintPure) // Param Size : 0x8, 0x7FF776823420
	float GetCurveValue(struct FName CurveName); // Function Engine.AnimInstance.GetCurveValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776823380
	struct FName GetCurrentStateName(int32_t MachineIndex); // Function Engine.AnimInstance.GetCurrentStateName // (Final|Native|Public|BlueprintCallable|BlueprintPure) // Param Size : 0xC, 0x7FF7768232F0
	struct UAnimMontage* GetCurrentActiveMontage(); // Function Engine.AnimInstance.GetCurrentActiveMontage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF7768232C0
	void GetAllCurveNames(struct TArray<struct FName> OutNames); // Function Engine.AnimInstance.GetAllCurveNames // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x10, 0x7FF776823210
	void GetActiveCurveNames(enum class EAnimCurveType CurveType, struct TArray<struct FName> OutNames); // Function Engine.AnimInstance.GetActiveCurveNames // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x18, 0x7FF776823120
	void ClearMorphTargets(); // Function Engine.AnimInstance.ClearMorphTargets // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776823100
	float CalculateDirection(struct FVector Velocity, struct FRotator BaseRotation); // Function Engine.AnimInstance.CalculateDirection // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1C, 0x7FF776823000
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Engine.AnimInstance.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // Param Size : 0x4, 0x7FF77510D9D0
	void BlueprintPostEvaluateAnimation(); // Function Engine.AnimInstance.BlueprintPostEvaluateAnimation // (Event|Public|BlueprintEvent) // Param Size : 0x0, 0x7FF77510D9D0
	void BlueprintLinkedAnimationLayersInitialized(); // Function Engine.AnimInstance.BlueprintLinkedAnimationLayersInitialized // (Event|Public|BlueprintEvent) // Param Size : 0x0, 0x7FF77510D9D0
	void BlueprintInitializeAnimation(); // Function Engine.AnimInstance.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // Param Size : 0x0, 0x7FF77510D9D0
	void BlueprintBeginPlay(); // Function Engine.AnimInstance.BlueprintBeginPlay // (Event|Public|BlueprintEvent) // Param Size : 0x0, 0x7FF77510D9D0
};

// Class Engine.AudioComponent
// Size : 0x7D0 (Inherited : 0x1F0)
struct UAudioComponent : USceneComponent {
	struct USoundBase* Sound; // 0x1F0(0x8)
	struct TArray<struct FAudioComponentParam> InstanceParameters; // 0x1F8(0x10)
	struct USoundClass* SoundClassOverride; // 0x208(0x8)
	unsigned char bAutoDestroy : 1; // 0x210(0x1)
	unsigned char bStopWhenOwnerDestroyed : 1; // 0x210(0x1)
	unsigned char bShouldRemainActiveIfDropped : 1; // 0x210(0x1)
	unsigned char bAllowSpatialization : 1; // 0x210(0x1)
	unsigned char bOverrideAttenuation : 1; // 0x210(0x1)
	unsigned char bOverrideSubtitlePriority : 1; // 0x210(0x1)
	unsigned char bIsUISound : 1; // 0x210(0x1)
	unsigned char bEnableLowPassFilter : 1; // 0x210(0x1)
	unsigned char bOverridePriority : 1; // 0x211(0x1)
	unsigned char bSuppressSubtitles : 1; // 0x211(0x1)
	unsigned char UnknownData_211_2 : 6; // 0x211(0x1)
	unsigned char UnknownData_212_0 : 3; // 0x212(0x1)
	unsigned char bAutoManageAttachment : 1; // 0x212(0x1)
	unsigned char UnknownData_212_4 : 4; // 0x212(0x1)
	unsigned char UnknownData_213[0x0005]; // 0x213(0x5)
	struct FName AudioComponentUserID; // 0x218(0x8)
	float PitchModulationMin; // 0x220(0x4)
	float PitchModulationMax; // 0x224(0x4)
	float VolumeModulationMin; // 0x228(0x4)
	float VolumeModulationMax; // 0x22C(0x4)
	float VolumeMultiplier; // 0x230(0x4)
	int32_t EnvelopeFollowerAttackTime; // 0x234(0x4)
	int32_t EnvelopeFollowerReleaseTime; // 0x238(0x4)
	float Priority; // 0x23C(0x4)
	float SubtitlePriority; // 0x240(0x4)
	unsigned char UnknownData_244[0x0004]; // 0x244(0x4)
	struct USoundEffectSourcePresetChain* SourceEffectChain; // 0x248(0x8)
	float PitchMultiplier; // 0x250(0x4)
	float LowPassFilterFrequency; // 0x254(0x4)
	unsigned char UnknownData_258[0x0008]; // 0x258(0x8)
	struct USoundAttenuation* AttenuationSettings; // 0x260(0x8)
	struct FSoundAttenuationSettings AttenuationOverrides; // 0x268(0x3A0)
	struct USoundConcurrency* ConcurrencySettings; // 0x608(0x8)
	struct TSet<struct USoundConcurrency*> ConcurrencySet; // 0x610(0x50)
	unsigned char UnknownData_660[0x000C]; // 0x660(0xC)
	enum class EAttachmentRule AutoAttachLocationRule; // 0x66C(0x1)
	enum class EAttachmentRule AutoAttachRotationRule; // 0x66D(0x1)
	enum class EAttachmentRule AutoAttachScaleRule; // 0x66E(0x1)
	unsigned char UnknownData_66F[0x0001]; // 0x66F(0x1)
	struct FMulticastInlineDelegate OnAudioFinished; // 0x670(0x10)
	unsigned char UnknownData_680[0x0018]; // 0x680(0x18)
	struct FMulticastInlineDelegate OnAudioPlaybackPercent; // 0x698(0x10)
	unsigned char UnknownData_6A8[0x0018]; // 0x6A8(0x18)
	struct FMulticastInlineDelegate OnAudioSingleEnvelopeValue; // 0x6C0(0x10)
	unsigned char UnknownData_6D0[0x0018]; // 0x6D0(0x18)
	struct FMulticastInlineDelegate OnAudioMultiEnvelopeValue; // 0x6E8(0x10)
	unsigned char UnknownData_6F8[0x0018]; // 0x6F8(0x18)
	struct FSoundModulation Modulation; // 0x710(0x10)
	struct FDelegate OnQueueSubtitles; // 0x720(0x10)
	struct FWeakObjectPtr<struct USceneComponent> AutoAttachParent; // 0x730(0x8)
	struct FName AutoAttachSocketName; // 0x738(0x8)
	unsigned char UnknownData_740[0x0090]; // 0x740(0x90)

	void StopDelayed(float DelayTime); // Function Engine.AudioComponent.StopDelayed // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF776837780
	void Stop(); // Function Engine.AudioComponent.Stop // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776837760
	void SetWaveParameter(struct FName InName, struct USoundWave* InWave); // Function Engine.AudioComponent.SetWaveParameter // (Final|Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF7768376A0
	void SetVolumeMultiplier(float NewVolumeMultiplier); // Function Engine.AudioComponent.SetVolumeMultiplier // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF776837620
	void SetUISound(bool bInUISound); // Function Engine.AudioComponent.SetUISound // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776837590
	void SetSubmixSend(struct USoundSubmixBase* Submix, float SendLevel); // Function Engine.AudioComponent.SetSubmixSend // (Final|Native|Public|BlueprintCallable) // Param Size : 0xC, 0x7FF776837440
	void SetSourceBusSendPreEffect(struct USoundSourceBus* SoundSourceBus, float SourceBusSendLevel); // Function Engine.AudioComponent.SetSourceBusSendPreEffect // (Final|Native|Public|BlueprintCallable) // Param Size : 0xC, 0x7FF7768372F0
	void SetSourceBusSendPostEffect(struct USoundSourceBus* SoundSourceBus, float SourceBusSendLevel); // Function Engine.AudioComponent.SetSourceBusSendPostEffect // (Final|Native|Public|BlueprintCallable) // Param Size : 0xC, 0x7FF776837220
	void SetSound(struct USoundBase* NewSound); // Function Engine.AudioComponent.SetSound // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF7768371A0
	void SetPitchMultiplier(float NewPitchMultiplier); // Function Engine.AudioComponent.SetPitchMultiplier // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF776837010
	void SetPaused(bool bPause); // Function Engine.AudioComponent.SetPaused // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776836F80
	void SetLowPassFilterFrequency(float InLowPassFilterFrequency); // Function Engine.AudioComponent.SetLowPassFilterFrequency // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF776836F00
	void SetLowPassFilterEnabled(bool InLowPassFilterEnabled); // Function Engine.AudioComponent.SetLowPassFilterEnabled // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776836E70
	void SetIntParameter(struct FName InName, int32_t inInt); // Function Engine.AudioComponent.SetIntParameter // (Final|Native|Public|BlueprintCallable) // Param Size : 0xC, 0x7FF776836DB0
	void SetFloatParameter(struct FName InName, float InFloat); // Function Engine.AudioComponent.SetFloatParameter // (Final|Native|Public|BlueprintCallable) // Param Size : 0xC, 0x7FF776836C60
	void SetBoolParameter(struct FName InName, bool InBool); // Function Engine.AudioComponent.SetBoolParameter // (Final|Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF776836890
	void Play(float StartTime); // Function Engine.AudioComponent.Play // (Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF776836790
	bool IsPlaying(); // Function Engine.AudioComponent.IsPlaying // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776836760
	bool HasCookedFFTData(); // Function Engine.AudioComponent.HasCookedFFTData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776836730
	bool HasCookedAmplitudeEnvelopeData(); // Function Engine.AudioComponent.HasCookedAmplitudeEnvelopeData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776836700
	enum class EAudioComponentPlayState GetPlayState(); // Function Engine.AudioComponent.GetPlayState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF7768366D0
	bool GetCookedFFTDataForAllPlayingSounds(struct TArray<struct FSoundWaveSpectralDataPerSound> OutSoundWaveSpectralData); // Function Engine.AudioComponent.GetCookedFFTDataForAllPlayingSounds // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x11, 0x7FF7768365F0
	bool GetCookedFFTData(struct TArray<float> FrequenciesToGet, struct TArray<struct FSoundWaveSpectralData> OutSoundWaveSpectralData); // Function Engine.AudioComponent.GetCookedFFTData // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x21, 0x7FF7768364D0
	bool GetCookedEnvelopeDataForAllPlayingSounds(struct TArray<struct FSoundWaveEnvelopeDataPerSound> OutEnvelopeData); // Function Engine.AudioComponent.GetCookedEnvelopeDataForAllPlayingSounds // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x11, 0x7FF776836410
	bool GetCookedEnvelopeData(float OutEnvelopeData); // Function Engine.AudioComponent.GetCookedEnvelopeData // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x5, 0x7FF776836360
	void FadeOut(float FadeOutDuration, float FadeVolumeLevel, enum class EAudioFaderCurve FadeCurve); // Function Engine.AudioComponent.FadeOut // (Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF776836250
	void FadeIn(float FadeInDuration, float FadeVolumeLevel, float StartTime, enum class EAudioFaderCurve FadeCurve); // Function Engine.AudioComponent.FadeIn // (Native|Public|BlueprintCallable) // Param Size : 0xD, 0x7FF776836100
	bool BP_GetAttenuationSettingsToApply(struct FSoundAttenuationSettings OutAttenuationSettings); // Function Engine.AudioComponent.BP_GetAttenuationSettingsToApply // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x3A1, 0x7FF776835F10
	void AdjustVolume(float AdjustVolumeDuration, float AdjustVolumeLevel, enum class EAudioFaderCurve FadeCurve); // Function Engine.AudioComponent.AdjustVolume // (Final|Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF7768355C0
	void AdjustAttenuation(struct FSoundAttenuationSettings InAttenuationSettings); // Function Engine.AudioComponent.AdjustAttenuation // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x3A0, 0x7FF7768354F0
};

// Class Engine.AssetImportData
// Size : 0x28 (Inherited : 0x28)
struct UAssetImportData : UObject {
};

// Class Engine.AssetUserData
// Size : 0x28 (Inherited : 0x28)
struct UAssetUserData : UObject {
};

// Class Engine.FXSystemComponent
// Size : 0x410 (Inherited : 0x410)
struct UFXSystemComponent : UPrimitiveComponent {

	void SetVectorParameter(struct FName ParameterName, struct FVector Param); // Function Engine.FXSystemComponent.SetVectorParameter // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x14, 0x7FF776922260
	void SetUseAutoManageAttachment(bool bAutoManage); // Function Engine.FXSystemComponent.SetUseAutoManageAttachment // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF7769221D0
	void SetFloatParameter(struct FName ParameterName, float Param); // Function Engine.FXSystemComponent.SetFloatParameter // (Native|Public|BlueprintCallable) // Param Size : 0xC, 0x7FF776921E70
	void SetEmitterEnable(struct FName EmitterName, bool bNewEnableState); // Function Engine.FXSystemComponent.SetEmitterEnable // (Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF776921DA0
	void SetColorParameter(struct FName ParameterName, struct FLinearColor Param); // Function Engine.FXSystemComponent.SetColorParameter // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x18, 0x7FF776921CD0
	void SetBoolParameter(struct FName ParameterName, bool Param); // Function Engine.FXSystemComponent.SetBoolParameter // (Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF776921B30
	void SetAutoAttachmentParameters(struct USceneComponent* Parent, struct FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule); // Function Engine.FXSystemComponent.SetAutoAttachmentParameters // (Native|Public|BlueprintCallable) // Param Size : 0x13, 0x7FF7769212A0
	void SetActorParameter(struct FName ParameterName, struct AActor* Param); // Function Engine.FXSystemComponent.SetActorParameter // (Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF7769210B0
	void ReleaseToPool(); // Function Engine.FXSystemComponent.ReleaseToPool // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776921090
	struct UFXSystemAsset* GetFXSystemAsset(); // Function Engine.FXSystemComponent.GetFXSystemAsset // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776920AA0
};

// Class Engine.DeveloperSettings
// Size : 0x38 (Inherited : 0x28)
struct UDeveloperSettings : UObject {
	unsigned char UnknownData_28[0x0010]; // 0x28(0x10)
};

// Class Engine.FXSystemAsset
// Size : 0x30 (Inherited : 0x28)
struct UFXSystemAsset : UObject {
	uint32_t MaxPoolSize; // 0x28(0x4)
	unsigned char UnknownData_2C[0x0004]; // 0x2C(0x4)
};

// Class Engine.AnimNotify
// Size : 0x38 (Inherited : 0x28)
struct UAnimNotify : UObject {
	unsigned char UnknownData_28[0x0010]; // 0x28(0x10)

	bool Received_Notify(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Engine.AnimNotify.Received_Notify // (Event|Public|BlueprintEvent|Const) // Param Size : 0x11, 0x7FF77510D9D0
	struct FString GetNotifyName(); // Function Engine.AnimNotify.GetNotifyName // (Native|Event|Public|BlueprintEvent|Const) // Param Size : 0x10, 0x7FF776125C40
};

// Class Engine.AnimNotifyState
// Size : 0x30 (Inherited : 0x28)
struct UAnimNotifyState : UObject {
	unsigned char UnknownData_28[0x0008]; // 0x28(0x8)

	bool Received_NotifyTick(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, float FrameDeltaTime); // Function Engine.AnimNotifyState.Received_NotifyTick // (Event|Public|BlueprintEvent|Const) // Param Size : 0x15, 0x7FF77510D9D0
	bool Received_NotifyEnd(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Engine.AnimNotifyState.Received_NotifyEnd // (Event|Public|BlueprintEvent|Const) // Param Size : 0x11, 0x7FF77510D9D0
	bool Received_NotifyBegin(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, float TotalDuration); // Function Engine.AnimNotifyState.Received_NotifyBegin // (Event|Public|BlueprintEvent|Const) // Param Size : 0x15, 0x7FF77510D9D0
	struct FString GetNotifyName(); // Function Engine.AnimNotifyState.GetNotifyName // (Native|Event|Public|BlueprintEvent|Const) // Param Size : 0x10, 0x7FF776125C40
};

// Class Engine.SaveGame
// Size : 0x28 (Inherited : 0x28)
struct USaveGame : UObject {
};

// Class Engine.Info
// Size : 0x220 (Inherited : 0x220)
struct AInfo : AActor {
};

// Class Engine.GameModeBase
// Size : 0x2C0 (Inherited : 0x220)
struct AGameModeBase : AInfo {
	struct FString OptionsString; // 0x220(0x10)
	class AGameSession* GameSessionClass; // 0x230(0x8)
	class AGameStateBase* GameStateClass; // 0x238(0x8)
	class APlayerController* PlayerControllerClass; // 0x240(0x8)
	class APlayerState* PlayerStateClass; // 0x248(0x8)
	class AHUD* HUDClass; // 0x250(0x8)
	class APawn* DefaultPawnClass; // 0x258(0x8)
	class ASpectatorPawn* SpectatorClass; // 0x260(0x8)
	class APlayerController* ReplaySpectatorPlayerControllerClass; // 0x268(0x8)
	class AServerStatReplicator* ServerStatReplicatorClass; // 0x270(0x8)
	struct AGameSession* GameSession; // 0x278(0x8)
	struct AGameStateBase* GameState; // 0x280(0x8)
	struct AServerStatReplicator* ServerStatReplicator; // 0x288(0x8)
	struct FText DefaultPlayerName; // 0x290(0x18)
	unsigned char bUseSeamlessTravel : 1; // 0x2A8(0x1)
	unsigned char bStartPlayersAsSpectators : 1; // 0x2A8(0x1)
	unsigned char bPauseable : 1; // 0x2A8(0x1)
	unsigned char UnknownData_2A8_3 : 5; // 0x2A8(0x1)
	unsigned char UnknownData_2A9[0x0017]; // 0x2A9(0x17)

	void StartPlay(); // Function Engine.GameModeBase.StartPlay // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776880750
	struct APawn* SpawnDefaultPawnFor(struct AController* NewPlayer, struct AActor* StartSpot); // Function Engine.GameModeBase.SpawnDefaultPawnFor // (Native|Event|Public|BlueprintEvent) // Param Size : 0x18, 0x7FF77687E920
	struct APawn* SpawnDefaultPawnAtTransform(struct AController* NewPlayer, struct FTransform SpawnTransform); // Function Engine.GameModeBase.SpawnDefaultPawnAtTransform // (Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // Param Size : 0x48, 0x7FF77687E800
	bool ShouldReset(struct AActor* ActorToReset); // Function Engine.GameModeBase.ShouldReset // (Native|Event|Public|BlueprintEvent) // Param Size : 0x9, 0x7FF77687E320
	void ReturnToMainMenuHost(); // Function Engine.GameModeBase.ReturnToMainMenuHost // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF77687D330
	void RestartPlayerAtTransform(struct AController* NewPlayer, struct FTransform SpawnTransform); // Function Engine.GameModeBase.RestartPlayerAtTransform // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x40, 0x7FF77687D210
	void RestartPlayerAtPlayerStart(struct AController* NewPlayer, struct AActor* StartSpot); // Function Engine.GameModeBase.RestartPlayerAtPlayerStart // (Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF77687D140
	void RestartPlayer(struct AController* NewPlayer); // Function Engine.GameModeBase.RestartPlayer // (Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF77687D0B0
	void ResetLevel(); // Function Engine.GameModeBase.ResetLevel // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF77687D070
	bool PlayerCanRestart(struct APlayerController* Player); // Function Engine.GameModeBase.PlayerCanRestart // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // Param Size : 0x9, 0x7FF77687C9D0
	bool MustSpectate(struct APlayerController* NewPlayerController); // Function Engine.GameModeBase.MustSpectate // (Native|Event|Public|BlueprintEvent|Const) // Param Size : 0x9, 0x7FF77687BAD0
	void K2_PostLogin(struct APlayerController* NewPlayer); // Function Engine.GameModeBase.K2_PostLogin // (Event|Public|BlueprintEvent) // Param Size : 0x8, 0x7FF77510D9D0
	void K2_OnSwapPlayerControllers(struct APlayerController* OldPC, struct APlayerController* NewPC); // Function Engine.GameModeBase.K2_OnSwapPlayerControllers // (Event|Protected|BlueprintEvent) // Param Size : 0x10, 0x7FF77510D9D0
	void K2_OnRestartPlayer(struct AController* NewPlayer); // Function Engine.GameModeBase.K2_OnRestartPlayer // (Event|Public|BlueprintEvent) // Param Size : 0x8, 0x7FF77510D9D0
	void K2_OnLogout(struct AController* ExitingController); // Function Engine.GameModeBase.K2_OnLogout // (Event|Public|BlueprintEvent) // Param Size : 0x8, 0x7FF77510D9D0
	void K2_OnChangeName(struct AController* Other, struct FString NewName, bool bNameChange); // Function Engine.GameModeBase.K2_OnChangeName // (Event|Public|BlueprintEvent) // Param Size : 0x19, 0x7FF77510D9D0
	struct AActor* K2_FindPlayerStart(struct AController* Player, struct FString IncomingName); // Function Engine.GameModeBase.K2_FindPlayerStart // (Final|Native|Public|BlueprintCallable|BlueprintPure) // Param Size : 0x20, 0x7FF77687B240
	void InitStartSpot(struct AActor* StartSpot, struct AController* NewPlayer); // Function Engine.GameModeBase.InitStartSpot // (Native|Event|Public|BlueprintEvent) // Param Size : 0x10, 0x7FF77687B070
	void InitializeHUDForPlayer(struct APlayerController* NewPlayer); // Function Engine.GameModeBase.InitializeHUDForPlayer // (Native|Event|Protected|BlueprintEvent) // Param Size : 0x8, 0x7FF776867170
	bool HasMatchStarted(); // Function Engine.GameModeBase.HasMatchStarted // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77687AF00
	void HandleStartingNewPlayer(struct APlayerController* NewPlayer); // Function Engine.GameModeBase.HandleStartingNewPlayer // (Native|Event|Public|BlueprintEvent) // Param Size : 0x8, 0x7FF77687ADA0
	int32_t GetNumSpectators(); // Function Engine.GameModeBase.GetNumSpectators // (Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF776879EF0
	int32_t GetNumPlayers(); // Function Engine.GameModeBase.GetNumPlayers // (Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF776879EC0
	class UObject* GetDefaultPawnClassForController(struct AController* InController); // Function Engine.GameModeBase.GetDefaultPawnClassForController // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // Param Size : 0x10, 0x7FF776879860
	struct AActor* FindPlayerStart(struct AController* Player, struct FString IncomingName); // Function Engine.GameModeBase.FindPlayerStart // (Native|Event|Public|BlueprintEvent) // Param Size : 0x20, 0x7FF776878920
	struct AActor* ChoosePlayerStart(struct AController* Player); // Function Engine.GameModeBase.ChoosePlayerStart // (Native|Event|Public|BlueprintEvent) // Param Size : 0x10, 0x7FF776877D80
	void ChangeName(struct AController* Controller, struct FString NewName, bool bNameChange); // Function Engine.GameModeBase.ChangeName // (Native|Public|BlueprintCallable) // Param Size : 0x19, 0x7FF776877C60
	bool CanSpectate(struct APlayerController* Viewer, struct APlayerState* ViewTarget); // Function Engine.GameModeBase.CanSpectate // (Native|Event|Public|BlueprintEvent) // Param Size : 0x11, 0x7FF776877B70
};

// Class Engine.GameMode
// Size : 0x308 (Inherited : 0x2C0)
struct AGameMode : AGameModeBase {
	struct FName MatchState; // 0x2C0(0x8)
	unsigned char bDelayedStart : 1; // 0x2C8(0x1)
	unsigned char UnknownData_2C8_1 : 7; // 0x2C8(0x1)
	unsigned char UnknownData_2C9[0x0003]; // 0x2C9(0x3)
	int32_t NumSpectators; // 0x2CC(0x4)
	int32_t NumPlayers; // 0x2D0(0x4)
	int32_t NumBots; // 0x2D4(0x4)
	float MinRespawnDelay; // 0x2D8(0x4)
	int32_t NumTravellingPlayers; // 0x2DC(0x4)
	class ULocalMessage* EngineMessageClass; // 0x2E0(0x8)
	struct TArray<struct APlayerState*> InactivePlayerArray; // 0x2E8(0x10)
	float InactivePlayerStateLifeSpan; // 0x2F8(0x4)
	int32_t MaxInactivePlayers; // 0x2FC(0x4)
	bool bHandleDedicatedServerReplays; // 0x300(0x1)
	unsigned char UnknownData_301[0x0007]; // 0x301(0x7)

	void StartMatch(); // Function Engine.GameMode.StartMatch // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776880730
	void SetBandwidthLimit(float AsyncIOBandwidthLimit); // Function Engine.GameMode.SetBandwidthLimit // (Exec|Native|Public) // Param Size : 0x4, 0x7FF77687D500
	void Say(struct FString Msg); // Function Engine.GameMode.Say // (Exec|Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF77687D460
	void RestartGame(); // Function Engine.GameMode.RestartGame // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF77687D090
	bool ReadyToStartMatch(); // Function Engine.GameMode.ReadyToStartMatch // (Native|Event|Protected|BlueprintEvent) // Param Size : 0x1, 0x7FF77687CDC0
	bool ReadyToEndMatch(); // Function Engine.GameMode.ReadyToEndMatch // (Native|Event|Protected|BlueprintEvent) // Param Size : 0x1, 0x7FF77687CD90
	void K2_OnSetMatchState(struct FName NewState); // Function Engine.GameMode.K2_OnSetMatchState // (Event|Protected|BlueprintEvent) // Param Size : 0x8, 0x7FF77510D9D0
	bool IsMatchInProgress(); // Function Engine.GameMode.IsMatchInProgress // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77684DE40
	bool HasMatchEnded(); // Function Engine.GameMode.HasMatchEnded // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77687AED0
	struct FName GetMatchState(); // Function Engine.GameMode.GetMatchState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776879E20
	void EndMatch(); // Function Engine.GameMode.EndMatch // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF7768787B0
	void AbortMatch(); // Function Engine.GameMode.AbortMatch // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776875360
};

// Class Engine.GameStateBase
// Size : 0x270 (Inherited : 0x220)
struct AGameStateBase : AInfo {
	class AGameModeBase* GameModeClass; // 0x220(0x8)
	struct AGameModeBase* AuthorityGameMode; // 0x228(0x8)
	class ASpectatorPawn* SpectatorClass; // 0x230(0x8)
	struct TArray<struct APlayerState*> PlayerArray; // 0x238(0x10)
	bool bReplicatedHasBegunPlay; // 0x248(0x1)
	unsigned char UnknownData_249[0x0003]; // 0x249(0x3)
	float ReplicatedWorldTimeSeconds; // 0x24C(0x4)
	float ServerWorldTimeSecondsDelta; // 0x250(0x4)
	float ServerWorldTimeSecondsUpdateFrequency; // 0x254(0x4)
	unsigned char UnknownData_258[0x0018]; // 0x258(0x18)

	void OnRep_SpectatorClass(); // Function Engine.GameStateBase.OnRep_SpectatorClass // (Native|Protected) // Param Size : 0x0, 0x7FF7768838B0
	void OnRep_ReplicatedWorldTimeSeconds(); // Function Engine.GameStateBase.OnRep_ReplicatedWorldTimeSeconds // (Native|Protected) // Param Size : 0x0, 0x7FF776883890
	void OnRep_ReplicatedHasBegunPlay(); // Function Engine.GameStateBase.OnRep_ReplicatedHasBegunPlay // (Native|Protected) // Param Size : 0x0, 0x7FF776883870
	void OnRep_GameModeClass(); // Function Engine.GameStateBase.OnRep_GameModeClass // (Native|Protected) // Param Size : 0x0, 0x7FF77685CCE0
	bool HasMatchStarted(); // Function Engine.GameStateBase.HasMatchStarted // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776883630
	bool HasBegunPlay(); // Function Engine.GameStateBase.HasBegunPlay // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776883600
	float GetServerWorldTimeSeconds(); // Function Engine.GameStateBase.GetServerWorldTimeSeconds // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF7768834A0
	float GetPlayerStartTime(struct AController* Controller); // Function Engine.GameStateBase.GetPlayerStartTime // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776882FB0
	float GetPlayerRespawnDelay(struct AController* Controller); // Function Engine.GameStateBase.GetPlayerRespawnDelay // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776882F10
};

// Class Engine.GameState
// Size : 0x290 (Inherited : 0x270)
struct AGameState : AGameStateBase {
	struct FName MatchState; // 0x270(0x8)
	struct FName PreviousMatchState; // 0x278(0x8)
	int32_t ElapsedTime; // 0x280(0x4)
	unsigned char UnknownData_284[0x000C]; // 0x284(0xC)

	void OnRep_MatchState(); // Function Engine.GameState.OnRep_MatchState // (Native|Public) // Param Size : 0x0, 0x7FF77687D070
	void OnRep_ElapsedTime(); // Function Engine.GameState.OnRep_ElapsedTime // (Native|Public) // Param Size : 0x0, 0x7FF77687D330
};

// Class Engine.Controller
// Size : 0x298 (Inherited : 0x220)
struct AController : AActor {
	unsigned char UnknownData_220[0x0008]; // 0x220(0x8)
	struct APlayerState* PlayerState; // 0x228(0x8)
	unsigned char UnknownData_230[0x0008]; // 0x230(0x8)
	struct FMulticastInlineDelegate OnInstigatedAnyDamage; // 0x238(0x10)
	struct FName StateName; // 0x248(0x8)
	struct APawn* Pawn; // 0x250(0x8)
	unsigned char UnknownData_258[0x0008]; // 0x258(0x8)
	struct ACharacter* Character; // 0x260(0x8)
	struct USceneComponent* TransformComponent; // 0x268(0x8)
	unsigned char UnknownData_270[0x0018]; // 0x270(0x18)
	struct FRotator ControlRotation; // 0x288(0xC)
	unsigned char bAttachToPawn : 1; // 0x294(0x1)
	unsigned char UnknownData_294_1 : 7; // 0x294(0x1)
	unsigned char UnknownData_295[0x0003]; // 0x295(0x3)

	void UnPossess(); // Function Engine.Controller.UnPossess // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF77685D0A0
	void StopMovement(); // Function Engine.Controller.StopMovement // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF77685D080
	void SetInitialLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation); // Function Engine.Controller.SetInitialLocationAndRotation // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x18, 0x7FF77685CF90
	void SetIgnoreMoveInput(bool bNewMoveInput); // Function Engine.Controller.SetIgnoreMoveInput // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77685CF00
	void SetIgnoreLookInput(bool bNewLookInput); // Function Engine.Controller.SetIgnoreLookInput // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77685CE70
	void SetControlRotation(struct FRotator NewRotation); // Function Engine.Controller.SetControlRotation // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xC, 0x7FF77685CDE0
	void ResetIgnoreMoveInput(); // Function Engine.Controller.ResetIgnoreMoveInput // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF77685CDC0
	void ResetIgnoreLookInput(); // Function Engine.Controller.ResetIgnoreLookInput // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF77685CDA0
	void ResetIgnoreInputFlags(); // Function Engine.Controller.ResetIgnoreInputFlags // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF77685CD80
	void ReceiveUnPossess(struct APawn* UnpossessedPawn); // Function Engine.Controller.ReceiveUnPossess // (Event|Protected|BlueprintEvent) // Param Size : 0x8, 0x7FF77510D9D0
	void ReceivePossess(struct APawn* PossessedPawn); // Function Engine.Controller.ReceivePossess // (Event|Protected|BlueprintEvent) // Param Size : 0x8, 0x7FF77510D9D0
	void ReceiveInstigatedAnyDamage(float Damage, struct UDamageType* DamageType, struct AActor* DamagedActor, struct AActor* DamageCauser); // Function Engine.Controller.ReceiveInstigatedAnyDamage // (BlueprintAuthorityOnly|Event|Protected|BlueprintEvent) // Param Size : 0x20, 0x7FF77510D9D0
	void Possess(struct APawn* InPawn); // Function Engine.Controller.Possess // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF77685CD00
	void OnRep_PlayerState(); // Function Engine.Controller.OnRep_PlayerState // (Native|Public) // Param Size : 0x0, 0x7FF77685CCE0
	void OnRep_Pawn(); // Function Engine.Controller.OnRep_Pawn // (Native|Public) // Param Size : 0x0, 0x7FF774D2A800
	bool LineOfSightTo(struct AActor* Other, struct FVector ViewPoint, bool bAlternateChecks); // Function Engine.Controller.LineOfSightTo // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x16, 0x7FF77685CBC0
	struct APawn* K2_GetPawn(); // Function Engine.Controller.K2_GetPawn // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF77685CB90
	bool IsPlayerController(); // Function Engine.Controller.IsPlayerController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77685CB60
	bool IsMoveInputIgnored(); // Function Engine.Controller.IsMoveInputIgnored // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77685CB30
	bool IsLookInputIgnored(); // Function Engine.Controller.IsLookInputIgnored // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77685CB00
	bool IsLocalPlayerController(); // Function Engine.Controller.IsLocalPlayerController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77685CAB0
	bool IsLocalController(); // Function Engine.Controller.IsLocalController // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77685CA80
	struct AActor* GetViewTarget(); // Function Engine.Controller.GetViewTarget // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF77685CA50
	struct FRotator GetDesiredRotation(); // Function Engine.Controller.GetDesiredRotation // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF77685C680
	struct FRotator GetControlRotation(); // Function Engine.Controller.GetControlRotation // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF77685C410
	void ClientSetRotation(struct FRotator NewRotation, bool bResetCamera); // Function Engine.Controller.ClientSetRotation // (Net|NetReliable|Native|Event|Public|HasDefaults|NetClient) // Param Size : 0xD, 0x7FF77685C250
	void ClientSetLocation(struct FVector NewLocation, struct FRotator NewRotation); // Function Engine.Controller.ClientSetLocation // (Net|NetReliable|Native|Event|Public|HasDefaults|NetClient) // Param Size : 0x18, 0x7FF77685C170
	struct APlayerController* CastToPlayerController(); // Function Engine.Controller.CastToPlayerController // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF77685C140
};

// Class Engine.PlayerController
// Size : 0x570 (Inherited : 0x298)
struct APlayerController : AController {
	struct UPlayer* Player; // 0x298(0x8)
	struct APawn* AcknowledgedPawn; // 0x2A0(0x8)
	struct UInterpTrackInstDirector* ControllingDirTrackInst; // 0x2A8(0x8)
	struct AHUD* MyHUD; // 0x2B0(0x8)
	struct APlayerCameraManager* PlayerCameraManager; // 0x2B8(0x8)
	class APlayerCameraManager* PlayerCameraManagerClass; // 0x2C0(0x8)
	bool bAutoManageActiveCameraTarget; // 0x2C8(0x1)
	unsigned char UnknownData_2C9[0x0003]; // 0x2C9(0x3)
	struct FRotator TargetViewRotation; // 0x2CC(0xC)
	unsigned char UnknownData_2D8[0x000C]; // 0x2D8(0xC)
	float SmoothTargetViewRotationSpeed; // 0x2E4(0x4)
	unsigned char UnknownData_2E8[0x0008]; // 0x2E8(0x8)
	struct TArray<struct AActor*> HiddenActors; // 0x2F0(0x10)
	struct TArray<struct FWeakObjectPtr<struct UPrimitiveComponent>> HiddenPrimitiveComponents; // 0x300(0x10)
	unsigned char UnknownData_310[0x0004]; // 0x310(0x4)
	float LastSpectatorStateSynchTime; // 0x314(0x4)
	struct FVector LastSpectatorSyncLocation; // 0x318(0xC)
	struct FRotator LastSpectatorSyncRotation; // 0x324(0xC)
	int32_t ClientCap; // 0x330(0x4)
	unsigned char UnknownData_334[0x0004]; // 0x334(0x4)
	struct UCheatManager* CheatManager; // 0x338(0x8)
	class UCheatManager* CheatClass; // 0x340(0x8)
	struct UPlayerInput* PlayerInput; // 0x348(0x8)
	struct TArray<struct FActiveForceFeedbackEffect> ActiveForceFeedbackEffects; // 0x350(0x10)
	unsigned char UnknownData_360[0x0070]; // 0x360(0x70)
	unsigned char UnknownData_3D0_0 : 4; // 0x3D0(0x1)
	unsigned char bPlayerIsWaiting : 1; // 0x3D0(0x1)
	unsigned char UnknownData_3D0_5 : 3; // 0x3D0(0x1)
	unsigned char UnknownData_3D1[0x0003]; // 0x3D1(0x3)
	enum class None NetPlayerIndex; // 0x3D4(0x1)
	unsigned char UnknownData_3D5[0x003B]; // 0x3D5(0x3B)
	struct UNetConnection* PendingSwapConnection; // 0x410(0x8)
	struct UNetConnection* NetConnection; // 0x418(0x8)
	unsigned char UnknownData_420[0x000C]; // 0x420(0xC)
	float InputYawScale; // 0x42C(0x4)
	float InputPitchScale; // 0x430(0x4)
	float InputRollScale; // 0x434(0x4)
	unsigned char bShowMouseCursor : 1; // 0x438(0x1)
	unsigned char bEnableClickEvents : 1; // 0x438(0x1)
	unsigned char bEnableTouchEvents : 1; // 0x438(0x1)
	unsigned char bEnableMouseOverEvents : 1; // 0x438(0x1)
	unsigned char bEnableTouchOverEvents : 1; // 0x438(0x1)
	unsigned char bForceFeedbackEnabled : 1; // 0x438(0x1)
	unsigned char UnknownData_438_6 : 2; // 0x438(0x1)
	unsigned char UnknownData_439[0x0003]; // 0x439(0x3)
	float ForceFeedbackScale; // 0x43C(0x4)
	struct TArray<struct FKey> ClickEventKeys; // 0x440(0x10)
	enum class EMouseCursor DefaultMouseCursor; // 0x450(0x1)
	enum class EMouseCursor CurrentMouseCursor; // 0x451(0x1)
	enum class ECollisionChannel DefaultClickTraceChannel; // 0x452(0x1)
	enum class ECollisionChannel CurrentClickTraceChannel; // 0x453(0x1)
	float HitResultTraceDistance; // 0x454(0x4)
	uint16 SeamlessTravelCount; // 0x458(0x2)
	uint16 LastCompletedSeamlessTravelCount; // 0x45A(0x2)
	unsigned char UnknownData_45C[0x0074]; // 0x45C(0x74)
	struct UInputComponent* InactiveStateInputComponent; // 0x4D0(0x8)
	unsigned char UnknownData_4D8_0 : 2; // 0x4D8(0x1)
	unsigned char bShouldPerformFullTickWhenPaused : 1; // 0x4D8(0x1)
	unsigned char UnknownData_4D8_3 : 5; // 0x4D8(0x1)
	unsigned char UnknownData_4D9[0x0017]; // 0x4D9(0x17)
	struct UTouchInterface* CurrentTouchInterface; // 0x4F0(0x8)
	unsigned char UnknownData_4F8[0x0050]; // 0x4F8(0x50)
	struct ASpectatorPawn* SpectatorPawn; // 0x548(0x8)
	unsigned char UnknownData_550[0x0004]; // 0x550(0x4)
	bool bIsLocalPlayerController; // 0x554(0x1)
	unsigned char UnknownData_555[0x0003]; // 0x555(0x3)
	struct FVector SpawnLocation; // 0x558(0xC)
	unsigned char UnknownData_564[0x000C]; // 0x564(0xC)

	bool WasInputKeyJustReleased(struct FKey Key); // Function Engine.PlayerController.WasInputKeyJustReleased // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x19, 0x7FF776935100
	bool WasInputKeyJustPressed(struct FKey Key); // Function Engine.PlayerController.WasInputKeyJustPressed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x19, 0x7FF776935010
	void ToggleSpeaking(bool bInSpeaking); // Function Engine.PlayerController.ToggleSpeaking // (Exec|Native|Public) // Param Size : 0x1, 0x7FF776934F80
	void TestServerLevelVisibilityChange(struct FName PackageName, struct FName Filename); // Function Engine.PlayerController.TestServerLevelVisibilityChange // (Final|Exec|Native|Private) // Param Size : 0x10, 0x7FF776934EC0
	void SwitchLevel(struct FString URL); // Function Engine.PlayerController.SwitchLevel // (Exec|Native|Public) // Param Size : 0x10, 0x7FF776934E20
	void StopHapticEffect(enum class EControllerHand hand); // Function Engine.PlayerController.StopHapticEffect // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776934DA0
	void StartFire(enum class None FireModeNum); // Function Engine.PlayerController.StartFire // (Exec|Native|Public) // Param Size : 0x1, 0x7FF7769347D0
	void SetVirtualJoystickVisibility(bool bVisible); // Function Engine.PlayerController.SetVirtualJoystickVisibility // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776934570
	void SetViewTargetWithBlend(struct AActor* NewViewTarget, float BlendTime, enum class EViewTargetBlendFunction BlendFunc, float BlendExp, bool bLockOutgoing); // Function Engine.PlayerController.SetViewTargetWithBlend // (Native|Public|BlueprintCallable) // Param Size : 0x15, 0x7FF7769343F0
	void SetName(struct FString S); // Function Engine.PlayerController.SetName // (Exec|Native|Public) // Param Size : 0x10, 0x7FF776934350
	void SetMouseLocation(int32_t X, int32_t Y); // Function Engine.PlayerController.SetMouseLocation // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF776934290
	void SetMouseCursorWidget(enum class EMouseCursor Cursor, struct UUserWidget* CursorWidget); // Function Engine.PlayerController.SetMouseCursorWidget // (Final|Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF7769341D0
	void SetHapticsByValue(float Frequency, float Amplitude, enum class EControllerHand hand); // Function Engine.PlayerController.SetHapticsByValue // (Final|Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF776933FB0
	void SetDisableHaptics(bool bNewDisabled); // Function Engine.PlayerController.SetDisableHaptics // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776933F00
	void SetControllerLightColor(struct FColor Color); // Function Engine.PlayerController.SetControllerLightColor // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x4, 0x7FF776933E90
	void SetCinematicMode(bool bInCinematicMode, bool bHidePlayer, bool bAffectsHUD, bool bAffectsMovement, bool bAffectsTurning); // Function Engine.PlayerController.SetCinematicMode // (Native|Public|BlueprintCallable) // Param Size : 0x5, 0x7FF776933CD0
	void SetAudioListenerOverride(struct USceneComponent* AttachToComponent, struct FVector Location, struct FRotator Rotation); // Function Engine.PlayerController.SetAudioListenerOverride // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x20, 0x7FF776933BB0
	void SetAudioListenerAttenuationOverride(struct USceneComponent* AttachToComponent, struct FVector AttenuationLocationOVerride); // Function Engine.PlayerController.SetAudioListenerAttenuationOverride // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x14, 0x7FF776933AE0
	void ServerViewSelf(struct FViewTargetTransitionParams TransitionParams); // Function Engine.PlayerController.ServerViewSelf // (Net|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x10, 0x7FF7769339F0
	void ServerViewPrevPlayer(); // Function Engine.PlayerController.ServerViewPrevPlayer // (Net|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x0, 0x7FF7769339A0
	void ServerViewNextPlayer(); // Function Engine.PlayerController.ServerViewNextPlayer // (Net|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x0, 0x7FF776933950
	void ServerVerifyViewTarget(); // Function Engine.PlayerController.ServerVerifyViewTarget // (Net|NetReliable|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x0, 0x7FF776933900
	void ServerUpdateMultipleLevelsVisibility(struct TArray<struct FUpdateLevelVisibilityLevelInfo> LevelVisibilities); // Function Engine.PlayerController.ServerUpdateMultipleLevelsVisibility // (Final|Net|NetReliable|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x10, 0x7FF776933840
	void ServerUpdateLevelVisibility(struct FUpdateLevelVisibilityLevelInfo LevelVisibility); // Function Engine.PlayerController.ServerUpdateLevelVisibility // (Final|Net|NetReliable|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x14, 0x7FF776933780
	void ServerUpdateCamera(struct FVector_NetQuantize CamLoc, int32_t CamPitchAndYaw); // Function Engine.PlayerController.ServerUpdateCamera // (Net|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x10, 0x7FF776933660
	void ServerUnmutePlayer(struct FUniqueNetIdRepl PlayerId); // Function Engine.PlayerController.ServerUnmutePlayer // (Net|NetReliable|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x28, 0x7FF776933500
	void ServerToggleAILogging(); // Function Engine.PlayerController.ServerToggleAILogging // (Net|NetReliable|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x0, 0x7FF7769334B0
	void ServerShortTimeout(); // Function Engine.PlayerController.ServerShortTimeout // (Net|NetReliable|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x0, 0x7FF776933460
	void ServerSetSpectatorWaiting(bool bWaiting); // Function Engine.PlayerController.ServerSetSpectatorWaiting // (Net|NetReliable|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x1, 0x7FF7769333A0
	void ServerSetSpectatorLocation(struct FVector NewLoc, struct FRotator NewRot); // Function Engine.PlayerController.ServerSetSpectatorLocation // (Net|Native|Event|Public|NetServer|HasDefaults|NetValidate) // Param Size : 0x18, 0x7FF776933270
	void ServerRestartPlayer(); // Function Engine.PlayerController.ServerRestartPlayer // (Net|NetReliable|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x0, 0x7FF776933220
	void ServerPause(); // Function Engine.PlayerController.ServerPause // (Net|NetReliable|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x0, 0x7FF7769331D0
	void ServerNotifyLoadedWorld(struct FName WorldPackageName); // Function Engine.PlayerController.ServerNotifyLoadedWorld // (Final|Net|NetReliable|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x8, 0x7FF776933120
	void ServerMutePlayer(struct FUniqueNetIdRepl PlayerId); // Function Engine.PlayerController.ServerMutePlayer // (Net|NetReliable|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x28, 0x7FF776932FC0
	void ServerExecRPC(struct FString Msg); // Function Engine.PlayerController.ServerExecRPC // (Net|NetReliable|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x10, 0x7FF776932F00
	void ServerExec(struct FString Msg); // Function Engine.PlayerController.ServerExec // (Final|Exec|Native|Public) // Param Size : 0x10, 0x7FF776932E60
	void ServerCheckClientPossessionReliable(); // Function Engine.PlayerController.ServerCheckClientPossessionReliable // (Net|NetReliable|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x0, 0x7FF776932E10
	void ServerCheckClientPossession(); // Function Engine.PlayerController.ServerCheckClientPossession // (Net|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x0, 0x7FF776932DC0
	void ServerChangeName(struct FString S); // Function Engine.PlayerController.ServerChangeName // (Net|NetReliable|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x10, 0x7FF776932D00
	void ServerCamera(struct FName NewMode); // Function Engine.PlayerController.ServerCamera // (Net|NetReliable|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x8, 0x7FF776932C40
	void ServerAcknowledgePossession(struct APawn* P); // Function Engine.PlayerController.ServerAcknowledgePossession // (Net|NetReliable|Native|Event|Public|NetServer|NetValidate) // Param Size : 0x8, 0x7FF776932B80
	void SendToConsole(struct FString Command); // Function Engine.PlayerController.SendToConsole // (Exec|Native|Public) // Param Size : 0x10, 0x7FF776932AE0
	void RestartLevel(); // Function Engine.PlayerController.RestartLevel // (Exec|Native|Public) // Param Size : 0x0, 0x7FF776932AC0
	void ResetControllerLightColor(); // Function Engine.PlayerController.ResetControllerLightColor // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776932AA0
	bool ProjectWorldLocationToScreen(struct FVector WorldLocation, struct FVector2D ScreenLocation, bool bPlayerViewportRelative); // Function Engine.PlayerController.ProjectWorldLocationToScreen // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x16, 0x7FF7769328D0
	void PlayHapticEffect(struct UHapticFeedbackEffect_Base* HapticEffect, enum class EControllerHand hand, float Scale, bool bLoop); // Function Engine.PlayerController.PlayHapticEffect // (Final|Native|Public|BlueprintCallable) // Param Size : 0x11, 0x7FF776932780
	void PlayDynamicForceFeedback(float Intensity, float Duration, bool bAffectsLeftLarge, bool bAffectsLeftSmall, bool bAffectsRightLarge, bool bAffectsRightSmall, enum class EDynamicForceFeedbackAction Action, struct FLatentActionInfo LatentInfo); // Function Engine.PlayerController.PlayDynamicForceFeedback // (Final|Native|Private|BlueprintCallable) // Param Size : 0x28, 0x7FF776932500
	void Pause(); // Function Engine.PlayerController.Pause // (Exec|Native|Public) // Param Size : 0x0, 0x7FF776931E40
	void OnServerStartedVisualLogger(bool bIsLogging); // Function Engine.PlayerController.OnServerStartedVisualLogger // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x1, 0x7FF776931DB0
	void LocalTravel(struct FString URL); // Function Engine.PlayerController.LocalTravel // (Exec|Native|Public) // Param Size : 0x10, 0x7FF776931D10
	void K2_ClientPlayForceFeedback(struct UForceFeedbackEffect* ForceFeedbackEffect, struct FName Tag, bool bLooping, bool bIgnoreTimeDilation, bool bPlayWhilePaused); // Function Engine.PlayerController.K2_ClientPlayForceFeedback // (Final|Native|Public|BlueprintCallable) // Param Size : 0x13, 0x7FF776931B60
	bool IsInputKeyDown(struct FKey Key); // Function Engine.PlayerController.IsInputKeyDown // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x19, 0x7FF776931A70
	void GetViewportSize(int32_t SizeX, int32_t SizeY); // Function Engine.PlayerController.GetViewportSize // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776931990
	struct ASpectatorPawn* GetSpectatorPawn(); // Function Engine.PlayerController.GetSpectatorPawn // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776931970
	bool GetMousePosition(float LocationX, float LocationY); // Function Engine.PlayerController.GetMousePosition // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x9, 0x7FF776931850
	struct FVector GetInputVectorKeyState(struct FKey Key); // Function Engine.PlayerController.GetInputVectorKeyState // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x24, 0x7FF776931750
	void GetInputTouchState(enum class ETouchIndex FingerIndex, float LocationX, float LocationY, bool bIsCurrentlyPressed); // Function Engine.PlayerController.GetInputTouchState // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xD, 0x7FF7769315D0
	void GetInputMouseDelta(float DeltaX, float DeltaY); // Function Engine.PlayerController.GetInputMouseDelta // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF7769314F0
	void GetInputMotionState(struct FVector Tilt, struct FVector RotationRate, struct FVector Gravity, struct FVector Acceleration); // Function Engine.PlayerController.GetInputMotionState // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x30, 0x7FF776931360
	float GetInputKeyTimeDown(struct FKey Key); // Function Engine.PlayerController.GetInputKeyTimeDown // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1C, 0x7FF776931270
	void GetInputAnalogStickState(enum class EControllerAnalogStick WhichStick, float StickX, float StickY); // Function Engine.PlayerController.GetInputAnalogStickState // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776931150
	float GetInputAnalogKeyState(struct FKey Key); // Function Engine.PlayerController.GetInputAnalogKeyState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1C, 0x7FF776931060
	struct AHUD* GetHUD(); // Function Engine.PlayerController.GetHUD // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF7769304A0
	bool GetHitResultUnderFingerForObjects(enum class ETouchIndex FingerIndex, struct TArray<enum class EObjectTypeQuery> ObjectTypes, bool bTraceComplex, struct FHitResult HitResult); // Function Engine.PlayerController.GetHitResultUnderFingerForObjects // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xA5, 0x7FF776930EA0
	bool GetHitResultUnderFingerByChannel(enum class ETouchIndex FingerIndex, enum class ETraceTypeQuery TraceChannel, bool bTraceComplex, struct FHitResult HitResult); // Function Engine.PlayerController.GetHitResultUnderFingerByChannel // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8D, 0x7FF776930D00
	bool GetHitResultUnderFinger(enum class ETouchIndex FingerIndex, enum class ECollisionChannel TraceChannel, bool bTraceComplex, struct FHitResult HitResult); // Function Engine.PlayerController.GetHitResultUnderFinger // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8D, 0x7FF776930B60
	bool GetHitResultUnderCursorForObjects(struct TArray<enum class EObjectTypeQuery> ObjectTypes, bool bTraceComplex, struct FHitResult HitResult); // Function Engine.PlayerController.GetHitResultUnderCursorForObjects // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x9D, 0x7FF7769309E0
	bool GetHitResultUnderCursorByChannel(enum class ETraceTypeQuery TraceChannel, bool bTraceComplex, struct FHitResult HitResult); // Function Engine.PlayerController.GetHitResultUnderCursorByChannel // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8D, 0x7FF776930880
	bool GetHitResultUnderCursor(enum class ECollisionChannel TraceChannel, bool bTraceComplex, struct FHitResult HitResult); // Function Engine.PlayerController.GetHitResultUnderCursor // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8D, 0x7FF776930720
	struct FVector GetFocalLocation(); // Function Engine.PlayerController.GetFocalLocation // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776930460
	void FOV(float NewFOV); // Function Engine.PlayerController.FOV // (Exec|Native|Public) // Param Size : 0x4, 0x7FF776930280
	void EnableCheats(); // Function Engine.PlayerController.EnableCheats // (Exec|Native|Public) // Param Size : 0x0, 0x7FF776930260
	bool DeprojectScreenPositionToWorld(float ScreenX, float ScreenY, struct FVector WorldLocation, struct FVector WorldDirection); // Function Engine.PlayerController.DeprojectScreenPositionToWorld // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x21, 0x7FF7769300E0
	bool DeprojectMousePositionToWorld(struct FVector WorldLocation, struct FVector WorldDirection); // Function Engine.PlayerController.DeprojectMousePositionToWorld // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x19, 0x7FF77692FFE0
	void ConsoleKey(struct FKey Key); // Function Engine.PlayerController.ConsoleKey // (Exec|Native|Public) // Param Size : 0x18, 0x7FF77692FF00
	void ClientWasKicked(struct FText KickReason); // Function Engine.PlayerController.ClientWasKicked // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x18, 0x7FF77692FE40
	void ClientVoiceHandshakeComplete(); // Function Engine.PlayerController.ClientVoiceHandshakeComplete // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x0, 0x7FF77692FE20
	void ClientUpdateMultipleLevelsStreamingStatus(struct TArray<struct FUpdateLevelStreamingLevelStatus> LevelStatuses); // Function Engine.PlayerController.ClientUpdateMultipleLevelsStreamingStatus // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x10, 0x7FF77692FD80
	void ClientUpdateLevelStreamingStatus(struct FName PackageName, bool bNewShouldBeLoaded, bool bNewShouldBeVisible, bool bNewShouldBlockOnLoad, int32_t LODIndex); // Function Engine.PlayerController.ClientUpdateLevelStreamingStatus // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x10, 0x7FF77692FBD0
	void ClientUnmutePlayer(struct FUniqueNetIdRepl PlayerId); // Function Engine.PlayerController.ClientUnmutePlayer // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x28, 0x7FF77692FAB0
	void ClientTravelInternal(struct FString URL, enum class ETravelType TravelType, bool bSeamless, struct FGuid MapPackageGuid); // Function Engine.PlayerController.ClientTravelInternal // (Net|NetReliable|Native|Event|Public|HasDefaults|NetClient) // Param Size : 0x24, 0x7FF77692F940
	void ClientTravel(struct FString URL, enum class ETravelType TravelType, bool bSeamless, struct FGuid MapPackageGuid); // Function Engine.PlayerController.ClientTravel // (Final|Native|Public|HasDefaults) // Param Size : 0x24, 0x7FF77692F7D0
	void ClientTeamMessage(struct APlayerState* SenderPlayerState, struct FString S, struct FName Type, float MsgLifeTime); // Function Engine.PlayerController.ClientTeamMessage // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x24, 0x7FF77692F670
	void ClientStopForceFeedback(struct UForceFeedbackEffect* ForceFeedbackEffect, struct FName Tag); // Function Engine.PlayerController.ClientStopForceFeedback // (Net|NetReliable|Native|Event|Public|NetClient|BlueprintCallable) // Param Size : 0x10, 0x7FF77692F5A0
	void ClientStopCameraShakesFromSource(struct UCameraShakeSourceComponent* SourceComponent, bool bImmediately); // Function Engine.PlayerController.ClientStopCameraShakesFromSource // (Final|Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF77692F4D0
	void ClientStopCameraShake(class UCameraShake* Shake, bool bImmediately); // Function Engine.PlayerController.ClientStopCameraShake // (Net|NetReliable|Native|Event|Public|NetClient|BlueprintCallable) // Param Size : 0x9, 0x7FF77692F400
	void ClientStopCameraAnim(struct UCameraAnim* AnimToStop); // Function Engine.PlayerController.ClientStopCameraAnim // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x8, 0x7FF775FE0280
	void ClientStartOnlineSession(); // Function Engine.PlayerController.ClientStartOnlineSession // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x0, 0x7FF77692F3E0
	void ClientSpawnCameraLensEffect(class AEmitterCameraLensEffectBase* LensEffectEmitterClass); // Function Engine.PlayerController.ClientSpawnCameraLensEffect // (Net|Native|Event|Public|NetClient|BlueprintCallable) // Param Size : 0x8, 0x7FF77692F350
	void ClientSetViewTarget(struct AActor* A, struct FViewTargetTransitionParams TransitionParams); // Function Engine.PlayerController.ClientSetViewTarget // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x18, 0x7FF77692F260
	void ClientSetSpectatorWaiting(bool bWaiting); // Function Engine.PlayerController.ClientSetSpectatorWaiting // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x1, 0x7FF77692F1D0
	void ClientSetHUD(class AHUD* NewHUDClass); // Function Engine.PlayerController.ClientSetHUD // (Net|NetReliable|Native|Event|Public|NetClient|BlueprintCallable) // Param Size : 0x8, 0x7FF77692F140
	void ClientSetForceMipLevelsToBeResident(struct UMaterialInterface* Material, float ForceDuration, int32_t CinematicTextureGroups); // Function Engine.PlayerController.ClientSetForceMipLevelsToBeResident // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x10, 0x7FF77692F040
	void ClientSetCinematicMode(bool bInCinematicMode, bool bAffectsMovement, bool bAffectsTurning, bool bAffectsHUD); // Function Engine.PlayerController.ClientSetCinematicMode // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x4, 0x7FF77692EED0
	void ClientSetCameraMode(struct FName NewCamMode); // Function Engine.PlayerController.ClientSetCameraMode // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x8, 0x7FF77692EE40
	void ClientSetCameraFade(bool bEnableFading, struct FColor FadeColor, struct FVector2D FadeAlpha, float FadeTime, bool bFadeAudio); // Function Engine.PlayerController.ClientSetCameraFade // (Net|NetReliable|Native|Event|Public|HasDefaults|NetClient) // Param Size : 0x15, 0x7FF77692ECB0
	void ClientSetBlockOnAsyncLoading(); // Function Engine.PlayerController.ClientSetBlockOnAsyncLoading // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x0, 0x7FF774C2FEB0
	void ClientReturnToMainMenuWithTextReason(struct FText ReturnReason); // Function Engine.PlayerController.ClientReturnToMainMenuWithTextReason // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x18, 0x7FF77692EBF0
	void ClientReturnToMainMenu(struct FString ReturnReason); // Function Engine.PlayerController.ClientReturnToMainMenu // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x10, 0x7FF77692EB50
	void ClientRetryClientRestart(struct APawn* NewPawn); // Function Engine.PlayerController.ClientRetryClientRestart // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x8, 0x7FF77692EAC0
	void ClientRestart(struct APawn* NewPawn); // Function Engine.PlayerController.ClientRestart // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x8, 0x7FF77692EA30
	void ClientReset(); // Function Engine.PlayerController.ClientReset // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x0, 0x7FF77692EA10
	void ClientRepObjRef(struct UObject* Object); // Function Engine.PlayerController.ClientRepObjRef // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x8, 0x7FF77692E980
	void ClientReceiveLocalizedMessage(class ULocalMessage* Message, int32_t Switch, struct APlayerState* RelatedPlayerState_2, struct APlayerState* RelatedPlayerState_3, struct UObject* OptionalObject); // Function Engine.PlayerController.ClientReceiveLocalizedMessage // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x28, 0x7FF77692E800
	void ClientPrestreamTextures(struct AActor* ForcedActor, float ForceDuration, bool bEnableStreaming, int32_t CinematicTextureGroups); // Function Engine.PlayerController.ClientPrestreamTextures // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x14, 0x7FF77692E6B0
	void ClientPrepareMapChange(struct FName LevelName, bool bFirst, bool bLast); // Function Engine.PlayerController.ClientPrepareMapChange // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0xA, 0x7FF77692E5A0
	void ClientPlaySoundAtLocation(struct USoundBase* Sound, struct FVector Location, float VolumeMultiplier, float PitchMultiplier); // Function Engine.PlayerController.ClientPlaySoundAtLocation // (Net|Native|Event|Public|HasDefaults|NetClient) // Param Size : 0x1C, 0x7FF77692E450
	void ClientPlaySound(struct USoundBase* Sound, float VolumeMultiplier, float PitchMultiplier); // Function Engine.PlayerController.ClientPlaySound // (Net|Native|Event|Public|NetClient) // Param Size : 0x10, 0x7FF77692E350
	void ClientPlayForceFeedback_Internal(struct UForceFeedbackEffect* ForceFeedbackEffect, struct FForceFeedbackParameters Params); // Function Engine.PlayerController.ClientPlayForceFeedback_Internal // (Final|Net|Native|Event|Private|NetClient) // Param Size : 0x14, 0x7FF77692E260
	void ClientPlayCameraShakeFromSource(class UCameraShake* Shake, struct UCameraShakeSourceComponent* SourceComponent); // Function Engine.PlayerController.ClientPlayCameraShakeFromSource // (Final|Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF77692E1A0
	void ClientPlayCameraShake(class UCameraShake* Shake, float Scale, enum class ECameraAnimPlaySpace PlaySpace, struct FRotator UserPlaySpaceRot); // Function Engine.PlayerController.ClientPlayCameraShake // (Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable) // Param Size : 0x1C, 0x7FF77692E040
	void ClientPlayCameraAnim(struct UCameraAnim* AnimToPlay, float Scale, float Rate, float BlendInTime, float BlendOutTime, bool bLoop, bool bRandomStartTime, enum class ECameraAnimPlaySpace Space, struct FRotator CustomPlaySpace); // Function Engine.PlayerController.ClientPlayCameraAnim // (Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable) // Param Size : 0x28, 0x7FF77692DDA0
	void ClientMutePlayer(struct FUniqueNetIdRepl PlayerId); // Function Engine.PlayerController.ClientMutePlayer // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x28, 0x7FF77692DC80
	void ClientMessage(struct FString S, struct FName Type, float MsgLifeTime); // Function Engine.PlayerController.ClientMessage // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x1C, 0x7FF77692DB60
	void ClientIgnoreMoveInput(bool bIgnore); // Function Engine.PlayerController.ClientIgnoreMoveInput // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x1, 0x7FF77692DAD0
	void ClientIgnoreLookInput(bool bIgnore); // Function Engine.PlayerController.ClientIgnoreLookInput // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x1, 0x7FF77692DA40
	void ClientGotoState(struct FName NewState); // Function Engine.PlayerController.ClientGotoState // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x8, 0x7FF77692D9B0
	void ClientGameEnded(struct AActor* EndGameFocus, bool bIsWinner); // Function Engine.PlayerController.ClientGameEnded // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x9, 0x7FF77692D8E0
	void ClientForceGarbageCollection(); // Function Engine.PlayerController.ClientForceGarbageCollection // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x0, 0x7FF77692D8C0
	void ClientFlushLevelStreaming(); // Function Engine.PlayerController.ClientFlushLevelStreaming // (Final|Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x0, 0x7FF77692D8A0
	void ClientEndOnlineSession(); // Function Engine.PlayerController.ClientEndOnlineSession // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x0, 0x7FF77692D880
	void ClientEnableNetworkVoice(bool bEnable); // Function Engine.PlayerController.ClientEnableNetworkVoice // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x1, 0x7FF77692D7F0
	void ClientCommitMapChange(); // Function Engine.PlayerController.ClientCommitMapChange // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x0, 0x7FF77692D7D0
	void ClientClearCameraLensEffects(); // Function Engine.PlayerController.ClientClearCameraLensEffects // (Net|NetReliable|Native|Event|Public|NetClient|BlueprintCallable) // Param Size : 0x0, 0x7FF77692D7B0
	void ClientCapBandwidth(int32_t Cap); // Function Engine.PlayerController.ClientCapBandwidth // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x4, 0x7FF77692D720
	void ClientCancelPendingMapChange(); // Function Engine.PlayerController.ClientCancelPendingMapChange // (Net|NetReliable|Native|Event|Public|NetClient) // Param Size : 0x0, 0x7FF77692D700
	void ClientAddTextureStreamingLoc(struct FVector InLoc, float Duration, bool bOverrideLocation); // Function Engine.PlayerController.ClientAddTextureStreamingLoc // (Final|Net|NetReliable|Native|Event|Public|HasDefaults|NetClient) // Param Size : 0x11, 0x7FF77692D5E0
	void ClearAudioListenerOverride(); // Function Engine.PlayerController.ClearAudioListenerOverride // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF77692D5C0
	void ClearAudioListenerAttenuationOverride(); // Function Engine.PlayerController.ClearAudioListenerAttenuationOverride // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF77692D5A0
	bool CanRestartPlayer(); // Function Engine.PlayerController.CanRestartPlayer // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77692D570
	void Camera(struct FName NewMode); // Function Engine.PlayerController.Camera // (Exec|Native|Public) // Param Size : 0x8, 0x7FF77692D4E0
	void AddYawInput(float Val); // Function Engine.PlayerController.AddYawInput // (Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77692D460
	void AddRollInput(float Val); // Function Engine.PlayerController.AddRollInput // (Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77692D3E0
	void AddPitchInput(float Val); // Function Engine.PlayerController.AddPitchInput // (Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF77692D360
	void ActivateTouchInterface(struct UTouchInterface* NewTouchInterface); // Function Engine.PlayerController.ActivateTouchInterface // (Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF77692D190
};

// Class Engine.ApplicationLifecycleComponent
// Size : 0x140 (Inherited : 0xB0)
struct UApplicationLifecycleComponent : UActorComponent {
	struct FMulticastInlineDelegate ApplicationWillDeactivateDelegate; // 0xB0(0x10)
	struct FMulticastInlineDelegate ApplicationHasReactivatedDelegate; // 0xC0(0x10)
	struct FMulticastInlineDelegate ApplicationWillEnterBackgroundDelegate; // 0xD0(0x10)
	struct FMulticastInlineDelegate ApplicationHasEnteredForegroundDelegate; // 0xE0(0x10)
	struct FMulticastInlineDelegate ApplicationWillTerminateDelegate; // 0xF0(0x10)
	struct FMulticastInlineDelegate ApplicationShouldUnloadResourcesDelegate; // 0x100(0x10)
	struct FMulticastInlineDelegate ApplicationReceivedStartupArgumentsDelegate; // 0x110(0x10)
	struct FMulticastInlineDelegate OnTemperatureChangeDelegate; // 0x120(0x10)
	struct FMulticastInlineDelegate OnLowPowerModeDelegate; // 0x130(0x10)
};

// Class Engine.BlueprintAsyncActionBase
// Size : 0x30 (Inherited : 0x28)
struct UBlueprintAsyncActionBase : UObject {
	unsigned char UnknownData_28[0x0008]; // 0x28(0x8)

	void Activate(); // Function Engine.BlueprintAsyncActionBase.Activate // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF775B89820
};

// Class Engine.OnlineBlueprintCallProxyBase
// Size : 0x30 (Inherited : 0x30)
struct UOnlineBlueprintCallProxyBase : UBlueprintAsyncActionBase {
};

// Class Engine.Player
// Size : 0x48 (Inherited : 0x28)
struct UPlayer : UObject {
	unsigned char UnknownData_28[0x0008]; // 0x28(0x8)
	struct APlayerController* PlayerController; // 0x30(0x8)
	int32_t CurrentNetSpeed; // 0x38(0x4)
	int32_t ConfiguredInternetSpeed; // 0x3C(0x4)
	int32_t ConfiguredLanSpeed; // 0x40(0x4)
	unsigned char UnknownData_44[0x0004]; // 0x44(0x4)
};

// Class Engine.NetConnection
// Size : 0x1A30 (Inherited : 0x48)
struct UNetConnection : UPlayer {
	struct TArray<struct UChildConnection*> Children; // 0x48(0x10)
	struct UNetDriver* Driver; // 0x58(0x8)
	class UPackageMap* PackageMapClass; // 0x60(0x8)
	struct UPackageMap* PackageMap; // 0x68(0x8)
	struct TArray<struct UChannel*> OpenChannels; // 0x70(0x10)
	struct TArray<struct AActor*> SentTemporaries; // 0x80(0x10)
	struct AActor* ViewTarget; // 0x90(0x8)
	struct AActor* OwningActor; // 0x98(0x8)
	int32_t MaxPacket; // 0xA0(0x4)
	unsigned char InternalAck : 1; // 0xA4(0x1)
	unsigned char UnknownData_A4_1 : 7; // 0xA4(0x1)
	unsigned char UnknownData_A5[0x00BB]; // 0xA5(0xBB)
	struct FUniqueNetIdRepl PlayerId; // 0x160(0x28)
	unsigned char UnknownData_188[0x0048]; // 0x188(0x48)
	double LastReceiveTime; // 0x1D0(0x8)
	unsigned char UnknownData_1D8[0x1338]; // 0x1D8(0x1338)
	struct TArray<struct UChannel*> ChannelsToTick; // 0x1510(0x10)
	unsigned char UnknownData_1520[0x0510]; // 0x1520(0x510)
};

// Class Engine.NetDriver
// Size : 0x748 (Inherited : 0x28)
struct UNetDriver : UObject {
	unsigned char UnknownData_28[0x0008]; // 0x28(0x8)
	struct FString NetConnectionClassName; // 0x30(0x10)
	struct FString ReplicationDriverClassName; // 0x40(0x10)
	int32_t MaxDownloadSize; // 0x50(0x4)
	unsigned char bClampListenServerTickRate : 1; // 0x54(0x1)
	unsigned char UnknownData_54_1 : 7; // 0x54(0x1)
	unsigned char UnknownData_55[0x0003]; // 0x55(0x3)
	int32_t NetServerMaxTickRate; // 0x58(0x4)
	int32_t MaxNetTickRate; // 0x5C(0x4)
	int32_t MaxInternetClientRate; // 0x60(0x4)
	int32_t MaxClientRate; // 0x64(0x4)
	float ServerTravelPause; // 0x68(0x4)
	float SpawnPrioritySeconds; // 0x6C(0x4)
	float RelevantTimeout; // 0x70(0x4)
	float KeepAliveTime; // 0x74(0x4)
	float InitialConnectTimeout; // 0x78(0x4)
	float ConnectionTimeout; // 0x7C(0x4)
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x80(0x4)
	bool bNoTimeouts; // 0x84(0x1)
	bool bNeverApplyNetworkEmulationSettings; // 0x85(0x1)
	unsigned char UnknownData_86[0x0002]; // 0x86(0x2)
	struct UNetConnection* ServerConnection; // 0x88(0x8)
	struct TArray<struct UNetConnection*> ClientConnections; // 0x90(0x10)
	unsigned char UnknownData_A0[0x0060]; // 0xA0(0x60)
	int32_t RecentlyDisconnectedTrackingTime; // 0x100(0x4)
	unsigned char UnknownData_104[0x003C]; // 0x104(0x3C)
	struct UWorld* World; // 0x140(0x8)
	struct UPackage* WorldPackage; // 0x148(0x8)
	unsigned char UnknownData_150[0x0020]; // 0x150(0x20)
	class UObject* NetConnectionClass; // 0x170(0x8)
	class UObject* ReplicationDriverClass; // 0x178(0x8)
	unsigned char UnknownData_180[0x0010]; // 0x180(0x10)
	struct FName NetDriverName; // 0x190(0x8)
	struct TArray<struct FChannelDefinition> ChannelDefinitions; // 0x198(0x10)
	struct TMap<struct FName, struct FChannelDefinition> ChannelDefinitionMap; // 0x1A8(0x50)
	struct TArray<struct UChannel*> ActorChannelPool; // 0x1F8(0x10)
	unsigned char UnknownData_208[0x0008]; // 0x208(0x8)
	float Time; // 0x210(0x4)
	unsigned char UnknownData_214[0x04D4]; // 0x214(0x4D4)
	struct UReplicationDriver* ReplicationDriver; // 0x6E8(0x8)
	unsigned char UnknownData_6F0[0x0058]; // 0x6F0(0x58)
};

// Class Engine.OnlineEngineInterface
// Size : 0x28 (Inherited : 0x28)
struct UOnlineEngineInterface : UObject {
};

// Class Engine.OnlineSession
// Size : 0x28 (Inherited : 0x28)
struct UOnlineSession : UObject {
};

// Class Engine.MovementComponent
// Size : 0xF0 (Inherited : 0xB0)
struct UMovementComponent : UActorComponent {
	struct USceneComponent* UpdatedComponent; // 0xB0(0x8)
	struct UPrimitiveComponent* UpdatedPrimitive; // 0xB8(0x8)
	unsigned char UnknownData_C0[0x0004]; // 0xC0(0x4)
	struct FVector Velocity; // 0xC4(0xC)
	struct FVector PlaneConstraintNormal; // 0xD0(0xC)
	struct FVector PlaneConstraintOrigin; // 0xDC(0xC)
	unsigned char bUpdateOnlyIfRendered : 1; // 0xE8(0x1)
	unsigned char bAutoUpdateTickRegistration : 1; // 0xE8(0x1)
	unsigned char bTickBeforeOwner : 1; // 0xE8(0x1)
	unsigned char bAutoRegisterUpdatedComponent : 1; // 0xE8(0x1)
	unsigned char bConstrainToPlane : 1; // 0xE8(0x1)
	unsigned char bSnapToPlaneAtStart : 1; // 0xE8(0x1)
	unsigned char bAutoRegisterPhysicsVolumeUpdates : 1; // 0xE8(0x1)
	unsigned char bComponentShouldUpdatePhysicsVolume : 1; // 0xE8(0x1)
	unsigned char UnknownData_E9[0x0002]; // 0xE9(0x2)
	enum class EPlaneConstraintAxisSetting PlaneConstraintAxisSetting; // 0xEB(0x1)
	unsigned char UnknownData_EC[0x0004]; // 0xEC(0x4)

	void StopMovementImmediately(); // Function Engine.MovementComponent.StopMovementImmediately // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776819DC0
	void SnapUpdatedComponentToPlane(); // Function Engine.MovementComponent.SnapUpdatedComponentToPlane // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF77690EC60
	void SetUpdatedComponent(struct USceneComponent* NewUpdatedComponent); // Function Engine.MovementComponent.SetUpdatedComponent // (Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF77681A4F0
	void SetPlaneConstraintOrigin(struct FVector PlaneOrigin); // Function Engine.MovementComponent.SetPlaneConstraintOrigin // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0xC, 0x7FF77690EBD0
	void SetPlaneConstraintNormal(struct FVector PlaneNormal); // Function Engine.MovementComponent.SetPlaneConstraintNormal // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0xC, 0x7FF77690EB40
	void SetPlaneConstraintFromVectors(struct FVector Forward, struct FVector Up); // Function Engine.MovementComponent.SetPlaneConstraintFromVectors // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x18, 0x7FF77690EA60
	void SetPlaneConstraintEnabled(bool bEnabled); // Function Engine.MovementComponent.SetPlaneConstraintEnabled // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77690E9D0
	void SetPlaneConstraintAxisSetting(enum class EPlaneConstraintAxisSetting NewAxisSetting); // Function Engine.MovementComponent.SetPlaneConstraintAxisSetting // (Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF77690E950
	void PhysicsVolumeChanged(struct APhysicsVolume* NewVolume); // Function Engine.MovementComponent.PhysicsVolumeChanged // (Native|Public) // Param Size : 0x8, 0x7FF77690E850
	bool K2_MoveUpdatedComponent(struct FVector Delta, struct FRotator NewRotation, struct FHitResult OutHit, bool bSweep, bool bTeleport); // Function Engine.MovementComponent.K2_MoveUpdatedComponent // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0xA3, 0x7FF77690E3A0
	float K2_GetModifiedMaxSpeed(); // Function Engine.MovementComponent.K2_GetModifiedMaxSpeed // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF77690E360
	float K2_GetMaxSpeedModifier(); // Function Engine.MovementComponent.K2_GetMaxSpeedModifier // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF77690E320
	bool IsExceedingMaxSpeed(float MaxSpeed); // Function Engine.MovementComponent.IsExceedingMaxSpeed // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x5, 0x7FF77690E290
	struct FVector GetPlaneConstraintOrigin(); // Function Engine.MovementComponent.GetPlaneConstraintOrigin // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF77690E250
	struct FVector GetPlaneConstraintNormal(); // Function Engine.MovementComponent.GetPlaneConstraintNormal // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF77690E210
	enum class EPlaneConstraintAxisSetting GetPlaneConstraintAxisSetting(); // Function Engine.MovementComponent.GetPlaneConstraintAxisSetting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF77690E1F0
	struct APhysicsVolume* GetPhysicsVolume(); // Function Engine.MovementComponent.GetPhysicsVolume // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF77690E1C0
	float GetMaxSpeed(); // Function Engine.MovementComponent.GetMaxSpeed // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF77690E180
	float GetGravityZ(); // Function Engine.MovementComponent.GetGravityZ // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF77690E140
	struct FVector ConstrainNormalToPlane(struct FVector Normal); // Function Engine.MovementComponent.ConstrainNormalToPlane // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x18, 0x7FF77690E090
	struct FVector ConstrainLocationToPlane(struct FVector Location); // Function Engine.MovementComponent.ConstrainLocationToPlane // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x18, 0x7FF77690DFE0
	struct FVector ConstrainDirectionToPlane(struct FVector Direction); // Function Engine.MovementComponent.ConstrainDirectionToPlane // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x18, 0x7FF77690DF30
};

// Class Engine.NavMovementComponent
// Size : 0x130 (Inherited : 0xF0)
struct UNavMovementComponent : UMovementComponent {
	struct FNavAgentProperties NavAgentProps; // 0xF0(0x30)
	float FixedPathBrakingDistance; // 0x120(0x4)
	unsigned char bUpdateNavAgentWithOwnersCollision : 1; // 0x124(0x1)
	unsigned char bUseAccelerationForPaths : 1; // 0x124(0x1)
	unsigned char bUseFixedBrakingDistanceForPaths : 1; // 0x124(0x1)
	unsigned char UnknownData_124_3 : 5; // 0x124(0x1)
	struct FMovementProperties MovementState; // 0x125(0x1)
	unsigned char UnknownData_126[0x0002]; // 0x126(0x2)
	struct UObject* PathFollowingComp; // 0x128(0x8)

	void StopMovementKeepPathing(); // Function Engine.NavMovementComponent.StopMovementKeepPathing // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776912F60
	void StopActiveMovement(); // Function Engine.NavMovementComponent.StopActiveMovement // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776912F40
	bool IsSwimming(); // Function Engine.NavMovementComponent.IsSwimming // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776912D70
	bool IsMovingOnGround(); // Function Engine.NavMovementComponent.IsMovingOnGround // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776854220
	bool IsFlying(); // Function Engine.NavMovementComponent.IsFlying // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776912D40
	bool IsFalling(); // Function Engine.NavMovementComponent.IsFalling // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776912D10
	bool IsCrouching(); // Function Engine.NavMovementComponent.IsCrouching // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776836760
};

// Class Engine.PawnMovementComponent
// Size : 0x138 (Inherited : 0x130)
struct UPawnMovementComponent : UNavMovementComponent {
	struct APawn* PawnOwner; // 0x130(0x8)

	struct FVector K2_GetInputVector(); // Function Engine.PawnMovementComponent.K2_GetInputVector // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776924C40
	bool IsMoveInputIgnored(); // Function Engine.PawnMovementComponent.IsMoveInputIgnored // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776924CB0
	struct FVector GetPendingInputVector(); // Function Engine.PawnMovementComponent.GetPendingInputVector // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776924C40
	struct APawn* GetPawnOwner(); // Function Engine.PawnMovementComponent.GetPawnOwner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776924C10
	struct FVector GetLastInputVector(); // Function Engine.PawnMovementComponent.GetLastInputVector // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776924BD0
	struct FVector ConsumeInputVector(); // Function Engine.PawnMovementComponent.ConsumeInputVector // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0xC, 0x7FF776924960
	void AddInputVector(struct FVector WorldVector, bool bForce); // Function Engine.PawnMovementComponent.AddInputVector // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0xD, 0x7FF776924500
};

// Class Engine.CharacterMovementComponent
// Size : 0x610 (Inherited : 0x138)
struct UCharacterMovementComponent : UPawnMovementComponent {
	unsigned char UnknownData_138[0x0010]; // 0x138(0x10)
	struct ACharacter* CharacterOwner; // 0x148(0x8)
	float GravityScale; // 0x150(0x4)
	float MaxStepHeight; // 0x154(0x4)
	float JumpZVelocity; // 0x158(0x4)
	float JumpOffJumpZFactor; // 0x15C(0x4)
	float WalkableFloorAngle; // 0x160(0x4)
	float WalkableFloorZ; // 0x164(0x4)
	enum class EMovementMode MovementMode; // 0x168(0x1)
	enum class None CustomMovementMode; // 0x169(0x1)
	enum class ENetworkSmoothingMode NetworkSmoothingMode; // 0x16A(0x1)
	unsigned char UnknownData_16B[0x0001]; // 0x16B(0x1)
	float GroundFriction; // 0x16C(0x4)
	unsigned char UnknownData_170[0x001C]; // 0x170(0x1C)
	float MaxWalkSpeed; // 0x18C(0x4)
	float MaxWalkSpeedCrouched; // 0x190(0x4)
	float MaxSwimSpeed; // 0x194(0x4)
	float MaxFlySpeed; // 0x198(0x4)
	float MaxCustomMovementSpeed; // 0x19C(0x4)
	float MaxAcceleration; // 0x1A0(0x4)
	float MinAnalogWalkSpeed; // 0x1A4(0x4)
	float BrakingFrictionFactor; // 0x1A8(0x4)
	float BrakingFriction; // 0x1AC(0x4)
	float BrakingSubStepTime; // 0x1B0(0x4)
	float BrakingDecelerationWalking; // 0x1B4(0x4)
	float BrakingDecelerationFalling; // 0x1B8(0x4)
	float BrakingDecelerationSwimming; // 0x1BC(0x4)
	float BrakingDecelerationFlying; // 0x1C0(0x4)
	float AirControl; // 0x1C4(0x4)
	float AirControlBoostMultiplier; // 0x1C8(0x4)
	float AirControlBoostVelocityThreshold; // 0x1CC(0x4)
	float FallingLateralFriction; // 0x1D0(0x4)
	float CrouchedHalfHeight; // 0x1D4(0x4)
	float Buoyancy; // 0x1D8(0x4)
	float PerchRadiusThreshold; // 0x1DC(0x4)
	float PerchAdditionalHeight; // 0x1E0(0x4)
	struct FRotator RotationRate; // 0x1E4(0xC)
	unsigned char bUseSeparateBrakingFriction : 1; // 0x1F0(0x1)
	unsigned char bApplyGravityWhileJumping : 1; // 0x1F0(0x1)
	unsigned char bUseControllerDesiredRotation : 1; // 0x1F0(0x1)
	unsigned char bOrientRotationToMovement : 1; // 0x1F0(0x1)
	unsigned char bSweepWhileNavWalking : 1; // 0x1F0(0x1)
	unsigned char UnknownData_1F0_5 : 1; // 0x1F0(0x1)
	unsigned char bMovementInProgress : 1; // 0x1F0(0x1)
	unsigned char bEnableScopedMovementUpdates : 1; // 0x1F0(0x1)
	unsigned char bEnableServerDualMoveScopedMovementUpdates : 1; // 0x1F1(0x1)
	unsigned char bForceMaxAccel : 1; // 0x1F1(0x1)
	unsigned char bRunPhysicsWithNoController : 1; // 0x1F1(0x1)
	unsigned char bForceNextFloorCheck : 1; // 0x1F1(0x1)
	unsigned char bShrinkProxyCapsule : 1; // 0x1F1(0x1)
	unsigned char bCanWalkOffLedges : 1; // 0x1F1(0x1)
	unsigned char bCanWalkOffLedgesWhenCrouching : 1; // 0x1F1(0x1)
	unsigned char UnknownData_1F2_0 : 1; // 0x1F2(0x1)
	unsigned char bNetworkSkipProxyPredictionOnNetUpdate : 1; // 0x1F2(0x1)
	unsigned char bNetworkAlwaysReplicateTransformUpdateTimestamp : 1; // 0x1F2(0x1)
	unsigned char bDeferUpdateMoveComponent : 1; // 0x1F2(0x1)
	unsigned char bEnablePhysicsInteraction : 1; // 0x1F2(0x1)
	unsigned char bTouchForceScaledToMass : 1; // 0x1F2(0x1)
	unsigned char bPushForceScaledToMass : 1; // 0x1F2(0x1)
	unsigned char bPushForceUsingZOffset : 1; // 0x1F2(0x1)
	unsigned char bScalePushForceToVelocity : 1; // 0x1F3(0x1)
	unsigned char UnknownData_1F3_1 : 7; // 0x1F3(0x1)
	unsigned char UnknownData_1F4[0x0004]; // 0x1F4(0x4)
	struct USceneComponent* DeferredUpdatedMoveComponent; // 0x1F8(0x8)
	float MaxOutOfWaterStepHeight; // 0x200(0x4)
	float OutofWaterZ; // 0x204(0x4)
	float Mass; // 0x208(0x4)
	float StandingDownwardForceScale; // 0x20C(0x4)
	float InitialPushForceFactor; // 0x210(0x4)
	float PushForceFactor; // 0x214(0x4)
	float PushForcePointZOffsetFactor; // 0x218(0x4)
	float TouchForceFactor; // 0x21C(0x4)
	float MinTouchForce; // 0x220(0x4)
	float MaxTouchForce; // 0x224(0x4)
	float RepulsionForce; // 0x228(0x4)
	struct FVector Acceleration; // 0x22C(0xC)
	unsigned char UnknownData_238[0x0008]; // 0x238(0x8)
	struct FQuat LastUpdateRotation; // 0x240(0x10)
	struct FVector LastUpdateLocation; // 0x250(0xC)
	struct FVector LastUpdateVelocity; // 0x25C(0xC)
	float ServerLastTransformUpdateTimeStamp; // 0x268(0x4)
	float ServerLastClientGoodMoveAckTime; // 0x26C(0x4)
	float ServerLastClientAdjustmentTime; // 0x270(0x4)
	struct FVector PendingImpulseToApply; // 0x274(0xC)
	struct FVector PendingForceToApply; // 0x280(0xC)
	float AnalogInputModifier; // 0x28C(0x4)
	unsigned char UnknownData_290[0x000C]; // 0x290(0xC)
	float MaxSimulationTimeStep; // 0x29C(0x4)
	int32_t MaxSimulationIterations; // 0x2A0(0x4)
	int32_t MaxJumpApexAttemptsPerSimulation; // 0x2A4(0x4)
	float MaxDepenetrationWithGeometry; // 0x2A8(0x4)
	float MaxDepenetrationWithGeometryAsProxy; // 0x2AC(0x4)
	float MaxDepenetrationWithPawn; // 0x2B0(0x4)
	float MaxDepenetrationWithPawnAsProxy; // 0x2B4(0x4)
	float NetworkSimulatedSmoothLocationTime; // 0x2B8(0x4)
	float NetworkSimulatedSmoothRotationTime; // 0x2BC(0x4)
	float ListenServerNetworkSimulatedSmoothLocationTime; // 0x2C0(0x4)
	float ListenServerNetworkSimulatedSmoothRotationTime; // 0x2C4(0x4)
	float NetProxyShrinkRadius; // 0x2C8(0x4)
	float NetProxyShrinkHalfHeight; // 0x2CC(0x4)
	float NetworkMaxSmoothUpdateDistance; // 0x2D0(0x4)
	float NetworkNoSmoothUpdateDistance; // 0x2D4(0x4)
	float NetworkMinTimeBetweenClientAckGoodMoves; // 0x2D8(0x4)
	float NetworkMinTimeBetweenClientAdjustments; // 0x2DC(0x4)
	float NetworkMinTimeBetweenClientAdjustmentsLargeCorrection; // 0x2E0(0x4)
	float NetworkLargeClientCorrectionDistance; // 0x2E4(0x4)
	float LedgeCheckThreshold; // 0x2E8(0x4)
	float JumpOutOfWaterPitch; // 0x2EC(0x4)
	struct FFindFloorResult CurrentFloor; // 0x2F0(0x94)
	enum class EMovementMode DefaultLandMovementMode; // 0x384(0x1)
	enum class EMovementMode DefaultWaterMovementMode; // 0x385(0x1)
	enum class EMovementMode GroundMovementMode; // 0x386(0x1)
	unsigned char bMaintainHorizontalGroundVelocity : 1; // 0x387(0x1)
	unsigned char bImpartBaseVelocityX : 1; // 0x387(0x1)
	unsigned char bImpartBaseVelocityY : 1; // 0x387(0x1)
	unsigned char bImpartBaseVelocityZ : 1; // 0x387(0x1)
	unsigned char bImpartBaseAngularVelocity : 1; // 0x387(0x1)
	unsigned char bJustTeleported : 1; // 0x387(0x1)
	unsigned char bNetworkUpdateReceived : 1; // 0x387(0x1)
	unsigned char bNetworkMovementModeChanged : 1; // 0x387(0x1)
	unsigned char bIgnoreClientMovementErrorChecksAndCorrection : 1; // 0x388(0x1)
	unsigned char bServerAcceptClientAuthoritativePosition : 1; // 0x388(0x1)
	unsigned char bNotifyApex : 1; // 0x388(0x1)
	unsigned char bCheatFlying : 1; // 0x388(0x1)
	unsigned char bWantsToCrouch : 1; // 0x388(0x1)
	unsigned char bCrouchMaintainsBaseLocation : 1; // 0x388(0x1)
	unsigned char bIgnoreBaseRotation : 1; // 0x388(0x1)
	unsigned char bFastAttachedMove : 1; // 0x388(0x1)
	unsigned char bAlwaysCheckFloor : 1; // 0x389(0x1)
	unsigned char bUseFlatBaseForFloorChecks : 1; // 0x389(0x1)
	unsigned char bPerformingJumpOff : 1; // 0x389(0x1)
	unsigned char bWantsToLeaveNavWalking : 1; // 0x389(0x1)
	unsigned char bUseRVOAvoidance : 1; // 0x389(0x1)
	unsigned char bRequestedMoveUseAcceleration : 1; // 0x389(0x1)
	unsigned char UnknownData_389_6 : 1; // 0x389(0x1)
	unsigned char bWasSimulatingRootMotion : 1; // 0x389(0x1)
	unsigned char bAllowPhysicsRotationDuringAnimRootMotion : 1; // 0x38A(0x1)
	unsigned char bHasRequestedVelocity : 1; // 0x38A(0x1)
	unsigned char bRequestedMoveWithMaxSpeed : 1; // 0x38A(0x1)
	unsigned char bWasAvoidanceUpdated : 1; // 0x38A(0x1)
	unsigned char UnknownData_38A_4 : 2; // 0x38A(0x1)
	unsigned char bProjectNavMeshWalking : 1; // 0x38A(0x1)
	unsigned char bProjectNavMeshOnBothWorldChannels : 1; // 0x38A(0x1)
	unsigned char UnknownData_38B[0x0011]; // 0x38B(0x11)
	float AvoidanceConsiderationRadius; // 0x39C(0x4)
	struct FVector RequestedVelocity; // 0x3A0(0xC)
	int32_t AvoidanceUID; // 0x3AC(0x4)
	struct FNavAvoidanceMask AvoidanceGroup; // 0x3B0(0x4)
	struct FNavAvoidanceMask GroupsToAvoid; // 0x3B4(0x4)
	struct FNavAvoidanceMask GroupsToIgnore; // 0x3B8(0x4)
	float AvoidanceWeight; // 0x3BC(0x4)
	struct FVector PendingLaunchVelocity; // 0x3C0(0xC)
	unsigned char UnknownData_3CC[0x00A4]; // 0x3CC(0xA4)
	float NavMeshProjectionInterval; // 0x470(0x4)
	float NavMeshProjectionTimer; // 0x474(0x4)
	float NavMeshProjectionInterpSpeed; // 0x478(0x4)
	float NavMeshProjectionHeightScaleUp; // 0x47C(0x4)
	float NavMeshProjectionHeightScaleDown; // 0x480(0x4)
	float NavWalkingFloorDistTolerance; // 0x484(0x4)
	struct FCharacterMovementComponentPostPhysicsTickFunction PostPhysicsTickFunction; // 0x488(0x30)
	unsigned char UnknownData_4B8[0x0018]; // 0x4B8(0x18)
	float MinTimeBetweenTimeStampResets; // 0x4D0(0x4)
	unsigned char UnknownData_4D4[0x0004]; // 0x4D4(0x4)
	struct FRootMotionSourceGroup CurrentRootMotion; // 0x4D8(0x38)
	unsigned char UnknownData_510[0x0090]; // 0x510(0x90)
	struct FRootMotionMovementParams RootMotionParams; // 0x5A0(0x40)
	struct FVector AnimRootMotionVelocity; // 0x5E0(0xC)
	unsigned char UnknownData_5EC[0x0024]; // 0x5EC(0x24)

	void SetWalkableFloorZ(float InWalkableFloorZ); // Function Engine.CharacterMovementComponent.SetWalkableFloorZ // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF776854B20
	void SetWalkableFloorAngle(float InWalkableFloorAngle); // Function Engine.CharacterMovementComponent.SetWalkableFloorAngle // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF776854AA0
	void SetMovementMode(enum class EMovementMode NewMovementMode, enum class None NewCustomMode); // Function Engine.CharacterMovementComponent.SetMovementMode // (Native|Public|BlueprintCallable) // Param Size : 0x2, 0x7FF7768549E0
	void SetGroupsToIgnoreMask(struct FNavAvoidanceMask GroupMask); // Function Engine.CharacterMovementComponent.SetGroupsToIgnoreMask // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x4, 0x7FF776854950
	void SetGroupsToIgnore(int32_t GroupFlags); // Function Engine.CharacterMovementComponent.SetGroupsToIgnore // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF7768548D0
	void SetGroupsToAvoidMask(struct FNavAvoidanceMask GroupMask); // Function Engine.CharacterMovementComponent.SetGroupsToAvoidMask // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x4, 0x7FF776854840
	void SetGroupsToAvoid(int32_t GroupFlags); // Function Engine.CharacterMovementComponent.SetGroupsToAvoid // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF7768547C0
	void SetAvoidanceGroupMask(struct FNavAvoidanceMask GroupMask); // Function Engine.CharacterMovementComponent.SetAvoidanceGroupMask // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x4, 0x7FF776854730
	void SetAvoidanceGroup(int32_t GroupFlags); // Function Engine.CharacterMovementComponent.SetAvoidanceGroup // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF7768546B0
	void SetAvoidanceEnabled(bool bEnable); // Function Engine.CharacterMovementComponent.SetAvoidanceEnabled // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776854620
	float K2_GetWalkableFloorZ(); // Function Engine.CharacterMovementComponent.K2_GetWalkableFloorZ // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF7768545F0
	float K2_GetWalkableFloorAngle(); // Function Engine.CharacterMovementComponent.K2_GetWalkableFloorAngle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF7768545C0
	float K2_GetModifiedMaxAcceleration(); // Function Engine.CharacterMovementComponent.K2_GetModifiedMaxAcceleration // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF776854580
	void K2_FindFloor(struct FVector CapsuleLocation, struct FFindFloorResult FloorResult); // Function Engine.CharacterMovementComponent.K2_FindFloor // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xA0, 0x7FF776854440
	void K2_ComputeFloorDist(struct FVector CapsuleLocation, float LineDistance, float SweepDistance, float SweepRadius, struct FFindFloorResult FloorResult); // Function Engine.CharacterMovementComponent.K2_ComputeFloorDist // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xAC, 0x7FF776854250
	bool IsWalking(); // Function Engine.CharacterMovementComponent.IsWalking // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x1, 0x7FF776854220
	bool IsWalkable(struct FHitResult Hit); // Function Engine.CharacterMovementComponent.IsWalkable // (Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x89, 0x7FF776854150
	float GetValidPerchRadius(); // Function Engine.CharacterMovementComponent.GetValidPerchRadius // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF776854120
	float GetPerchRadiusThreshold(); // Function Engine.CharacterMovementComponent.GetPerchRadiusThreshold // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF7768540F0
	struct UPrimitiveComponent* GetMovementBase(); // Function Engine.CharacterMovementComponent.GetMovementBase // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF7768540C0
	float GetMinAnalogSpeed(); // Function Engine.CharacterMovementComponent.GetMinAnalogSpeed // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF776854080
	float GetMaxJumpHeightWithJumpTime(); // Function Engine.CharacterMovementComponent.GetMaxJumpHeightWithJumpTime // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF776854040
	float GetMaxJumpHeight(); // Function Engine.CharacterMovementComponent.GetMaxJumpHeight // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF776854000
	float GetMaxBrakingDeceleration(); // Function Engine.CharacterMovementComponent.GetMaxBrakingDeceleration // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF776853FC0
	float GetMaxAcceleration(); // Function Engine.CharacterMovementComponent.GetMaxAcceleration // (Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF776853F80
	struct FVector GetLastUpdateVelocity(); // Function Engine.CharacterMovementComponent.GetLastUpdateVelocity // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776853F50
	struct FRotator GetLastUpdateRotation(); // Function Engine.CharacterMovementComponent.GetLastUpdateRotation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776853F00
	struct FVector GetLastUpdateLocation(); // Function Engine.CharacterMovementComponent.GetLastUpdateLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776853ED0
	struct FVector GetImpartedMovementBaseVelocity(); // Function Engine.CharacterMovementComponent.GetImpartedMovementBaseVelocity // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776853E90
	struct FVector GetCurrentAcceleration(); // Function Engine.CharacterMovementComponent.GetCurrentAcceleration // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0xC, 0x7FF776853E50
	struct ACharacter* GetCharacterOwner(); // Function Engine.CharacterMovementComponent.GetCharacterOwner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776853E30
	float GetAnalogInputModifier(); // Function Engine.CharacterMovementComponent.GetAnalogInputModifier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF776853E00
	void DisableMovement(); // Function Engine.CharacterMovementComponent.DisableMovement // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776853DE0
	void ClearAccumulatedForces(); // Function Engine.CharacterMovementComponent.ClearAccumulatedForces // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776853DC0
	void CapsuleTouched(struct UPrimitiveComponent* OverlappedComp, struct AActor* Other, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function Engine.CharacterMovementComponent.CapsuleTouched // (Native|Protected|HasOutParms) // Param Size : 0xA8, 0x7FF776853BD0
	void CalcVelocity(float DeltaTime, float Friction, bool bFluid, float BrakingDeceleration); // Function Engine.CharacterMovementComponent.CalcVelocity // (Native|Public|BlueprintCallable) // Param Size : 0x10, 0x7FF776853A70
	void AddImpulse(struct FVector Impulse, bool bVelocityChange); // Function Engine.CharacterMovementComponent.AddImpulse // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0xD, 0x7FF776853990
	void AddForce(struct FVector Force); // Function Engine.CharacterMovementComponent.AddForce // (Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0xC, 0x7FF776853900
};

// Class Engine.Subsystem
// Size : 0x30 (Inherited : 0x28)
struct USubsystem : UObject {
	unsigned char UnknownData_28[0x0008]; // 0x28(0x8)
};

// Class Engine.DynamicSubsystem
// Size : 0x30 (Inherited : 0x30)
struct UDynamicSubsystem : USubsystem {
};

// Class Engine.EngineSubsystem
// Size : 0x30 (Inherited : 0x30)
struct UEngineSubsystem : UDynamicSubsystem {
};

// Class Engine.SceneCapture
// Size : 0x230 (Inherited : 0x220)
struct ASceneCapture : AActor {
	struct UStaticMeshComponent* MeshComp; // 0x220(0x8)
	struct USceneComponent* SceneComponent; // 0x228(0x8)
};

// Class Engine.SceneCapture2D
// Size : 0x238 (Inherited : 0x230)
struct ASceneCapture2D : ASceneCapture {
	struct USceneCaptureComponent2D* CaptureComponent2D; // 0x230(0x8)

	void OnInterpToggle(bool bEnable); // Function Engine.SceneCapture2D.OnInterpToggle // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF776928A00
};

// Class Engine.StereoLayerComponent
// Size : 0x2E0 (Inherited : 0x1F0)
struct UStereoLayerComponent : USceneComponent {
	unsigned char bLiveTexture : 1; // 0x1F0(0x1)
	unsigned char bSupportsDepth : 1; // 0x1F0(0x1)
	unsigned char bNoAlphaChannel : 1; // 0x1F0(0x1)
	unsigned char UnknownData_1F0_3 : 5; // 0x1F0(0x1)
	unsigned char UnknownData_1F1[0x0007]; // 0x1F1(0x7)
	struct UTexture* Texture; // 0x1F8(0x8)
	struct UTexture* LeftTexture; // 0x200(0x8)
	unsigned char bQuadPreserveTextureRatio : 1; // 0x208(0x1)
	unsigned char UnknownData_208_1 : 7; // 0x208(0x1)
	unsigned char UnknownData_209[0x0003]; // 0x209(0x3)
	struct FVector2D QuadSize; // 0x20C(0x8)
	struct FBox2D UVRect; // 0x214(0x14)
	float CylinderRadius; // 0x228(0x4)
	float CylinderOverlayArc; // 0x22C(0x4)
	int32_t CylinderHeight; // 0x230(0x4)
	struct FEquirectProps EquirectProps; // 0x234(0x48)
	enum class EStereoLayerType StereoLayerType; // 0x27C(0x1)
	enum class EStereoLayerShape StereoLayerShape; // 0x27D(0x1)
	unsigned char UnknownData_27E[0x0002]; // 0x27E(0x2)
	struct UStereoLayerShape* Shape; // 0x280(0x8)
	int32_t Priority; // 0x288(0x4)
	unsigned char UnknownData_28C[0x0054]; // 0x28C(0x54)

	void SetUVRect(struct FBox2D InUVRect); // Function Engine.StereoLayerComponent.SetUVRect // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x14, 0x7FF776974570
	void SetTexture(struct UTexture* InTexture); // Function Engine.StereoLayerComponent.SetTexture // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF7769744F0
	void SetQuadSize(struct FVector2D InQuadSize); // Function Engine.StereoLayerComponent.SetQuadSize // (Final|Native|Public|HasDefaults|BlueprintCallable) // Param Size : 0x8, 0x7FF7769741C0
	void SetPriority(int32_t InPriority); // Function Engine.StereoLayerComponent.SetPriority // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF776974140
	void SetLeftTexture(struct UTexture* InTexture); // Function Engine.StereoLayerComponent.SetLeftTexture // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF776973FC0
	void SetEquirectProps(struct FEquirectProps InScaleBiases); // Function Engine.StereoLayerComponent.SetEquirectProps // (Final|Native|Public|BlueprintCallable) // Param Size : 0x48, 0x7FF776973CC0
	void MarkTextureForUpdate(); // Function Engine.StereoLayerComponent.MarkTextureForUpdate // (Final|Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF776973BA0
	struct FBox2D GetUVRect(); // Function Engine.StereoLayerComponent.GetUVRect // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x14, 0x7FF776973B70
	struct UTexture* GetTexture(); // Function Engine.StereoLayerComponent.GetTexture // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776973B50
	struct FVector2D GetQuadSize(); // Function Engine.StereoLayerComponent.GetQuadSize // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776973B20
	int32_t GetPriority(); // Function Engine.StereoLayerComponent.GetPriority // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF776973B00
	struct UTexture* GetLeftTexture(); // Function Engine.StereoLayerComponent.GetLeftTexture // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x8, 0x7FF776973A00
};

// Class Engine.StereoLayerShape
// Size : 0x28 (Inherited : 0x28)
struct UStereoLayerShape : UObject {
};

// Class Engine.StereoLayerShapeQuad
// Size : 0x28 (Inherited : 0x28)
struct UStereoLayerShapeQuad : UStereoLayerShape {
};

// Class Engine.SoundEffectPreset
// Size : 0x40 (Inherited : 0x28)
struct USoundEffectPreset : UObject {
	unsigned char UnknownData_28[0x0018]; // 0x28(0x18)
};

// Class Engine.SoundEffectSourcePreset
// Size : 0x40 (Inherited : 0x40)
struct USoundEffectSourcePreset : USoundEffectPreset {
};

// Class Engine.SoundEffectSubmixPreset
// Size : 0x40 (Inherited : 0x40)
struct USoundEffectSubmixPreset : USoundEffectPreset {
};

// Class Engine.SkyLight
// Size : 0x230 (Inherited : 0x220)
struct ASkyLight : AInfo {
	struct USkyLightComponent* LightComponent; // 0x220(0x8)
	unsigned char bEnabled : 1; // 0x228(0x1)
	unsigned char UnknownData_228_1 : 7; // 0x228(0x1)
	unsigned char UnknownData_229[0x0007]; // 0x229(0x7)

	void OnRep_bEnabled(); // Function Engine.SkyLight.OnRep_bEnabled // (Native|Public) // Param Size : 0x0, 0x7FF776871C80
};

// Class Engine.StreamableRenderAsset
// Size : 0x40 (Inherited : 0x28)
struct UStreamableRenderAsset : UObject {
	double ForceMipLevelsToBeResidentTimestamp; // 0x28(0x8)
	int32_t NumCinematicMipLevels; // 0x30(0x4)
	int32_t StreamingIndex; // 0x34(0x4)
	int32_t CachedCombinedLODBias; // 0x38(0x4)
	enum class None CachedNumResidentLODs; // 0x3C(0x1)
	unsigned char bCachedReadyForStreaming : 1; // 0x3D(0x1)
	unsigned char NeverStream : 1; // 0x3D(0x1)
	unsigned char bGlobalForceMipLevelsToBeResident : 1; // 0x3D(0x1)
	unsigned char bIsStreamable : 1; // 0x3D(0x1)
	unsigned char bHasStreamingUpdatePending : 1; // 0x3D(0x1)
	unsigned char bForceMiplevelsToBeResident : 1; // 0x3D(0x1)
	unsigned char bIgnoreStreamingMipBias : 1; // 0x3D(0x1)
	unsigned char bUseCinematicMipLevels : 1; // 0x3D(0x1)
	unsigned char UnknownData_3E[0x0002]; // 0x3E(0x2)
};

// Class Engine.Texture
// Size : 0xB8 (Inherited : 0x40)
struct UTexture : UStreamableRenderAsset {
	unsigned char UnknownData_40[0x0008]; // 0x40(0x8)
	struct FGuid LightingGuid; // 0x48(0x10)
	int32_t LODBias; // 0x58(0x4)
	enum class TextureCompressionSettings CompressionSettings; // 0x5C(0x1)
	enum class TextureFilter Filter; // 0x5D(0x1)
	enum class ETextureMipLoadOptions MipLoadOptions; // 0x5E(0x1)
	enum class TextureGroup LODGroup; // 0x5F(0x1)
	unsigned char SRGB : 1; // 0x60(0x1)
	unsigned char bNoTiling : 1; // 0x60(0x1)
	unsigned char VirtualTextureStreaming : 1; // 0x60(0x1)
	unsigned char CompressionYCoCg : 1; // 0x60(0x1)
	unsigned char bAsyncResourceReleaseHasBeenStarted : 1; // 0x60(0x1)
	unsigned char UnknownData_60_5 : 3; // 0x60(0x1)
	unsigned char UnknownData_61[0x0007]; // 0x61(0x7)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x68(0x10)
	unsigned char UnknownData_78[0x0040]; // 0x78(0x40)
};

// Class Engine.TextureCube
// Size : 0x110 (Inherited : 0xB8)
struct UTextureCube : UTexture {
	unsigned char UnknownData_B8[0x0058]; // 0xB8(0x58)
};

// Class Engine.StaticMeshComponent
// Size : 0x4A0 (Inherited : 0x430)
struct UStaticMeshComponent : UMeshComponent {
	int32_t ForcedLodModel; // 0x430(0x4)
	int32_t PreviousLODLevel; // 0x434(0x4)
	int32_t MinLOD; // 0x438(0x4)
	int32_t SubDivisionStepSize; // 0x43C(0x4)
	struct UStaticMesh* StaticMesh; // 0x440(0x8)
	struct FColor WireframeColorOverride; // 0x448(0x4)
	unsigned char bEvaluateWorldPositionOffset : 1; // 0x44C(0x1)
	unsigned char bOverrideWireframeColor : 1; // 0x44C(0x1)
	unsigned char bOverrideMinLOD : 1; // 0x44C(0x1)
	unsigned char bOverrideNavigationExport : 1; // 0x44C(0x1)
	unsigned char bForceNavigationObstacle : 1; // 0x44C(0x1)
	unsigned char bDisallowMeshPaintPerInstance : 1; // 0x44C(0x1)
	unsigned char bIgnoreInstanceForTextureStreaming : 1; // 0x44C(0x1)
	unsigned char bOverrideLightMapRes : 1; // 0x44C(0x1)
	unsigned char bCastDistanceFieldIndirectShadow : 1; // 0x44D(0x1)
	unsigned char bOverrideDistanceFieldSelfShadowBias : 1; // 0x44D(0x1)
	unsigned char bUseSubDivisions : 1; // 0x44D(0x1)
	unsigned char bUseDefaultCollision : 1; // 0x44D(0x1)
	unsigned char bReverseCulling : 1; // 0x44D(0x1)
	unsigned char UnknownData_44D_5 : 3; // 0x44D(0x1)
	unsigned char UnknownData_44E[0x0002]; // 0x44E(0x2)
	int32_t OverriddenLightMapRes; // 0x450(0x4)
	float DistanceFieldIndirectShadowMinVisibility; // 0x454(0x4)
	float DistanceFieldSelfShadowBias; // 0x458(0x4)
	float StreamingDistanceMultiplier; // 0x45C(0x4)
	struct TArray<struct FStaticMeshComponentLODInfo> LODData; // 0x460(0x10)
	struct TArray<struct FStreamingTextureBuildInfo> StreamingTextureData; // 0x470(0x10)
	struct FLightmassPrimitiveSettings LightmassSettings; // 0x480(0x18)
	unsigned char UnknownData_498[0x0008]; // 0x498(0x8)

	bool SetStaticMesh(struct UStaticMesh* NewMesh); // Function Engine.StaticMeshComponent.SetStaticMesh // (Native|Public|BlueprintCallable) // Param Size : 0x9, 0x7FF774964A90
	void SetReverseCulling(bool ReverseCulling); // Function Engine.StaticMeshComponent.SetReverseCulling // (Final|Native|Public|BlueprintCallable) // Param Size : 0x1, 0x7FF7769742C0
	void SetForcedLodModel(int32_t NewForcedLodModel); // Function Engine.StaticMeshComponent.SetForcedLodModel // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF776973EC0
	void SetDistanceFieldSelfShadowBias(float NewValue); // Function Engine.StaticMeshComponent.SetDistanceFieldSelfShadowBias // (Final|Native|Public|BlueprintCallable) // Param Size : 0x4, 0x7FF776973C40
	void OnRep_StaticMesh(struct UStaticMesh* OldStaticMesh); // Function Engine.StaticMeshComponent.OnRep_StaticMesh // (Final|Native|Public) // Param Size : 0x8, 0x7FF776973BC0
	void GetLocalBounds(struct FVector Min, struct FVector Max); // Function Engine.StaticMeshComponent.GetLocalBounds // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x18, 0x7FF776973A20
};

// Class Engine.InstancedStaticMeshComponent
// Size : 0x540 (Inherited : 0x4A0)
struct UInstancedStaticMeshComponent : UStaticMeshComponent {
	struct TArray<struct FInstancedStaticMeshInstanceData> PerInstanceSMData; // 0x498(0x10)
	int32_t NumCustomDataFloats; // 0x4A8(0x4)
	struct TArray<float> PerInstanceSMCustomData; // 0x4B0(0x10)
	int32_t InstancingRandomSeed; // 0x4C0(0x4)
	int32_t InstanceStartCullDistance; // 0x4C4(0x4)
	int32_t InstanceEndCullDistance; // 0x4C8(0x4)
	struct TArray<int32_t> InstanceReorderTable; // 0x4D0(0x10)
	unsigned char UnknownData_4E0[0x0048]; // 0x4E0(0x48)
	int32_t NumPendingLightmaps; // 0x528(0x4)
	unsigned char UnknownData_52C[0x0004]; // 0x52C(0x4)
	struct TArray<struct FInstancedStaticMeshMappingInfo> CachedMappings; // 0x530(0x10)

	bool UpdateInstanceTransform(int32_t InstanceIndex, struct FTransform NewInstanceTransform, bool bWorldSpace, bool bMarkRenderStateDirty, bool bTeleport); // Function Engine.InstancedStaticMeshComponent.UpdateInstanceTransform // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x44, 0x7FF77688EB70
	bool SetCustomDataValue(int32_t InstanceIndex, int32_t CustomDataIndex, float CustomDataValue, bool bMarkRenderStateDirty); // Function Engine.InstancedStaticMeshComponent.SetCustomDataValue // (Native|Public|BlueprintCallable) // Param Size : 0xE, 0x7FF77688EA20
	void SetCullDistances(int32_t StartCullDistance, int32_t EndCullDistance); // Function Engine.InstancedStaticMeshComponent.SetCullDistances // (Final|Native|Public|BlueprintCallable) // Param Size : 0x8, 0x7FF77688E960
	bool RemoveInstance(int32_t InstanceIndex); // Function Engine.InstancedStaticMeshComponent.RemoveInstance // (Native|Public|BlueprintCallable) // Param Size : 0x5, 0x7FF77688E8A0
	bool GetInstanceTransform(int32_t InstanceIndex, struct FTransform OutInstanceTransform, bool bWorldSpace); // Function Engine.InstancedStaticMeshComponent.GetInstanceTransform // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x42, 0x7FF77688DF50
	struct TArray<int32_t> GetInstancesOverlappingSphere(struct FVector Center, float Radius, bool bSphereInWorldSpace); // Function Engine.InstancedStaticMeshComponent.GetInstancesOverlappingSphere // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x28, 0x7FF77688E1E0
	struct TArray<int32_t> GetInstancesOverlappingBox(struct FBox Box, bool bBoxInWorldSpace); // Function Engine.InstancedStaticMeshComponent.GetInstancesOverlappingBox // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x30, 0x7FF77688E0B0
	int32_t GetInstanceCount(); // Function Engine.InstancedStaticMeshComponent.GetInstanceCount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // Param Size : 0x4, 0x7FF77688DF20
	void ClearInstances(); // Function Engine.InstancedStaticMeshComponent.ClearInstances // (Native|Public|BlueprintCallable) // Param Size : 0x0, 0x7FF77688D700
	bool BatchUpdateInstancesTransforms(int32_t StartInstanceIndex, struct TArray<struct FTransform> NewInstancesTransforms, bool bWorldSpace, bool bMarkRenderStateDirty, bool bTeleport); // Function Engine.InstancedStaticMeshComponent.BatchUpdateInstancesTransforms // (Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x1C, 0x7FF77688D510
	bool BatchUpdateInstancesTransform(int32_t StartInstanceIndex, int32_t NumInstances, struct FTransform NewInstancesTransform, bool bWorldSpace, bool bMarkRenderStateDirty, bool bTeleport); // Function Engine.InstancedStaticMeshComponent.BatchUpdateInstancesTransform // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x44, 0x7FF77688D2E0
	int32_t AddInstanceWorldSpace(struct FTransform WorldTransform); // Function Engine.InstancedStaticMeshComponent.AddInstanceWorldSpace // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x34, 0x7FF77688D200
	int32_t AddInstance(struct FTransform InstanceTransform); // Function Engine.InstancedStaticMeshComponent.AddInstance // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // Param Size : 0x34, 0x7FF77688D120
};

// Class Engine.HierarchicalInstancedStaticMeshComponent
// Size : 0x630 (Inherited : 0x540)
struct UHierarchicalInstancedStaticMeshComponent : UInstancedStaticMeshComponent {
	unsigned char UnknownData_540[0x0010]; // 0x540(0x10)
	struct TArray<int32_t> SortedInstances; // 0x550(0x10)
	int32_t NumBuiltInstances; // 0x560(0x4)
	unsigned char UnknownData_564[0x0004]; // 0x564(0x4)
	struct FBox BuiltInstanceBounds; // 0x568(0x1C)
	struct FBox UnbuiltInstanceBounds; // 0x584(0x1C)
	struct TArray<struct FBox> UnbuiltInstanceBoundsList; // 0x5A0(0x10)
	unsigned char bEnableDensityScaling : 1; // 0x5B0(0x1)
	unsigned char UnknownData_5B0_1 : 7; // 0x5B0(0x1)
	unsigned char UnknownData_5B1[0x0007]; // 0x5B1(0x7)
	int32_t OcclusionLayerNumNodes; // 0x5B8(0x4)
	struct FBoxSphereBounds CacheMeshExtendedBounds; // 0x5BC(0x1C)
	bool bDisableCollision; // 0x5D8(0x1)
	unsigned char UnknownData_5D9[0x0003]; // 0x5D9(0x3)
	int32_t InstanceCountToRender; // 0x5DC(0x4)
	unsigned char UnknownData_5E0[0x0050]; // 0x5E0(0x50)

	bool RemoveInstances(struct TArray<int32_t> InstancesToRemove); // Function Engine.HierarchicalInstancedStaticMeshComponent.RemoveInstances // (Final|Native|Public|HasOutParms|BlueprintCallable) // Param Size : 0x11, 0x7FF7768892A0
};

// Class Engine.StaticMeshActor
// Size : 0x230 (Inherited : 0x220)
struct AStaticMeshActor : AActor {
	struct UStaticMeshComponent* StaticMeshComponent; // 0x220(0x8)
	bool bStaticMeshReplicateMovement; // 0x228(0x1)
	enum class ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x229(0x1)
