// Class Slate.ButtonWidgetStyle
// Size : 0x2A8 (Inherited : 0x30)
struct UButtonWidgetStyle : USlateWidgetStyleContainerBase {
	struct FButtonStyle ButtonStyle; // 0x30(0x278)
};

// Class Slate.CheckBoxWidgetStyle
// Size : 0x5B0 (Inherited : 0x30)
struct UCheckBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FCheckBoxStyle CheckBoxStyle; // 0x30(0x580)
};

// Class Slate.ComboBoxWidgetStyle
// Size : 0x420 (Inherited : 0x30)
struct UComboBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FComboBoxStyle ComboBoxStyle; // 0x30(0x3F0)
};

// Class Slate.ComboButtonWidgetStyle
// Size : 0x3E8 (Inherited : 0x30)
struct UComboButtonWidgetStyle : USlateWidgetStyleContainerBase {
	struct FComboButtonStyle ComboButtonStyle; // 0x30(0x3B8)
};

// Class Slate.EditableTextBoxWidgetStyle
// Size : 0x820 (Inherited : 0x30)
struct UEditableTextBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FEditableTextBoxStyle EditableTextBoxStyle; // 0x30(0x7F0)
};

// Class Slate.EditableTextWidgetStyle
// Size : 0x248 (Inherited : 0x30)
struct UEditableTextWidgetStyle : USlateWidgetStyleContainerBase {
	struct FEditableTextStyle EditableTextStyle; // 0x30(0x218)
};

// Class Slate.ProgressWidgetStyle
// Size : 0x1D0 (Inherited : 0x30)
struct UProgressWidgetStyle : USlateWidgetStyleContainerBase {
	struct FProgressBarStyle ProgressBarStyle; // 0x30(0x1A0)
};

// Class Slate.ScrollBarWidgetStyle
// Size : 0x500 (Inherited : 0x30)
struct UScrollBarWidgetStyle : USlateWidgetStyleContainerBase {
	struct FScrollBarStyle ScrollBarStyle; // 0x30(0x4D0)
};

// Class Slate.ScrollBoxWidgetStyle
// Size : 0x258 (Inherited : 0x30)
struct UScrollBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FScrollBoxStyle ScrollBoxStyle; // 0x30(0x228)
};

// Class Slate.SlateSettings
// Size : 0x30 (Inherited : 0x28)
struct USlateSettings : UObject {
	bool bExplicitCanvasChildZOrder; // 0x28(0x1)
	unsigned char UnknownData_29[0x0007]; // 0x29(0x7)
};

// Class Slate.SpinBoxWidgetStyle
// Size : 0x318 (Inherited : 0x30)
struct USpinBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FSpinBoxStyle SpinBoxStyle; // 0x30(0x2E8)
};

// Class Slate.TextBlockWidgetStyle
// Size : 0x298 (Inherited : 0x30)
struct UTextBlockWidgetStyle : USlateWidgetStyleContainerBase {
	struct FTextBlockStyle TextBlockStyle; // 0x30(0x268)
};

// Class Slate.ToolMenuBase
// Size : 0x28 (Inherited : 0x28)
struct UToolMenuBase : UObject {
};

